*      * Р Е Д А К Т О Р *
	MACRO
&A	эквп
	GBLA	&NM
	ЭКВИВ	(&A,'71600'+&NM)
&NM	SETA	&NM+1
	MEND
БАЦ	СТАРТ	'6000'
	М
	ржа	3
	пв	ПРОГПБ(М14)
	уиа	(М12)
	пв	ПОВБОБ(М13)
	сч	ОБЛ
	пв	ЗАХВАТ(М13)
	пв	ДАЙЗП(М13)
	сч	ЧИСЛО
	зп	ИДОБЛ
	пв	ПРОГПБ(М14)
	зп	СДВИГ
	по	НАЧ
	уиа	1(М16)
	пв	ВВЧИС(М14)
	сч	ЧИСЛО
	зп	СДВИГ
НАЧ	счи	М17
	зп	И17 - УПР ИР 17
	уиа	МАГАЗ(М17)
	пв	НАЧАЛО(М15)
ПРЕД	ноп	* БЛОК РЕДАКТОРА (КОМАНДЫ К,Л,И,З,С,А,П,В,Н)
	уиа	-4(М15)
	сч	(0)
ОБНЛ	зп	ЛИСТЫ+4(М15)
	цикл	ОБНЛ(М15) - ОБНУЛИЛ БУФЕРН.ЛИСТЫ И СЧЕТЧ.ЛИСТОВ
	уиа	1(М10)
	счм	П177  * МАГАЗИННОЕ ДЛЯ ЧТСЛ ( ВХОД ЧЕРЕЗ ЗАМЛИС )
	или	Е40
	зп	ХВОСТ  * ДЛЯ НОРМАЛЬНОЙ РАБОТЫ ЧТСЛ
	сч	(0)
	пв	ЧТСЛ(М15)   * СЧИТАЛ 1 СЛОВО 0 ЗОНЫ
	зп	Р
	сда	64+24
	зп	ШАГ
	сч	П37
	зп	СЧЛИСТ - БЛОКИРУЮ СМЕНУ 0 ЗОНЫ
	сч	Р
	и	Е24П1
	нтж	П1
	по	РЕБ
	сч	1(М12)
	сда	64-17
	счмр	(0)   * АДРЕС В ПОСЛЕДНЕЙ ЗОНЕ
	сда	64+10
РЕБ	слиа	-1(М17) * НА ВСЯКИЙ СЛУЧАЙ
	по	РЕД * ПОСЛЕДНЯЯ СТРОКА НАХОДИТСЯ В 0 ЗОНЕ
	зп	Р    * НОМЕР ПОСЛЕДНЕЙ ЗОНЫ ДЛЯ ЧТСЛ
	уиа	-1(М12)
	слиа	1(М17)
	пв	ЗАМЛИС(М15)  * ПОСЛЕДНЯЯ ЗОНА В 4 ЛИСТ
РЕД	ноп	** ПРИЕМ РЕДАКТОРА
	сч	КОМПЕР
	э75	ЗАМП
	уиа	1(М10)   * ЛИСТЫ МЕТИМ ТОЛЬКО ПРИ НЕОБХОДИМОСТИ
	уиа	(М2) - ДЛЯ ВЫДСТР
	счи	0
	зп	НАЧНОМ
	зп	КОННОМ
	зп	ИНЗА   - ДЛЯ КОМАНДЫ "ЗАМЕНИТЬ"
	зп	Р4  - ШАГ ПРИ ВВОДЕ СТРОК ( ДЛЯ ВЫХ.ИЗ ПРОБ )
	сч	ПРИГЛ
	уиа	БУФЕР(М12)
	пв	ПРМ(М13)
	пе	РЕД
	пб	КЛЮЧРД
КОМПЕР	зп	(М17)
	уиа	-4(М12)
НАЧНОМ	эквп
КОННОМ	эквп
ИНЗА	эквп
	строк	3
З	ноп	* ЗАМЕНИТЬ
	сч	ВСЕЕД
	зп	ИНЗА
Л	ноп	* ЛИСТИНГ  ( НЕ БОЛЕЕ 2-Х ОПЕРАНДОВ )
	уиа	1(М1)  * ДЛЯ РАБОТЫ ВЫДСТР
	пв	ПРОГОН(М15)
	нтж	П377
	мод	КЛЮЧ
	мод	ЛИВО
	по	(0)
	уиа	СТВ(М14)
	пв	ПРОВБ(М15)
	пв	ТЕК10(М15)
	мод	КЛЮЧ
	мод	ЛИЗА
	пе	(0)
	зп	НАЧНОМ
	пио	ЛИЧН(М13)    * ЛИСТИНГ ОДНОЙ СТРОКИ
	пв	ПРОГОН(М15)
	нтж	П377
	по	ЛИЧН
	уиа	ЛИЧН(М14)
	пв	ПРОВБ(М15)
	пв	ТЕК10(М15)
ЛУГА	мод	КЛЮЧ
	мод	ЛИГА
	пе	(0)
	зп	КОННОМ
	пв	ПРОД(М16)
	пио	ЛИЧН(М13)
	пв	ПРОГОН(М15)
	нтж	П377
	по	ЛИЧН
	уиа	ЛИЧН(М14)
	пв	ПРОВБ(М15)
	уиа	ЛУГА(М15)
	пб	ТЕК10
ЛИЧН	сч	КЛЮЧ
	по	СТД
НЕТТ	уиа	РЕД(М13)
	пв	ВЫД(М14)
НЕТЕК	текст	П'ЗAДAЙ'
	конд	П'OБPAЗ0'В'377'
ПРОВБ	ноп	* ПРОВЕРКА НА ЛИСТИНГ БЕЗ НОМЕРОВ
	мод	КЛЮЧ
	уиа	(М16)
	мода	(М15)
	пино	(М16)  - НАЙ ИЛИ ЗАМ
	нтж	П336  - "Б"
	пе	(М15)
	уиа	2(М2)  - ДЛЯ ВЫДСТР
	пб	(М14)
П336	конд	В'336'
ЛИВО	конд	А(СТВ)
	конд	А(НЕТТ)
ЛИЗА	конд	А(НЕВОП)
	конд	А(ЛОБР)
ЛИГА	конд	А(НЕВОП)
	конд	А(ЛОБС)
ПРОД	ноп	* ПРОВЕРКА ДИАПАЗОНА СТРОК
*                 ВОЗВРАТ ПО М16
	сч	КОННОМ
	вч	НАЧНОМ
ПРОЖ	по	(М16)
	уиа	РЕД(М13)
	пв	ВЫД(М14)
НЕВД	текст	П'OШ.ДИA'
	конд	П'ПAЗOH0'В'377'
НЕВОП	ноп	* НЕВЕРНЫЙ ОПЕРАНД
	уиа	РЕД(М13)
	пв	ВЫД(М14)
НВО	текст	П'HEB.OП'
	конд	П'EPAHД0'В'377'
НЕВ	уиа	БУФЕР-3(М14) * ВОЗВРАТ ПО М13
	уиа	-2(М15)
НЕГР	сч	НВК+2(М15)
	зп	БУФЕР-1(М15)
	цикл	НЕГР(М15)
	сч	М40ЕТХ
	зп	4(М14)
	пб	ВЫД
НВК	текст	П'HEBEPHAЯ KOMAHДA'
	строк	2
СТВ	сч	Е24П1
	зп	КОННОМ
СТД	уиа	(М7)   * РАЗРЕШАЮ ВЫДАЧУ НА VТ
	пв	ПОСТР(М3)
СТН	пио	РЕД(М4) * БЫЛА ВЫДАЧА
	уиа	РЕД(М13)
	пв	ВЫД(М14)
НЕТС	текст	П'HET CT'
	конд	П'POK000'М16В'377'
	строк	3
И	ноп	* ИСКЛЮЧИТЬ ( НЕ БОЛЕЕ 2-Х ОПЕРАНДОВ )
	пв	ПРОГОН(М15)
	нтж	П377
	уиа	РЕД(М13)
	по	НЕВ
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	НАЧНОМ
	пио	ИАО(М13)
	пв	ПРОГОН(М15)
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	КОННОМ
	пино	НЕВОП(М13)  - НЕТ ЕТХ
	пв	ПРОД(М16)
ИАО	уиа	1(М7) * НАЙДЕННУЮ СТРОКУ НЕ ВЫДАВАТЬ НА VТ
	пв	ПОСТР(М3)
	уиа	ИСКЛ(М15)
	пб	ИСКР
ИСКР	сч	НОМЕР
	по	ИСКЛ
	вч	НАЧНОМ
	пе	ПРОБ
	нтж	(0)
	по	(М15)
	сч	КОННОМ
	по	ПРОБ
	вч	НОМЕР
	пе	ПРОБ
	пб	(М15)
ИСКЛ	сч	АДР2
	по	СТН    - ФАЙЛ ПУСТОЙ
	уиа	(М10)
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	сч	АДР2
	нтж	П1
	по	ПРОФ   - 1 СЛОВО 0 ЗОНЫ НЕ ИСКЛЮЧАЮ
	сч	СЛОВО
	или	Е48П32   ВСЕЕД В ССЫЛКЕ НАЗАД ИСКЛ СЛОВА
	зп	(М12)
	сч	СЛОВО
	сда	64-17
	счмр	(0)
	пв	ЧТСЛ(М15)
	или	Е31П15
	нтж	Е31П15
	счм	СЛОВО
	и	Е31П15
	или	(М17)
	зп	(М12)     ССЫЛКА ВПЕРЕД ПРЕДЫД.СЛОВА
	сч	СЛОВО
	сда	64+14
	и	Е17П1
	зп	АДР2
	уиа	(М4)      * НЕ ВЫДАВАТЬ ОШИБ.ДИАГНОСТИКУ
	пв	ЧТСЛ(М15)
	или	Е48П32
	нтж	Е48П32
	счм	СЛОВО
	и	Е48П32
	или	(М17)
	зп	(М12)     ССЫЛКА НАЗАД СЛЕД.СТРОКИ
	зп	СЛОВО
	пв	НОМСТР(М15)
ПРИС	уиа	ИСКЛ(М15)
	пб	ИСКР
ПРОФ	сч	СЛОВО
	сда	64+14
	и	Е17П1
	нтж	П1
	пе	ПРОБ - В ФАЙЛЕ ЕСТЬ СТРОКИ
	сч	П1
	зп	-1(М12)  * 0 СЛОВО 0 ЗОНЫ = 1
	пб	ПРОБ   * 1 СЛОВО 0 ЗОНЫ НЕ ИСКЛЮЧАЕМ
	строк	3
ПРОБ	ноп	* ПРИНУДИТЕЛЬНЫЕ ОБМЕНЫ
*            ЛИСТЫ , КОТОРЫЕ ПОМЕЧЕНЫ
*            ЗАПИСЫВ. НА ВН.НОСИТЕЛЬ
	пино	СТН(М4)  * ЕСЛИ СТРОКА ( СТРОКИ ) НЕ НАШЛИСЬ
	уиа	-4(М14)
ПРОН	сч	ЛИСТЫ+3(М14)
	по	ПРОЦ
	и	Е40
	пе	ПРОЦ
	сч	ЛИСТЫ+3(М14)
	нтж	Е40
	зп	ЛИСТЫ+3(М14)
	нтж	Е40
	пв	ОБМЕН(М13)
ПРОЦ	цикл	ПРОН(М14)
	сч	Р4
	по	РЕД
	слц	НАЧНОМ
	пб	ВВОД
	строк	3
В	ноп	* ВВОД НОВЫХ СТРОК В ФАЙЛ ИЛИ ЗАМЕНА СТАРЫХ
	сч	ШАГ
	зп	Р4
	пв	ПРОГОН(М15)
	нтж	П377
	по	ЕТХ - ВВОД В КОНЕЦ
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	НАЧНОМ
	пио	ВВОД(М13)   * ШАГ ВВОДА = 10
	пв	ПРОГОН(М15)
	нтж	П377
	по	ВВОД
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	Р4
	сч	НАЧНОМ
ВВОД	зп	НАЧНОМ
	сда	64+24
	пе	НЕВВО
	сч	НАЧНОМ
	уиа	-48(М13)
	уиа	БУФЕР(М14)
	уиа	-127(М3) - МАКС.ДЛИНА СТРОКИ (ДЛЯ ВХВВ)
	пв	ТЕК8(М15)
	сч	НАЧНОМ
	пв	НБАЙТ(М15)
	слиа	-1(М1)
	уиа	БУФЕР(М12)
	сч	П17
	пв	DЗАПСИ(М16)
	сч	П377
	пв	DЗАПСИ(М16)
	сч	(М12)
	пв	ПРМ(М13)
	уии	М14(М12)
	уиа	48(М11)
	уиа	-48(М13)
	пв	DВБСИР(М16)
	уиа	(М5)
	нтж	П377
	по	РЕД
	пб	ВХВВ
	строк	3
ЕТХ	ноп	*  ВВОД СТРОК В КОНЕЦ ФАЙЛА
	сч	ШАГ
	зп	Р4
	сч	(0)
	пв	ЧТСЛ(М15)
	нтж	П1
	по	СНАЧ
	сч	1(М12)
	сда	64-17
	счмр	(0)
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	пв	НОМСТР(М15)
	слц	Р4
	пб	ВВОД
СНАЧ	сч	Р4
	пб	ВВОД
ШАГ	эквп
	строк	3
ЛОБР	ноп	* ПОИСК ПО ОБРАЗУ
	слиа	-'30'(М11)
	пино	НЕВОП(М11)  - НЕЦИФР.СИМВОЛ НЕ ПЕРВЫЙ ПОСЛЕ ПРОБЕЛА
	слиа	'30'(М11)
	счм	Е24П1
	зпм	КОННОМ  - БЕЗ ОПЕРАНДОВ ПОИСК ВО ВСЕМ ФАЙЛЕ
ЛОБС	вчоб	П11
	зп	СИМРАЗ
	уиа	ОБРАЗ(М14)
	уиа	(М7)
	мод	ИНЗА
	уиа	(М15)
	сч	(0)
	зп	И5
	зп	РЖВВ
ЗАВС	уиа	-48(М13)
	уиа	-46(М5)
ЗОБР	пв	DВБСИР(М16)
	нтж	П377
	по	НЕТРАЗ  - НЕТ РАЗДЕЛИТЕЛЯ
	нтж	П377
	нтж	СИМРАЗ
	по	КОБР
	нтж	СИМРАЗ
	пв	DЗАПСИ(М16)
	цикл	ЗОБР(М5)
	пб	НЕТРАЗ
КОБР	слиа	46(М5)
	счи	М5
	пио	ПОВХ(М15)
	уиа	ЗАМЕНА(М14)
	сда	64-24
ПОВХ	или	И5
	зп	И5
	цикл	ЗАВС(М15)
	уиа	(М1)  - ДЛЯ ВЫХОДА ИЗ ПОСТР
	пв	ПОСТР(М3)
	пино	СТН(М4)   * НЕТ СТРОК В ДИАПАЗОНЕ
	сч	ИНЗА
	по	ПОПР
ПОМЗ	сч	И5
	сда	64+24
	уи	М5    - ВОССТ.ИР 5 ДЛЯ ОБРАЗА
ПОПР	уиа	48(М6)
	уиа	БУФЕР(М3)
	уиа	-1(М2)
	уиа	(М15)   * ДЛЯ ПРОХОДА НОМЕРА СТРОКИ
СНАТ	уиа	48(М13)
	уиа	ОБРАЗ(М14)
	уии	М11(М6)
	уии	М12(М3)
НОМВ	пв	DВБСИР(М16)  - ХОЛОСТОЙ
	пино	НАЧПО(М15)   - НОМЕР СТРОКИ УЖЕ ПРОЙДЕН
	нтж	П17
	пе	НОМВ   * ПРОШЕЛ НОМЕР СТРОКИ
НАЧПО	уии	М15(М5)
	уии	М6(М11)
	уии	М3(М12)
	слиа	1(М2)   * СЧЕТЧИК СИМВОЛОВ ДО ОБРАЗА
ПРДП	пино	НЕЗО(М13)
	уиа	48(М13)
	слиа	1(М14)
НЕЗО	пио	ЕСОБР(М15)
	пв	DВБСИР(М16)
	слиа	-8(М13)
	нтж	П375
	по	СЛЕСТ  * ПЕРЕХОД НА СЛЕД.СТРОКУ
	нтж	П375
	счм	(М14)
	сда	64(М13)
	и	П377
	нтж	(М17)
	пе	СНАТ
	слиа	-1(М15)
	пб	ПРДП
СЛЕСТ	уиа	1(М4)
	уиа	(М2) - ДЛЯ РАБОТЫ ВЫДСТР
	пв	СОNТ(М3)
	пио	ПОПР(М4)
	сч	РЖВВ
	по	ОБНЕН
	уиа	(М4)
	сч	ИНЗА
	пе	ПРОБ  * ВЫХОД ИЗ ЗАМЕНЫ
	пб	РЕД
ЕСОБР	сч	П1
	зп	РЖВВ
	сч	ИНЗА
	пе	ЗАМСТ  * НА ЗАМЕНУ ОБРАЗА
	уиа	БУФЕР(М14)
	пв	ВЫВОД(М15)
	уиа	1(М4)
	уиа	(М2)
	пв	СОNТ(М3)
	пино	РЕД(М4)
	пб	ПОПР
И5	эквп
СИМРАЗ	эквп
НЕТРАЗ	сч	СИМРАЗ
	сда	64-40
	или	М40ЕТХ+1
	зп	ТЕКРА
	уиа	РЕД(М13)
	пв	ВЫД(М14)
НЕРА	текст	П'HET PAЗДEЛИTEЛЯ'
ТЕКРА	пам	1
ОБНЕН	уиа	РЕД(М13)
	пв	ВЫД(М14)
ОБРНН	текст	П'OБPAЗ HE HAЙ'
	конд	П'ДEH000'М16В'377'
	строк	2
ЗАМСТ	ноп	* ЗАМЕНА ОБРАЗА В СТРОКЕ
*        М5 - ЧИСЛО СИМВОЛОВ В ОБРАЗЕ
*        И5 - ЧИСЛО СИМВОЛОВ В ЗАМЕНЕ
*  В БУФЕРЕ - СТРОКА С НАЙДЕННЫМ ОБРАЗОМ
*    СДВИГАЮ БУФЕР ВПРАВО НА 8 СЛОВ (ЧТОБЫ ВМЕСТ.ЗАМЕНА)
	уиа	23(М16) - ДЛИНА БУФЕРА ( 138 СИМВОЛОВ )
	уии	М6(М11)
	уии	М3(М12)   * ЗАПОМНИЛ ПОЗИЦИЮ БАЙТА ПОСЛЕ ОБРАЗА
СДБУФ	слиа	-1(М16)
	сч	БУФЕР(М16)
	зп	БУФЕР+8(М16)
	пино	СДБУФ(М16)
	уиа	48(М11)
	уиа	БУФЕР+8(М12)
	уиа	-48(М13)
	уиа	БУФЕР(М14)
ПЕНС	пв	DВБСИР(М16)
	зп	(М17)
	пв	DЗАПСИ(М16)    * ПЕРЕПИСАЛ НОМЕР СТРОКИ
	сч	(М17)
	нтж	П17
	пе	ПЕНС
ПЕУТ	пио	ПЕРО(М2)
	пв	DВБСИР(М16)
	пв	DЗАПСИ(М16)    * ПЕРЕПИСАЛ СИМВОЛЫ ДО ОБРАЗА
	слиа	-1(М2)
	пб	ПЕУТ
ПЕРО	уиа	48(М11)
	уиа	ЗАМЕНА(М12)
	мод	И5
	уиа	(М15)
ПЕРЗ	пио	ПОГТ(М15)
	пв	DВБСИР(М16)
	слиа	-1(М15)
	пв	DЗАПСИ(М16)
	пб	ПЕРЗ       * ПЕРЕПИСАЛ ЗАМЕНУ
ПОГТ	уии	М11(М6)
	уии	М12(М3)
	слиа	8(М12)
ДОПИС	пв	DВБСИР(М16)
	зп	(М17)
	пв	DЗАПСИ(М16)     * ДОПИСАЛ СТРОКУ
	сч	(М17)
	нтж	П375
	пе	ДОПИС
	слиа	-8(М13)
	сч	П377
	пв	DЗАПСИ(М16)
	уиа	БУФЕР(М12)
	сч	КОННОМ
	зп	РЖВВ
	пб	РЕДСТР
ПРОЗА	уиа	1(М4)
	уиа	(М7)
	уиа	(М1)
	сч	РЖВВ
	зп	КОННОМ
	пв	СОNТ(М3)
	слиа	-1(М4)
	пио	ПРОБ(М4)
	пб	ПОМЗ
	строк	3
РЕДСТР	ноп	* РЕДАКТИРОВАНИЕ СТРОКИ
	уиа	48(М11)
	пв	ТЕК10(М15)
	уии	М15(М13)
	уиа	РЕД(М13)
	пе	НЕВ
	нтж	(0)
	по	НЕВ  * НОМЕР СТРОКИ НЕ МОЖЕТ БЫТЬ 0
	зп	НАЧНОМ
	пио	ИАО(М15)  * ИСКЛЮЧАЕМ СТРОКУ С ДАННЫМ НОМЕРОМ
	уиа	-48(М13)
	уиа	БУФЕР(М14)  * В БУФЕР ПИШЕМ СВЕРТКУ СТРОКИ
	пв	НБАЙТ(М15)
	слиа	-1(М1)
	уиа	-1(М5)
	уиа	-127(М3) - МАКСИМ.ЧИСЛО СИМВОЛОВ СТРОКИ
ФОРС	слиа	1(М5)
	пв	DВБСИР(М16)
	нтж	П377
	по	ЕТХС
ВХВВ	нтж	П360
	уиа	'200'(М15)
	по	ПРЕВ
	нтж	П17
	уиа	ФОРС(М16)
	цикл	DЗАПСИ(М3)
ДЛИС	уиа	РЕД(М13)
	пв	ВЫД(М14)
ДЛСТ	текст	П'CTPOKA > 128 CИMBO'
	конд	П'ЛOB000'М16В'377'
ПРЕВ	ноп	*  СВЕРТКА ПРОБЕЛОВ
	слиа	1(М15)
	пв	DВБСИР(М16)
	нтж	П377
	по	ЕТХС
	нтж	П360
	пе	ЗАПР
	цикл	ПРЕВ(М3)
	пб	ДЛИС
ЗАПР	счим	М15
	пв	DЗАПСИ(М16)
	сч	(М17)
	нтж	П17
	слиа	1(М5)
	уиа	ФОРС(М16)
	цикл	DЗАПСИ(М3)
	пб	ДЛИС
ЕТХС	пио	ИАО(М5) * ПЕРВ.СИМВОЛ ПОСЛЕ СЛУЖ.- ЕТХ
*               ИСКЛЮЧАЕМ СТРОКУ С ЭТИМ НОМЕРОМ
	пв	ДЛИНЗ(М15)  * НА М6 - ДЛИНА ЭЛ-ТА ЗАПИСИ
	счи	0
	зп	КОННОМ
	пб	ЗМСТР
	строк	3
П	ноп	*  ПЕРЕНУМЕРАЦИЯ СТРОК ФАЙЛА
	уиа	(М2)  - ОТЛИЧИЕ ОТ СЛИТЬ
	сч	ЗАМП
	слц	П1
	э75	ЗАМП  * ЧТОБ В ЧТСЛ НЕ ИСПОЛЬЗОВАЛСЯ БЛИСТ
	сч	Е24П1
	зп	КОННОМ
	сч	ШАГ
	зп	НОМПЕР  * ЕСЛИ НЕТ ПАРАМЕТРОВ
	пв	ПРОГОН(М15)
	нтж	П377
	по	ПЕРМ
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	НОМПЕР
	пио	ПЕРМ(М13)
	пв	ПРОГОН(М15)
	нтж	П377
	по	ПЕРМ
	пв	ТЕК10(М15)
	пе	НЕВОП
	пино	НЕВОП(М13)
	зп	ШАГ
	пб	ПЕРМ
НУМБ	конд	В'170000'
АДРП	эквп
СЛОП	эквп
Е16Е1	конд	М15В'1'В'1'
МАКП	конд	В'40'
	строк	3
ПЕРМ	ноп	* НАЧАЛО ПЕРЕНУМЕРАЦИИ
	сч	БЛИСТ
	сда	64-10
	уи	М14   * АДРЕС 0 СЛОВА 0 ЗОНЫ
	сда	64-20
	или	НУМБ
	зп	ХВОСТ   * РАБОТАЕМ В БУФЕРНОМ ЛИСТЕ
	сч	П1
	зп	АДРП    - ССЫЛКА НАЗАД
	сч	ШАГ
	сда	64-24
	или	П2
	зп	(М14)   * 0 СЛ.0 ЗОНЫ
	зп	НСЛО
	сч	Е16Е1
	зп	1(М14)  * 1 СЛ.0 ЗОНЫ
*     СОЗДАЛ ПОКА ПУСТОЙ ФАЙЛ
	слиа	2(М14)
	уиа	1(М7)
	пв	ПЕРВ(М3)
	вчоб	КОННОМ
	пе	ВЕСЛ
СОNП	сч	НОМПЕР(М2)
	пв	НБАЙТ(М15)
	сч	СЛОВО
	сда	64+7
	и	П177
	уи	М5 - ЧИСЛО БАЙТ ИНФ.В СТРОКЕ
	сда	64-7
	счм	АДРП
	сда	64-31
	счим	М1
	сда	64-5
	или	(М17)
	или	(М17)
	зп	СЛОП
	слиа	-1(М1)
	пв	ДЛИНЗ(М15)  - УСТ НА М6 ДЛИНЫ ЭЛ-ТА ЗП
	слиа	1(М12)   - СЧИТ ИНФОРМАЦИИ В СТРОКЕ
	пв	УМЕЩ(М15)  - УМЕСТИТСЯ ЛИ ЭТА СТРОКА
	пв	ВСЛП(М15)  - УСТ АДРП ПО М14
	счи	М6
	зп	(М17)
	слц	АДРП
	сда	64-14
	или	(М17)
	или	СЛОП
	зп	СЛОП    - СЛ.СЛОВО НОВОЙ СТРОКИ
	зп	(М14)
	счи	М14
	зп	Р5
	сч	НОМПЕР(М2)
	пв	НОМЗАП(М15)  - ВПИСАЛ В ОЗУ НОМЕР СТРОКИ
ПРЕП	пио	КОПЕР(М5) - КОНЕЦ ЗАПИСИ ИНФ.СТРОКИ
	пв	DВБСИР(М16)
	пв	DЗАПСИ(М16)
	слиа	-1(М5)
	пб	ПРЕП
КОПЕР	слиа	1(М14)  - АДРЕС СЛЕД.СЛ.СЛОВА
	пв	СОNТ(М3)
	сч	КЛЮЧ
	нтж	П3
	по	ППЕР
	сч	НОМЕР
	вчоб	КОННОМ  - НОМЕР , ЗА КОТОРЫМ СЛИВАТЬ
	по	ППЕР
ВЕСЛ	пио	ПЕРПЕ(М2)
	сч	НАЧДИА
	зп	НАЧНОМ
	сч	КОННОМ
	нтж	Е24П1
	чед
	уи	М16
	сч	КОННОМ
	пино	МЕТЛА(М16)
	сч	НОМЕР
МЕТЛА	зп	НОМПЕР
	слц	П1
	зп	НАЧДИА  - ЗАПОМНИЛ НОМЕР ДЛЯ ДОЗАПИСИ
	сч	КОНДИА
	зп	КОННОМ
	пв	ПОСТР(М3)
ТОРА	уиа	(М2)
	вч	НАЧНОМ
	пе	НТС
	сч	НОМЕР
	вчоб	КОННОМ
	по	ППЕР
НТС	уиа	НЕТС(М14)
	уиа	ПРЕД(М13)
	пб	ВЫД  - НЕТ СТРОК В ДИАПАЗОНЕ
ПЕРПЕ	ноп	* ДОПИСАТЬ ФАЙЛ С ПЕРЕНУМЕРАЦИЕЙ
	сч	НАЧДИА
	зп	НАЧНОМ
	сч	Е24П1
	зп	КОННОМ
	сч	П3
	зп	КЛЮЧ - УСТ.РЕЖИМА ПЕРЕНУМЕРАЦИИ
	пв	ПОСТР(М3)
ППЕР	счи	М6
	слц	НСЛО
	зп	НСЛО
	пино	СОNП(М2)
	сч	НОМПЕР
	слц	ШАГ
	зп	НОМПЕР
	вчоб	Е24П1
НЕВВО	по	СОNП   - ПЕРЕП.СЛЕД.СТРОКИ
	уиа	ПРЕВН(М14)
	уиа	ПРЕД(М13)
	пб	ВЫД
ПРЕВН	текст	П'HOMEP CTPOKИ > 167'
	конд	П'772150'В'377'
	строк	3
УМЕЩ	ноп	* ПРОВЕРКА ОСТАВШЕГОСЯ МЕСТА
	сч	НСЛО
	и	Е24П1
	вчоб	П2000
	счим	М6
	вчоб	(М17)
	по	(М15)   - СТРОКА УМЕСТИЛАСЯ
	мод	Р5  * ИНФ СЛОВО ПРЕД.СТРОКИ
	сч	(0)
	или	Е31П15
	нтж	Е31П15
	счм	ХВОСТ
	и	П177
	слц	П1
	сда	64-10
	слц	П1
	сда	64-14
	или	(М17)
	мод	Р5
	зп	(0)    - ССЫЛКА ВПЕРЕД ВА СЛЕД.ЗОНУ
	сч	БЛИСТ
	сда	64-10
	уи	М14
	сч	НСЛО
	зп	(М14)   * ВПИСАЛ 0 СЛОВО ЗОНЫ
	сч	П1
	зп	НСЛО
	сч	ХВОСТ
	пв	ОБММБ(М13)  * БЛИСТ => БАРАБАН
	сч	ХВОСТ
	слц	П1
	зп	ХВОСТ
	и	П177
	нтж	ЧИСЗОН
	по	НЕТПЕ  * ПЕРЕНУМ.ФАЙЛ БОЛЬШЕ СТАРОГО
	сч	ХВОСТ
	и	П177
	вчоб	МАКП  = ПОКА МАКС.ЧИСЛО ЗОН ПЕРЕНУМ.
*    ( НЕОХОТА ОТБИРАТЬ РЕСУРСЫ МБ МАШИНЫ )
	пе	НЕТПЕ  * НЕТ БОЛЬШЕ МЕСТА - АВАРИЯ
	сч	П1
	зп	(М14)
	слиа	1(М14)
	пб	(М15)
	строк	3
ПЕРКО	ноп	* ВЫХОД ПРИ УДАЧНОМ ИСХОДЕ
	сч	БЛИСТ
	сда	64-10
	уи	М15
	сч	Е24П1
	нтж	ВСЕЕД
	и	(М15)
	счим	М14
	и	П1777
	или	(М17)
	зп	(М15)   * 0 СЛОВО ПОСЛЕДНЕЙ ЗОНЫ
	счи	М6
	счим	М14
	вч	(М17)
	уи	М14    * АДР СЛ.СЛОВА ПОСЛЕДНЕЙ СТРОКИ В ОЗУ
	сч	СЛОП
	или	Е31П15
	нтж	Е31П15
	счм	П1
	сда	64-14
	или	(М17)
	зп	(М14)    - СЛ.СЛОВО ПОСЛЕДН.СТРОКИ
	сч	ХВОСТ
	пв	ОБММБ(М13)  - ПОСЛЕДНИЙ НА МБ
	сч	БЛИСТ
	сда	64-30
	или	Е40
	или	НУМБ
	зп	Р2
	пв	ОБММБ(М13)   СЧИТАЛ С МБ 0 ЗОНУ
	сч	АДРП
	сда	64-31
	или	1(М15)
	зп	1(М15)   - СКОРРЕКТИРОВАЛИ 1 СЛОВО 0 ЗОНЫ
*      ЗАПИСЬ НОВОГО ТЕКСТА В ФАЙЛ
	сч	БЛИСТ
	сда	64-30
	или	НУ
ПЕНА	зп	Р3   * ИНФ СЛ.ОБМЕНА С МД
	пв	ОБМЕН(М13)
	сч	Р2
	нтж	ХВОСТ
	и	П37
	по	ПРЕЗ - ДОЗАПИСЬ ЗОН С 1 В 0-М СЛ.
	сч	Р2
	слц	П1
	зп	Р2
	пв	ОБММБ(М13)
	сч	Р3
	слц	П1
	пб	ПЕНА
ПРЕЗ	сч	П1
	зп	(М15)
	сч	Р3
	слц	П1
	зп	Р3
	нтж	ЧИСЗОН
	и	П37
	по	ПРЕД - ЗОН БОЛЬШЕ НЕТ
	уиа	ПРЕЗ(М13)
	сч	Р3
	пб	ОБМЕН
	строк	3
С	ноп	*    СЛИТЬ
	уиа	1(М2)
	сч	ЗАМП
	слц	П1
	э75	ЗАМП
	сч	Е24П1
	зп	КОННОМ
	зп	КОНДИА
	сч
	зп	НАЧДИА
	пв	ПРОГОН(М15)
	нтж	П377
	по	ПЕРМ
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	НАЧДИА
	пио	НЕВОП(М13)
	пв	ПРОГОН(М15)
	нтж	П377
	по	НЕВОП
	уиа	1(М7) - ДЛЯ ПОСТР
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	КОНДИА
	вч	НАЧДИА
	пе	ПРОЖ
	пио	ПЕРМ(М13)
	пв	ПРОГОН(М15)
	нтж	П377
	по	ПЕРМ
	пв	ТЕК10(М15)
	пе	НЕВОП
	зп	КОННОМ
	пино	НЕВОП(М13)
	пб	ПЕРМ
НАЧДИА	эквп
КОНДИА	эквп
	строк	3
ПОСТР	ноп	* ПОИСК СТРОКИ В ФАЙЛЕ *
*         КОД ОТВЕТА ПРИ ОШ.СТРУКТУРЫ НА М15
*         0 - ДЛИНА ЭЛ-ТА ЗАПИСИ =0
*         1 - НЕТ НОМЕРА СТРОКИ
*         2 - ДЛИНА 1 - ГО СЛОВА 0 ЗОНЫ
*         3 - НЕВЕРНАЯ ССЫЛКА
*         М7 = 0  -  БУДЕТ ВЫДАЧА СТРОК НА VТ
*         ПРИ ВЫХОДЕ  М4 = 0  -  БЫЛА ВЫДАЧА
*         ВОЗВРАТ ПО М3
	сч	(0)
	зп	АДР2
	зп	НОМЕР
	уиа	1(М4)  ЕЩЕ НЕ БЫЛО ВЫДАЧИ
	уиа	-3(М16) ПОИСК СТРОКИ В ПРИСУТСТВ.ЛИСТАХ
	сч	Е24П1
	зп	Р3    *  МАКСИМАЛЬНЫЙ НОМЕР СТРОКИ
	сч	СЧЛИСТ
	нтж	П37
	по	СМЕНА
	нтж	П37
СМЕНА	зп	Р
	слц	БЛИСТ
	слц	П1
	сда	64-10
	уи	М12    АДРЕС СЛ.СЛОВА В ОЗУ
	мод	Р
	сч	ЛИСТЫ
	по	ПОСЛЗ   - ПОИСК СТРОК В ПОСЛЕДНЕЙ ЗОНЕ
	сч	(М12)
	и	Е24П1
	зп	СЛ00  0 СЛОВО ЗОНЫ
	вчоб	П2000
	пе	НЕКОР0     - НЕКОРР.0 СЛОВО ЗОНЫ
	нтж	П1777
	по	ПУФ - ФАЙЛ ПУСТОЙ
СЛОЕ	слиа	1(М12)
	счи	М12
	и	П1777
	по	ПЕРЕХ - 2000
	вч	СЛ00
	по	ПЕРЕХ    В ЭТОЙ ЗОНЕ НЕ НАШЛИ
	сч	(М12)
	зп	СЛОВО
	нтж	Е48П32
	и	Е48П32
	по	НЕТО
	сч	СЛОВО
	и	П37
	по	НЕКОР2  - ДЛИНА ЭЛ-ТА ЗАПИСИ = 0
	нтж	П1
	по	СЛОЕ
	пв	НОМСТР(М15)
	вч	НАЧНОМ
	вчаб	(0)   * БЕРУ МОДУЛЬ РАЗНОСТИ
	нтж	(0)
	пе	НСТФ
	счи	М12
	пв	ВСЛО(М15)
	пб	ПОРА
НСТФ	вчоб	Р3
	пе	НЕТО
	вчоб	Р3
	зп	Р3      * УМЕНЬШИЛОСЬ ПРИРАЩЕНИЕ
	сч	НОМЕР
	зп	Р1
	сч	СЛОВО
	зп	Р2
	счи	М12
	пв	ВСЛО(М15)
НЕТО	сч	СЛОВО
	и	П37
	уи	М15
	слиа	-1(М15)
	сли	М12(М15)
	пб	СЛОЕ
ПЕРЕХ	сч	Р   * ПРОДОЛЖЕНИЕ ПОИСКА В ПРЕД.ЛИСТЕ
	нтж	Е24П1
	по	НЕТН   * В ПОСЛЕДНЕЙ ЗОНЕ УЖЕ ИСКАДИ
	сч	Р
	слц	П3
	и	П3
	цикл	СМЕНА(М16)
ПОСЛЗ	сч	ХВОСТ
	нтж	П177
	и	П177
	по	НЕТН   * ПОСЛЕДНЕЙ ЗОНЫ НЕТ
	сч	П37
	сда	64-12
	и	ХВОСТ
	нтж	НУМБ
	по	НЕТН  - ПРИ КОМАНДЕ "СЛИТЬ"
	сч	Е24П1
	пб	СМЕНА
НЕТН	сч	Р2
	зп	СЛОВО
	сч	Р1
	вч	НАЧНОМ
	пе	СОNТ
	строк	3
НАЗАД	ноп	* ПОИСК ПО УБЫВАШИЮ НОМЕРОВ ПО ССЫЛКАМ
	сч	АДР2
	зп	Р3
	сч	СЛОВО
	сда	64-17
	счмр	(0)
	зп	АДР2
	нтж	П1
	по	ПЕРВ
	сч	АДР2
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	сда	64+14
	и	Е17П1
	нтж	Р3
	пе	НЕКОР3  - НЕВЕРНАЯ ССЫЛКА
	сч	СЛОВО
	и	П37
	по	НЕКОР2
	нтж	П1
	по	НАЗАД
	пв	НОМСТР(М15)
	вчоб	НАЧНОМ
	пе	НАЗАД
	пб	ПОРШ
	строк	3
ПЕРВ	ноп	* ПЕРВОЕ ОБРАЩЕНИЕ К ПОСТР
*                      ЛИБО ОБРАЩЕНИЕ К ПОСТР С НАЧНОМ = 0
	сч	(0)
	пв	ЧТСЛ(М15)
	и	Е24П1
	вчоб	П2000
	пе	НЕКОР0 - НЕКОР.0 СЛОВО 0 ЗОНЫ
	нтж	П1777
	по	ПУФ - ФАЙЛ ПУСТОЙ
	сч	П1
	зп	АДР2
	зп	Р3
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	и	П177
	нтж	П1
	пе	НЕКОР1
	строк	2
СОNТ	ноп	ПОИСК ПО ВОЗРАСТАНИЮ НОМЕРОВ ПО ССЫЛКАМ
	сч	АДР2
	зп	Р3
	уиа	КОНФ(М16)
	пв	ПРОК(М15)
	зп	АДР2
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	сда	64-17
	счмр	(0)
	нтж	Р3
	пе	НЕКОР3
	сч	СЛОВО
	и	П37
	по	НЕКОР2
	нтж	П1
	по	СОNТ
ПОРШ	пв	НОМСТР(М15)
	вч	НАЧНОМ
	пе	СОNТ
ПОРА	сч	НОМЕР
	мода	(М3)
	пино	(М7)
	нтж	НАЧНОМ
	по	ВЫДСТР
	сч	КОННОМ
	по	(М3)
	вч	НОМЕР
	пе	(М3)
	строк	2
ВЫДСТР	ноп	ВЫДАЧА СТРОКИ НА ЭКРАН
*             М12 - АДРЕС ИНФ.СЛОВА СТРОКИ В ОЗУ
	уиа	-48(М13)
	уиа	БУФЕР(М14)
	уиа	(М4)
	пино	БЕЗНО(М2)  - ЛИСТ.БЕЗ НОМЕРОВ И ФОРМ.
	сч	НОМЕР
	пв	ТЕК8(М15)
	сч	П17
	пв	DЗАПСИ(М16)
БЕЗНО	сч	СЛОВО
	сда	64+7
	и	П177
	по	ОБХ
	уи	М15
	слиа	1(М12)
ВДЦ	пв	DВБСИР(М16)
	зп	Р
	и	П200
	пе	РЗП
	сч	Р
ДВО	пв	DЗАПСИ(М16)
ВЫЦ	слиа	-1(М15)
	пино	ВДЦ(М15)
ОБХ	сч	П375
	пв	DЗАПСИ(М16)
	сч	П377
	пв	DЗАПСИ(М16)
	мода	(М3)
	пио	(М1)  -  НА ПОИСК,ЗАМЕНУ
	уиа	БУФЕР(М14)
	уиа	СОNТ(М15)
	пб	ВЫВОД
РЗП	сч	Р
	нтж	П200
	уи	М4
	пе	СВ
	сч	П120
	пб	ДВО
СВ	сч	П17
	пв	DЗАПСИ(М16)
	слиа	-1(М4)
	пино	СВ(М4)
	пб	ВЫЦ
КОНФ	ноп	* КОНЕЦ ФАЙЛА ЧТЕНИЯ
	сч	КЛЮЧ
	вч	П3
	по	РАПС - ПРИ СЛИТИИ И ПЕРЕНУМЕРАЦИИ
	сч	Р3
	зп	АДР2    * АДРЕС ПЕРВОЙ ЛИБО ПОСЛЕДНЕЙ СТРОКИ ФАЙЛА
	пв	ЧТСЛ(М15)
	уии	М15(М3)
	пб	НОМСТР
РАПС	уи	М15
	пио	ПЕРКО(М15)
	счи	М3
	нтж	АТО
	по	ТОРА
	пб	ВЕСЛ
АТО	конд	А(ТОРА)
ПУФ	сч	КЛЮЧ
	нтж	П2
	по	ПОРА
	уиа	LПУФ(М14)
	уиа	ПРЕД(М13)
	пб	ВЫД
LПУФ	конд	П'ФAЙЛ П'
	конд	П'YCTOЙ0'В'377'
П120	конд	В'120'
П375	конд	В'375'
Е48П32	конд	В'7777760000000000'
Е31П15	конд	В'0000017777740000'
Е17П1	конд	В'0000000000377777'
АДР2	эквп
СЛОВО	эквп
НОМПЕР	эквп	,          * * * * * * * * * * * * * *
НОМЕР	эквп	,           НОМПЕР И НОМЕР НЕ РАЗДЕЛЯТЬ
НСЛО	эквп
СЛ00	эквп
	строк	3
НЕКОР0	мода	НЕ0-НЕ1 ** НЕКОРРЕКТНО 0 СЛОВО ЗОНЫ
НЕКОР1	мода	НЕ1-НЕ2 ** ДЛИНА 1 СЛОВО 0 ЗОНЫ <> 1
НЕКОР2	мода	НЕ2-НЕ3 ** ДЛИНА ЭЛ-ТА ЗАПИСИ = 0
НЕКОР3	уиа	НЕ3(М14) ** НЕВЕРНАЯ ССЫЛКА ***
	пв	ВЫВОД(М15)
	уиа	ПРЕД(М15)
	уиа	БУФЕР(М14)
	счи	М12
	пв	ВСЛО(М15)
	сда	64-38
	сда	64+2
	рзб	П4710
	или	П1ПD1П
	или	П377
	зп	1(М14)
	сч	АДР2
	сда	64+10
	сда	64-36
	рзб	П4710
	или	П1ПD1П
	зп	(М14)
	уиа	РЕД(М15)
	пб	ВЫВОД
НЕ0	текст	П'OШ.B 0'
	конд	П'-M CЛ0'В'377'
НЕ1	текст	П'OШ.B 1'
	конд	П'-M CЛ0'В'377'
НЕ2	текст	П'ДЛИHA '
	конд	П'ЭЛ-TA0'В'377'
НЕ3	текст	П'OШ.CCЫ'
	конд	П'ЛKA000'М16В'377'
	строк	3
ЗМСТР	ноп	* ЗАПИСЬ СТРОКИ В ФАЙЛ
*                   М5 - ЧИСЛО БАЙТ В СТРОКЕ
*                   М6 - ДЛИНА ЭЛ-ТА ЗАПИСИ
	уиа	1(М7)
	пв	ПОСТР(М3)
	сч	АДР2
	слиа	1(М1) - ЧИСЛО БАЙТ ПОД НОМЕР СТРОКИ
	уиа	(М10) - ЛИСТЫ МЕТИМ ДЛЯ ЗАПИСИ
	пв	ЧТСЛ(М15)
	зп	СЛОВО
	уии	М14(М12)
	сч	АДР2
	пе	ПРОС
	сч	ПЕСЛО
	зп	СЛОВО
	зп	1(М14) - 1 СЛОВО
	сч	П2
	зп	(М14) -  0 СЛОВО
	слиа	1(М12)
	сч	П1
	зп	АДР2
ПРОС	сч	НОМЕР
	нтж	НАЧНОМ
	по	СТСТР
	сч	НОМЕР
	вч	НАЧНОМ
	пе	БОЛЬШ
	сч	СЛОВО
	и	Е48П32
	счм	АДР2
	сда	64-14
ЗРА	или	(М17)
	зп	СЛОВО  * СФОРМИРОВАЛИ СЛ.СЛОВО НОВОЙ СТРОКИ
	уиа	(М7)  * СТАРУЮ СТРОКУ НЕ ИСКЛЮЧ.,Т.К.ЕЕ И НЕ БЫЛО
	пб	ЗАМСТР  * БУДЕМ ИСКАТЬ МЕСТО ДЛЯ НОВОЙ СТРОКИ
ПЕСЛО	конд	В'0000020000040001'
БОЛЬШ	сч	СЛОВО
	и	Е31П15
	счм	АДР2
	сда	64-31
	пб	ЗРА
СТСТР	сч	СЛОВО
	и	П37
	счим	М6
	вчоб	(М17)
	пе	ЗАМСТР   * СТРОКА НЕ УМЕЩАЕТСЯ НА МЕСТО СТАРОЙ
	зп	Р1  - ДЛЯ ЗАПОЛНЕНИЯ ОСТ.МЕСТА
ВЗАМ	сч	П177
	сда	64-7
	или	П177
	счм	СЛОВО
	или	-1(М17)
	нтж	(М17)
	счим	М5
	сда	64-7
	счим	М1
	сда	64-5
	счим	М6
	или	(М17)
	или	(М17)
	или	(М17)
	зп	(М14)   СЛУЖ.СЛОВО ОТРЕДАКТ.СТРОКИ
	зп	СЛОП   - ДЛЯ РАБОТЫ НОМЗАП
	сч	НАЧНОМ
	пв	НОМЗАП(М15)  - ЗАПИСАЛ НОМЕР СТРОКИ
	уиа	(М4)  * ДЛЯ НОРМАЛЬН.РАБОТЫ ПРОБ
	уиа	48(М11)
	уиа	БУФЕР(М12)
ЗСТР	слиа	-1(М5)   - ЗАПИСЬ СТРОКИ В ОЗУ
	пв	DВБСИР(М16)
	пв	DЗАПСИ(М16)
	пино	ЗСТР(М5)
	сч	Р1
	уи	М16
	пио	КЗСТ(М16)
	или	Е48П32  - ЗАПОЛНЯЕМ ПУСТОЕ МЕСТО
	зп	1(М14)
КЗСТ	сч	ИНЗА
	пе	ПРОЗА  * ПРИ ЗАМЕНЕ НЕ НАДО СТОЛЬКО ОБМЕНОВ
	пб	ПРОБ
ЗАМСТР	ноп	* ЗАМЕНА НЕУМЕСТИВШЕЙСЯ СТРОКИ
	уиа	-3(М16)
	сч	СЧЛИСТ
	нтж	П37
	по	НАЙДЫ
	нтж	П37
НАЙДЫ	зп	Р  * ПОИСК ПОДХОДЯЩЕЙ ДЫРЫ
	слц	БЛИСТ
	слц	П1
	сда	64-10
	уи	М14
	мод	Р
	сч	ЛИСТЫ
	по	НЕТДЫР
	и	П177
	нтж	П177
	по	ЗАБИТО - ПОСЛЕДНЯЯ ЗОНА НЕ ОБРАЗОВАНА
	сч	(М14)
	и	Е24П1
	зп	НСЛО
ПОДР	слиа	1(М14)
	счи	М14
	и	П1777
	по	ПЕРЕД - НЕТ МЕСТА В ЭТОЙ ЗОНЕ
	вч	НСЛО
	по	СЗАДИ
	сч	(М14)
	нтж	Е48П32
	и	Е48П32
	по	ЕСДР
НЕТА	сч	(М14)
	и	П37
	по	НЕКОР2
	уи	М15
	слиа	-1(М15)
	сли	М14(М15)
	пб	ПОДР
ЕСДР	сч	(М14)
	и	П37
	счим	М6
	вчоб	(М17)
БРОД	пе	НЕТА
	зп	Р1   ДЛЯ ЗАПОЛНЕНИЯ ОСТ.МЕСТА
	пио	НОСТ(М7)  - СТАРОЙ СТРОКИ НЕ БЫЛО
	сч	Е48П32
	или	(М12)
	зп	(М12)  * ИСКЛЮЧИЛИ СТАРУЮ СТРОКУ
НОСТ	счи	М14
	пв	ВСЛО(М15)   * АДР2 := АДРЕС НАЙДЕНОЙ ДЫРЫ
	пв	ЧТСЛ(М15)
	счи	М12
	счм	СЛОВО  * СЛ.СЛОВО СТАРОЙ СТРОКИ
	сда	64-17
	счмр	(0)
	пв	ЧТСЛ(М15)
	или	Е31П15
	нтж	Е31П15
	счм	АДР2
	сда	64-14
	или	(М17)
	зп	(М12)  ИЗМЕНИЛИ ССЫЛКУ ПРЕД.СТРОКИ
	сч	СЛОВО
	сда	64+14
	и	Е17П1
	пв	ЧТСЛ(М15)
	сда	64-17
	сда	64+17
	счм	АДР2
	сда	64-31
	или	(М17)
	зп	(М12)  ИЗМЕНИЛИ ССЫЛКУ НАЗАД СЛЕД.СТРОКИ
	пб	ВЗАМ
СЗАДИ	сч	П1777
	слц	П1
	вч	НСЛО
	счим	М6
	вчоб	(М17)
	пе	ПЕРЕД   * СЗАДИ НЕТ МЕСТА
	сч	(0)
	зп	(М14)   * ЧТОБЫ НЕ БЫЛО ЛИШНИХ ДЫР
	счи	М6
	слц	НСЛО
	счим	М14
	или	П1777
	нтж	П1777
	уим	М15
	зп	НСЛО
	зп	(М15)     * СКОРРЕКТИРОВАЛИ 0 СЛОВО ЗОНЫ
	ржа	'23'     * ЧТОБ НЕ ВЫПОЛНИЛСЯ ПЕ В БРОД
	пб	БРОД
ПЕРЕД	сч	Р
	нтж	Е24П1
	по	ЗАБИТО    * НЕТ БОЛЬШЕ МЕСТА В ОБРАЗ.ЗОНАХ
	нтж	Е24П1
	слц	П3
	и	П3
	цикл	НАЙДЫ(М16)
НЕТДЫР	сч	Е24П1
	уиа	(М16)
	пб	НАЙДЫ
ЗАБИТО	сч	ХВОСТ
	слц	П1
	и	П177
	пе	НЕПС
	сч	П1
НЕПС	зп	Р
	нтж	ЧИСЗОН
	пе	НОВЗОН
НЕТПЕ	уиа	ПРЕД(М13)
	пв	ВЫД(М14)
НЕТМЕС	текст	П'HET MECTA B'
	конд	П'ФAЙЛE0'В'377'
НОВЗОН	сч	(0)   * ДОБАВЛЕНИЕ СВОБОДНОЙ ЗОНЫ
	счим	0
	уиа	-1(М12)
	пв	ЧТПЗ(М15)    *  ПОСЛЕДНЯЯ ЗОНА МЕНЯЕТСЯ
	зп	НСЛО
	слиа	1(М12)
	уии	М14(М12)
	пб	СЗАДИ
	строк	3
ЧТСЛ	ноп	ЧТЕНИЕ СЛУЖЕБНОГО СЛОВА СТРОКИ
*              ВХОД: НА СМ - АДРЕС СЛ.СЛ. НА ДИСКЕ
*              М10 = 0   - ЛИСТ МЕТИТСЯ ДЛЯ ЗАПИСИ
*              РАБОЧАЯ ЯЧЕЙКА Р
*              ВОЗВРАТ ПО М15
	зп	(М17)
	сда	64+10
	зпм	Р
	и	П1777
ЗАМП	зп	(М17)  ** КОМАНДА ЗАМЕНЯЕТСЯ ПРИ ПЕРЕНУМЕРАЦИИ
	уиа	-4(М12)
ПОЛИС	сч	ЛИСТЫ+3(М12)  * ПОИСК ЛИСТОВ
	по	ПОДГ  * ЛИСТ НЕ ОБРАЗОВАН
	нтж	Р
	и	П177
	по	ЕСЛИС  * ЕСТЬ ЛИСТ
	цикл	ПОЛИС(М12)
ПОДГ	сч	СЧЛИСТ  * ПОДГОТОВКА ОБМЕНА
	по	ПЕРЧТ - ПЕРВОЕ ЧТЕНИЕ 0 ЗОНЫ
НЕР1	слц	П1
	и	П3
	по	НЕР1  - 0 ЗОНУ НЕ ИСКЛЮЧАЕМ
	зп	СЧЛИСТ
ПЕРЧТ	мод	СЧЛИСТ
	уиа	(М12)
ЧТПЗ	сч	ЛИСТЫ(М12) * ВХОД ДЛЯ СМЕНЫ ПОСЛЕДНЕЙ ЗОНЫ
	по	ЗАМЛИС           ПРИ ЗАПОЛНЕНИИ ПРЕДЫДУЩЕЙ
	и	Е40
	пе	ЗАМЛИС
	сч	ЛИСТЫ(М12)
	пв	ОБМЕН(М13)
ЗАМЛИС	счи	М12
	слц	БЛИСТ
	слц	П1
	и	П37
	сда	64-30
	или	Е40
	или	Р
	или	НУ
	зп	ЛИСТЫ(М12)
	пв	ОБМЕН(М13)
МЕТЛИС	пино	НЕМЕТ(М10)
	сч	Е40
	нтж	ВСЕЕД
	и	ЛИСТЫ(М12)
	зп	ЛИСТЫ(М12) * ЛИСТ ПРЕОБР.ДЛЯ ЗП
НЕМЕТ	мод	БЛИСТ
	слиа	1(М12)
	счи	М12
	сда	64-10
	слц	(М17)
	уи	М12
	сч	(М12)
	пб	(М15)
ЕСЛИС	слиа	3(М12)
	пб	МЕТЛИС
	строк	3
ОБМЕН	ноп	*    ОБМЕН С АРХИВОМ
	слц	СДВИГ
	зп	ИСОБМ
	э70	ИСОБМ
	пб	(М13)
ОБММБ	ноп	*   ОБМЕН С БАРАБАНОМ
	зп	ИСОБМ
	э70	ИСОБМ
	пб	(М13)
СДВИГ	эквп
ИСОБМ	эквп
ХВОСТ	эквп	,         * * * НЕ  РАЗДЕЛЯТЬ * * *
ЛИСТЫ	эквп
ЛИСТ1	эквп
ЛИСТ2	эквп
ЛИСТ3	эквп
СЧЛИСТ	эквп	,        * * * * * * * * * * * * *
БЛИСТ	конд	В'4'
НУ	конд	В'550000'
	строк	3
ВСЛО	ноп	* ВЫДЕЛЕНИЕ АДРЕСА ДЛЯ ЧТСЛ
*        СМ - АДРЕС СЛОВА В ОЗУ
	зп	АДР2
	сда	64+10
	вч	БЛИСТ
	вч	П1
	зп	(М17)
	мод	(М17)
	сч	ЛИСТЫ
	и	П177
	сда	64-10
	счм	АДР2
	и	П1777
	или	(М17)
	зп	АДР2
	пб	(М15)
	строк	2
ВСЛП	ноп	* ВЫДЕЛЕНИЕ АДРЕСА ДЛЯ ПЕРЕНУМЕРАЦИИ
*     НА М14 - АДРЕС СЛОВА В ОЗУ
	счи	М14
	и	П1777
	счм	ХВОСТ * ДЛЯ ВЫДЕЛЕНИЯ ЗОНЫ МБ
	и	П37
	сда	64-10
	или	(М17)
	зп	АДРП
	пб	(М15)
	строк	3
НОМЗАП	ноп	* ЗАПИСЬ НОМЕРА СТРОКИ В ОЗУ
*        НА М14 - АДРЕС СЛУЖ.СЛОВА СТРОКИ,НА СМ -НОМЕР
	счм	СЛОП
	и	П177
	сда	64+5
	сда	64-3
	уим	М13
	слиа	-48(М13)
	слиа	1(М14)
	сда	64(М13)
	зп	(М14)
	пб	(М15)
	строк	3
НОМСТР	ноп	* ОПРЕДЕЛЕНИЕ НОМЕРА СТРОКИ
*                М12 - АДРЕС СЛУЖ.СЛОВА В ОЗУ
*                ВОЗВРАТ ПО М15
	сч	(М12)
	нтж	П177
	и	П177
	сда	64+5
	сда	64-3
	уи	М11
	слиа	'30'(М11)
	сч	1(М12)
	сда	64(М11)
	зп	НОМЕР
	пб	(М15)
	строк	3
НБАЙТ	ноп	* УСТАНОВКА НА М1 ЧИСЛА БАЙТ ПОД НОМЕР СТРОКИ
	уиа	(М1)   * НОМЕР СТРОКИ НА СУММАТОРЕ
	ржа	3    * ПЕРВЫЙ ПРОХОД ЧЕРЕЗ ПО ПРИ НОМСТР = 0
НБЦ	по	(М15)
	слиа	1(М1)
	сда	64+8
	пб	НБЦ
	строк	3
ДЛИНЗ	ноп	* УСТАНОСКА НА М6 ДЛИНЫ ЭЛ-ТА ЗАПИСИ
	счи	М1  *  ЧИСЛО БАЙТ ПОД НОМЕР СТРОКИ МИНУС 1
	счим	М5     *   ЧИСЛО БАЙТ ИНФОРМАЦИИ В СТРОКЕ
	сл	(М17)
	или	С64
	дел	D6
	сл	С64
	уи	М6
	слиа	2(М6)  *   ДЛИНА ЭЛЕМЕНТА ЗАПИСИ
	пб	(М15)
	строк	3
ПРОК	ноп	*   ПРОВЕРКА , ЯВЛЯЕТСЯ ЛИ СЛ.СЛОВО ПОСЛЕДНИМ
*                  ВОЗВРАТ ПО М15 ( ЕСЛИ ДА , ТО ПО М16 )
	сч	СЛОВО
	сда	64+14
	и	Е17П1
	нтж	П1
	по	(М16)
	нтж	П1
	пб	(М15)
	строк	3
ТЕК8	ноп	* ПРЕОБРАЗОВАНИЕ ВОСЬМЕРИЧНОГО ЧИСЛА
*              В ДЕСЯТИЧНОЕ ( ТЕКСТОВАЯ ФОРМА )
*              РАБОЧАЯ ЯЧЕЙКА - Р   ВОЗВРАТ ПО М15
	или	С64
	зп	Р
	счи	М15
	счим	М12
	счм	D107
	уиа	-7(М15)
	уиа	(М12) - ИНД.НУЛЕЙ СЛЕВА
КВЦ	счм	Р
	дел	-1(М17)
	сл	С64
	зп	(М17)
	нтж	С64
	пе	КЗП  - НЕ НУЛЬ
	пино	КЗП(М12)
	пио	КЕЛ(М2) - НУЛИ СЛЕВА НЕ ЗП
	сч	П17 - ВМЕСТО НУЛЯ - ПРОБЕЛ
	мода	-1
КЗП	уиа	1(М12)
	пв	DЗАПСИ(М16)
	пио	КЕЛ(М2)
	счи	М15
	счим	0
	пв	КОНТР(М15) - ДЛЯ ФОРМИРОВАТЕЛЯ
	уим	0
	уи	М15
КЕЛ	ржа	2
	сч	(М17)
	умн	-1(М17)
	вчоб	Р
	зпм	Р
	дел	D10
	ржа	3
	цикл	КВЦ(М15)
	уим
	уим	М12
	уи	М15
	пб	(М15)
	строк	3
ТЕК10	ноп	* ПРЕОБРАЗОВАНИЕ ЧИСЛА ИЗ ДЕСЯТИЧНОГО
*                В ТЕКСТОВОЙ ФОРМЕ В ВОСЬМЕРИЧНОЕ
*         ПРИ ВЫХОДЕ М13 = 0   - ОБРАБ.ПОСЛЕДН.ОПЕРАНД
*         РАБОЧАЯ ЯЧЕЙКА - Р        ВОЗВРАТ ПО М15
	уиа	-8(М14)
	счи	0
	счм	D107
ТЕРЦ	зп	Р
	пв	DВБСИР(М16)
	нтж	П17
	уиа	1(М13)
	по	КDУ
	нтж	П360
	уиа	(М13)
	по	КDУ
	нтж	П377
	вчоб	П11
	пе	КВВ
	вчоб	П11
	или	С64
	ржа	6
	умн	Р
	сл	(М17)
	счм	Р
	дел	D10
	ржа	7
	цикл	ТЕРЦ(М14)
КВВ	слиа	-1(М17)
	пб	(М15)
КDУ	сч	(М17)
	дел	Р
	дел	D10
	сл	С64
	нтж	С64
	вчоб	Е24П1
	пе	(М15)  * НОМЕР СТРОКИ ПРЕВЫШАЕТ 24 Р.
	вчоб	Е24П1
	пб	(М15)
П360	конд	В'360'
П10	конд	В'10'
С64	конд	В'6400000000000000'
П11	конд	В'11'
D6	конд	Е'6.'
D10	конд	Е'10.'
D107	конд	Е'1.E7'
П377	конд	В'377'      * * * * * * * * * * * *
D1	конд	Е'1.'        Н Е  П Е Р Е М Е Щ А Т Ь
	строк	3
*                     ПОСИМВОЛЬНОЕ ЧТЕНИЕ ПО М12
*                     ПОЗИЦИЯ УСТАНАВЛИВАЕТСЯ НА М11
*                     ПЕРВЫЙ БАЙТ - М11=48
DВБСИР	мода	DВБ
	пино	(М11)
	слиа	1(М12)
	уиа	48(М11)
DВБ	слиа	-8(М11)
	сч	(М12)
	сда	64(М11)
	и	П377
	пб	(М16)
	строк	2
*                     ПОСИМВОЛЬНАЯ ЗАПИСЬ ПО М14
*                     ПОЗИЦИЯ УСТАНАВЛИВАЕТСЯ НА М13
*                     ЗАПИСЬ В ПЕРВЫЙ БАЙТ - М13=-48
DЗАПСИ	мода	DЗП
	пино	(М13)
	слиа	1(М14)
	уиа	-48(М13)
DЗП	слиа	8(М13)
	и	П377
	сда	64(М13)
	счм	П377
	сда	64(М13)
	и	(М14)
	нтж	(М14)
	или	(М17)
	зп	(М14)
	пб	(М16)
	строк	2
КЛЮЧРД	ноп	* КОМАНДЫ РЕЖИМА РЕДАКТОРА
	уиа	КОМРЕД-КОНКЛЮ(М15)
	уиа	48(М11)
	уиа	БУФЕР(М12)
	пв	DВБСИР(М16)
	зп	Р
КЛЮРЦ	сч	КОНКЛЮ(М15)
	сда	64+40
	нтж	Р
	по	РАСПР
	цикл	КЛЮРЦ(М15)
РАСПР	сч	КОНКЛЮ(М15)
	сда	64+15
	и	П37
	зп	КЛЮЧ
	мод	КОНКЛЮ(М15)
	пб	(0)
КОМРЕД	ноп	- КОМАНДЫ *
	конк	П'Л00'
	дк	0,Л
	конк	П'B00'
	дк	2,В
	конк	П'И00'
	дк	0,И
	конк	П'H00'
	дк	1,Л
	конк	П'З00'
	дк	1,З
	конк	П'C00'
	дк	4,С
	конк	П'П00'
	дк	3,П
	конк	П'K00'
	дк	0,БАЦВ
	конк	П'A00'
	дк	0,А
	конк	П'V00'
	дк	0,Э
	конк	П'Ф00'
	дк	0,Ф
	конк	В'77600000'
	дк	2,ЕТХ
КОНКЛЮ	конк	В'44400000'
	дк	2,РЕДСТР
БАЦВ	ноп	-  ВЫХОД ИЗ РЕДАКТОРА В СЕРП
	мод	И17
	уиа	(М17)
	э72	ОТКТР - ОТКАЗ ОТ ТРАКТОВ
	э72	ОТМБ  - ОТКАЗ ОТ МБ17
	э72	ОТКЛИС - ОТКАЗ ОТ 4-10 ЛИСТОВ
	уиа	(М12)
	пб	БАЦ
ОТМБ	конд	В'4057770000000000'
ОТКТР	конд	В'4700000000000000'
ОТКЛИС	конд	В'0004050607107700'
А	сч	П1
	зп	ПЧЕСТЬ
	нтж	РЕЖИМ
	э75	РЕЖИМ
	и	П1
	э62	'76'
РЕЖИМ	пб	РЕД
	конк	В'1'
Э	сч	П1
	нтж	ЭКРАН
	зп	ЭКРАН
	пб	РЕД
ЭКРАН	конд	В'0' - НЕ ВЫНОСИТЬ
КЛЮЧ	эквп
	строк	3
ПРОГОН	ноп	* ПРОГОН ПРОБЕЛОВ
	пв	DВБСИР(М16)
	нтж	П17
	по	ПРОГОН
	нтж	П17
	слиа	8(М11)  - ШАГ НАЗАД НА 1 СИМВ.
	пб	(М15)
	строк	3
*               БЛОКИ ВЫДАЧИ И ПРИЕМА С ТЕРМИНАЛА
ВЫВОД	сч	ЭКРАН
	пе	ПЕЧАТЬ
	пв	ВЫД(М13)
	пе	РЕД  * ПРЕРВАНА ВЫДАЧА
ПЕЧАТЬ	мод	РЕЖИМ
	пб	ЭК64
ЭК64	э64	LПЕЧ
	пб	(М15)
LПЕЧ	конд	М24К'140000000'К'140000000'
Е24	конд	М23В'1'   * * LПЕЧ И Е24 НЕ РАЗДЕЛЯТЬ
ПРМ	зп	(М12)
	э71	КПР
	э71	ОПР
	и	Е25
	пе	(М13)
	сч	ПРИГС
	зп	ПР
	э71	КПП
	сч	ОПР
	э62	'102'
	э71	ОПР
	сч	(0)
	пб	(М13)
ВЫД	э71	КВД
	э71	ОПР
	и	Е25
	пб	(М13)
	строк	3
НАЧАЛО	ноп	* ПОДГОТОВКА КОНСТАНТ ДЛЯ ОБЩЕНИЯ
	уиа	БУФЕР(М12) - ДЛЯ ЗАКРЕС
	сч	ОТК
	пе	ЗАКЛИС - ИНФ СЛ.ПОДГОТОВЛ.
	э71	ВСЕЕД
	нед	(0)
	зп	(М17)
	сда	64-12
	или	КПР
	зп	КПР
	нтж	КВД
	зп	КВД
	нтж	КПП
	зпм	КПП
	или	ОПР
	зп	ОПР
	или	Е26
	зп	ОТК
ЗАКЛИС	уиа	5(М16)
	уиа	ЗАКЛИС(М14)
	счи	М16
	э50	'177'
	пе	НРЕС
	пб	ЗАКТР
НРЕС	сч	ТНРЕС
	пв	ПРМ(М13)
	сч	(М12)
	сда	64+40
	нтж	П377
	пе	БАЦВ - НЕ НАДО БАЦ
	пб	(М14)
ЗАКТР	уиа	*(М14)
	сч	МАКП
	или	Е19
	э50	'177'
	пе	НРЕС
	пб	(М15)
ТНРЕС	конд	П'HPEC-0'В'377'
КПП	кк	'14',ПР(М14)
	кк	0,ПР+64(М14)
КПР	конд	М24К'120340000'К'121000026'
КВД	конд	М24К'060140000'К'060000126'
ОПР	конд	В'0120000000000000'
ОТК	конд	В'0'  - БЕЗ РОСП 0 ВЫНОСИТЬ НЕЛЬЗЯ
ПРИГЛ	конд	М40П'-'М32В'170'М24В'377'
ПРИГС	конд	М40П' 'М32В'170'М24В'377'
ПР	конд	В'0' * ЯЧЕЙКА ЛОЖНОГО ПРИЕМА
И17	эквп
	строк	3
Ф	ноп	*   ФОРМИРОВАТЕЛЬ ЗАДАЧИ
	сч	Е24П1
	зп	КОННОМ
	уиа	2(М2) - ЗАПИСЬ НА БУФЕР БЕЗ НОМЕРА
	уиа	(М1) - ВЫХОД ИЗ ВЫДСТР БЕЗ ВЫВОДА
ФОРБ	уиа	(М7)
	пв	ПОСТР(М3)
	пино	СТН(М4) - НЕТ СТРОК
	сч	ЗАМП
	слц	П1
	э75	ЗАМП
	сч	БЛИСТ
	сда	64-10
	уи	М6
	сда	64-20
	или	НУМБ
	зп	ХВОСТ
	уиа	-48(М5)
*   --------- ПОИСК СТАНДАРТНЫХ КАРТ
НАЧФО	сч
	зп	РЖВВ
	сч	ЗК1
	зп	СТК3
ПОСТК	мод	РЖВВ
	уиа	1-КОЛКАР(М2)
ПОКАР	сч	БУФЕР
	нтж	СТК1+КОЛКАР-1(М2)
	по	НАШКАР
	цикл	ПОКАР(М2)
УСТ2	мод	РЖВВ
	уиа	(М2)
	слиа	1-КОЛКАР(М2)
	пио	СОХР(М2) - БЫЛА ///(((
	слиа	КОЛКАР-1(М2)
	пб	ЗАПКАР
НАШКАР	уиа	МАГАЗ(М17)
	пб	ПЕРЕКЛ+КОЛКАР-1(М2)
ЗК1	конд	П'*NAME '
ЗК2	конд	П'*BEMSH'
ЗК3	конд	П'KHЦ$$$'
СТК1	конд	М40П'_'П'$EKOH'
СТК2	конд	П'EKOHEЦ'
СТК3	конд	П'*NAME '
СТК4	конд	П'///***'
СТК5	конд	П'///((('
СТК6	конд	П'///)))'
КОЛКАР	экв	*-СТК1
ПЕРЕКЛ	уиа	3(М2)
	пб	ЗАПКАР
	уиа	3(М2)
	пб	ЗАПКАР
	сч	СТК3
	пб	ВЫБОР
	уиа	(М2)
	пб	СОХР
	уиа	КОЛКАР-1(М2)
	пб	ИГНО * С НИЖН.СТР.НЕ РАЗДЕЛЯТЬ
КОНИГ	ноп	- КОНЕЦ ИГНОРИРОВАНИЯ
	сч	РЖВВ
	сда	64+24
	зп	РЖВВ
	пб	СОХР
ИГНО	ноп	- ВВОД ИГНОРИРОВАНИЯ
	сч	РЖВВ
	сда	64-24
	счим	М2
	или	(М17)
	зп	РЖВВ
СОХР	уии	М13(М5)
	уии	М14(М6)
ПРОПУС	уиа	2(М2) - ЗП СТРОКИ БЕЗ НОМ.
	уиа	1(М4) - ДЛЯ ВЫДСТР
	уии	М5(М13)
	уии	М6(М14) - ЗАПОМНИЛ ПОЗ.ЗП
	пв	СОNТ(М3)
	пио	ПОСТК(М4) - ЕСТЬ СТРОКА
	пб	ЗЕК
ВЫБОР	сч	СТК3
	нтж	ЗК1
	пе	НЕЕ
	сч	ЗК2
	зп	СТК3 - ИЩЕМ *ВЕМSН
	сч	П1
	зп	РЖВВ
	уиа	(М2)
	пб	ЗАПКАР
НЕЕ	сч	СТК3
	нтж	ЗК2
	пе	НЕБЭМШ
	сч	ЗК3
	зп	СТК3
	сч
	зп	РЖВВ
	уиа	1(М2)
	пб	ЗАПКАР
НЕБЭМШ	сч	ЗК2
	зп	СТК3 - ИЩЕМ *ВЕМSН
	сч	П1
	зп	РЖВВ
	уиа	(М2)
	пб	ЗАПКАР
*    -------------- ФОРМИРОВАНИЕ ПЕРФОКАРТЫ
ЗАПКАР	уии	М13(М5)
	уии	М14(М6)
	уиа	48(М11)
	уиа	БУФЕР(М12)
	уиа	-71(М3)
ОРФ	пв	DВБСИР(М16)
	нтж	П375
	пе	ДАБ
	слиа	-1(М2)
	пио	ДОПРО(М2)
	сч	П341
	пв	DЗАПСИ(М16) - ПРИЗНАК КОНЦА ПК
ЗЕК	слиа	-2(М2)   * 3 --> 0 ( И ИЗ СОNТ )
	пв	КОНТР(М15)
	пино	ПРОПУС(М2)
*    --------- ПРИЗНАКИ КОНЦА МАССИВА
	уиа	-5(М2)
	мод	РЖВВ
	уиа	(М4)
КВВД	сч	П341(М4)  - 341 ИЛИ 342
	пв	DЗАПСИ(М16)
	пв	КОНТР(М15)
	цикл	КВВД(М2)
	пио	ЕКОН(М4)  - КОНЕЦ ЗП НА БУФЕР
	сч	СТК2 - ЕКОНЕЦ
	зп	БУФЕР
	сч	П375 - КОНЕЦ СТРОКИ
	сда	64-40
	зп	БУФЕР+1
	уии	М5(М13)
	уии	М6(М14)
	пб	НАЧФО  - ЗАПИСЬ ЕКОНЦА С 6*341
ЕКОН	сч	ХВОСТ
	пв	ОБММБ(М13)  - ЗАПИСАЛ ПОСЛЕДНИЙ ТРАКТ
	уиа	(М15)
	сч	ХВОСТ
	и	П177
	слц	П1 - ЧИСЛО ТРАКТОВ МБ
	сда	64-15
	или	ИСБВ
ВЖД	зп	Р
	э50	'7701'
	уиа	БУФЕР(М14)
	по	ЖДУ
	нтж	Р
	пе	ОШВВ
	счи	М16
	сда	64-30
	рзб	П67
	или	СКВ
	зп	(М14)
	сч	М40ЕТХ
	зп	1(М14)
	уиа	ПРЕД(М13)
	пб	ВЫД  -   ** Ф- ХХХ **
ЖДУ	сч	П10
	э50	'7700'
	пб	ВЖД
ОШВВ	сч	БУФЕР
	сда	64+3
	вчоб
	слц	П1
	уи	М11
	уиа	БУФЕР-8(М14)
ВЫВОШ	слиа	9(М14)
	пв	ВЫД(М13)
	цикл	ВЫВОШ(М11)
	пб	ПРЕД
*   --------------------------------
ДАБ	нтж	П375
	пв	DЗАПСИ(М16)
	пв	КОНТР(М15)
	цикл	ОРФ(М3)
	пб	ЗПНПК
ДОПРО	сч	П17
	пв	DЗАПСИ(М16)
	пв	КОНТР(М15)
ЗПНПК	ноп	*   ЗАПИСЬ НОМЕРА КАРТЫ С 73 ПОЗ
	цикл	ДОПРО(М3)
	уиа	2(М2) - ДЛЯ РАБОТЫ ТЕК8
	сч	НОМЕР
	пв	ТЕК8(М15)
	сч	П341
	пв	DЗАПСИ(М16)
	уиа	ПРОПУС(М15)
	пб	КОНТР
*    ---------------- ПЕРЕХОД НА СЛЕД.ТРАКТ
КОНТР	мода	(М15)
	пино	(М13)
	счи	М14
	и	П1777
	нтж	П1777
	пе	(М15)
*    ----------------- СМЕНА ТРАКТА МБ
	сч	ХВОСТ
	пв	ОБММБ(М13)
	сч	ХВОСТ
	слц	П1
	зп	ХВОСТ
	и	П177
	нтж	МАКП
	по	НЕТПЕ - НЕТ ТРАКТОВ МБ
	сч	БЛИСТ
	сда	64-10
	уи	М14
	уиа	-48(М13)
	пб	(М15)
ИСБВ	конк	В'77217000'
	конк	А(ИНФОР)
ИНФОР	конк	П'TKH'
	конк	А(БУФЕР)
П341	конд	В'341'  * * * * * * * *
П342	конд	В'342'  НЕ РАЗДЕЛЯТЬ   *
СКВ	конд	П'Ф- 000'
	строк	3
*            РАБОЧАЯ ПАМЯТЬ
ИДОБЛ	эквп
Р	эквп
Р1	эквп
Р2	эквп
Р3	эквп
Р4	эквп
Р5	эквп
РЖВВ	эквп
ОБРАЗ	эквп
&NM	SETA	&NM+7
ЗАМЕНА	эквп
&NM	SETA	&NM+7
МАГАЗ	эквп
СЕРП	ВНЕШ	ВВЧИС,(ЧИСЗОН,ДЛОБЛ),ПЧЕСТЬ,ЧИСЛО
СЕРП	ВНЕШ	ПРОГПБ,ПОВБОБ,ЗАХВАТ,ОБЛ,ДАЙЗП
СЕРП	ВНЕШ	ВОПБОБ,ВЫДША,ТНЕОБЛ,Х4096
СЕРП	ВНЕШ	(БУФЕР,БФВВ),(П1777,Е10П1),(П2000,Е11)
СЕРП	ВНЕШ	Е19,Е24П1,Е25,Е26,Е40,(П17,Е4П1),ВСЕЕД
СЕРП	ВНЕШ	(П37,Е5П1),(П3,В3),(П2,Е2),(П200,Е8)
СЕРП	ВНЕШ	(П177,Е7П1),(П1,Е1),(П12,В12),М40ЕТХ
СЕРП	ВНЕШ	П1ПD1П,П4710,П67
*КОНЕЦ ЧАСТИ
*КОНЕЦ ЧАСТИ
	ФИНИШ
