шифр 419999 зс5^
ацпу 128^
лен 43(2222-зп)42(2099)^
еев1а3
*name дисп70
*call yeslis
*bemsh
ВВД$$$
ДИСП70	СТАРТ	'10'
	М
	пам	24
	пам	32
КСД1	конд	в'6200000000000000'
	конд	в'5400000000000000'
	конд	в'4600000000000000'
	ОПРЕ
ВСЕЕД	конд	в'7777777777777777'
П3777	конд	в'3777'
ЕДК10Р	конд	в'7777777777775777'
Е15П1	конд	в'0000000000077777'
Е44П41	конд	п' 00000'
Е15П2	конд	в'0000000000077776'
ММБН	конд	в'0000000700001774'
П77	конд	п'00000D'
ГРП15	сч	ГУС
	и	E48
	уиа	1(М16)
	пе	КОНКОМ
СТ175	сч	РЭ4
	пб	СТ175
Е10П3	конд	в'1774'
СТЗОН	пам	1
Е39П25	конд	в'0007777700000000'
ЭК6	конд	в'4053240474631772'
ЭК7	конд	в'4013056205773722'
ЭК9	конд	в'6400000000000000'
ЭК30	конд	в'3710020040100200'
	конд	в'3750121665473765'
	конд	в'3754447754271641'
	конд	в'4010564316505161'
	конд	в'4013414226101541'
	конд	в'4016700574602710'
ЭК38	конд	в'4054441766521041'
ЭК39	конд	в'4013240474631772'
ЭК	конд	в'7740000000000000'
ЭК29	конд	в'4320000000000000'
К2003	конд	п'000043'
П13	конд	п'00000-'
Е46П48	конд	в'7000000000000000'
ГОД	пам	1
Е18П16	конд	в'0000000000700000'
ЗИМ	конд	в'7700000000770000'
Е12Е11	конд	п'0000/0'
Е48П37	конд	в'7777000000000000'
Е36П25	конд	в'0000777700000000'
Е24П13	конд	в'0000000077770000'
П7777	конд	в'0000000000007777'
П1777	конд	в'0000000000001777'
АПСЧБ	конд	в'0006443600000000'
ШКОК	конд	в'7777777777777777'
НАПРМГ	конд	в'0070000000001600'
Е21Е18	конд	в'0000000004400000'
	конд	в'3751111237723571'
	конд	в'3754631462347002'
	конд	в'4012525252526041'
	конд	в'4057777777777770'
Ч63	конд	в'4317600000000000'
Ч127	конд	в'4357700000000000'
ЭК46	конд	в'2713457536132666'
Ч1Д	конд	в'4050000000000000'
SQ2	конд	в'3722726016750030'
SQ1	конд	в'4016174360527114'
SQ0	конд	в'3752021367076726'
З1ЧРI	конд	в'3752137140667117'
R05	конд	в'4010000000000000'
SIN6	конд	в'2416516615135220'
SIN5	конд	в'2720726406013034'
SIN4	конд	в'3212407337647661'
SIN3	конд	в'3466322646644717'
SIN2	конд	в'3652146570633344'
SIN1	конд	в'4025524206147334'
SIN0	конд	в'4054441766521041'
РАТАN4	конд	в'3710712237733234'
РАТАN3	конд	в'4157070620065256'
РАТАN2	конд	в'4315676761443655'
РАТАN1	конд	в'4356666234335452'
РАТАN0	конд	в'4351263371314703'
QАТАN3	конд	в'4251370534014651'
QАТАN2	конд	в'4353035273613334'
QАТАN1	конд	в'4410771042346022'
QАТАN0	конд	в'4351263371314705'
РАSIN3	конд	в'4262067767311156'
РАSIN2	конд	в'4417116703564207'
РАSIN1	конд	в'4527510513075667'
РАSIN0	конд	в'4452405406731770'
QАSIN3	конд	в'4323163553476645'
QАSIN2	конд	в'4451673607622544'
QАSIN1	конд	в'4526610137701013'
QАSIN0	конд	в'4452405406731770'
LN2Ч2	конд	в'3753056205773721'
АLОG5	конд	в'3714502240420440'
D00305	конд	в'3716136565743216'
	конд	в'3751111240046421'
	конд	в'3754631462345725'
	конд	в'4012525252526026'
АLОG0	конд	в'4110000000000000'
З1ЧLN2	конд	в'4053425216624534'
ЕХР7	конд	в'3051400777605675'
D00314	конд	в'3211740671257531'
	конд	в'3352734560343024'
	конд	в'3511662430023033'
	конд	в'3616153023515710'
	конд	в'3717277573756445'
	конд	в'4013056205774000'
ЕХР0	конд	в'4050000000000000'
ПАК	пам	1
ШКСВМ	конд	в'0000001760000000'
Е18Е11	конд	п'000240'
ЯЧВ1	конд	п'100100'
R	конд	в'4000000000000012'
КМБТТ	конд	в'0040000001401777'
РМЛ	конд	в'7600000000000000'
РМД	конд	в'0000000077777777'
	пам	1
РМЛ1	конд	в'7777777777777777'
РМД1	конд	в'0000037777777777'
	конд	в'0000037777777777'
ИПОБМ	пам	1
	конд	п'600000'
	пам	1
D00342	пам	1
	конд	в'0006443600000000'
	конд	в'0000000201302007'
	пам	3
D00350	пам	14
	конд	в'4000000000000000'
УХО	пам	1
ШКЗЗ	пам	1
КМИН	конд	п'00000 '
П14	конд	п'00000/'
П6	конд	п'000006'
РЯР	пам	1
П5	конд	п'000005'
	пам	2
	конд	в'4000000000000000'
СЧПР1	пам	1
СЧПР2	пам	2
КЛЮЧРЗ	конд	п'КЛЮЧРЗ'
Р	пам	1
ЧПОД	пам	1
ЛИСТА	конд	в'0000000000370000'
ИПЗЖТ	пам	1
	конд	п'600000'
	пам	1
	конд	A(БЖТ)
	пам	1
	конд	в'0000000200700007'
	пам	5
	конд	в'0000000000010216'
	конд	в'0000000000030602'
	конд	в'0000000000010204'
	конд	в'0000000000010210'
	пам	1
	конд	в'0000000000052345'
	конд	в'0000000000034242'
	конд	в'0000000000052764'
П2007	конд	п'000047'
	пам	2
П17	конд	п'00000 '
К2013	конд	п'00004-'
РЯПСЗ	конд	п'00000D'
ЗУК	пам	1
ЗАНЯТА	пам	1
ШКЗАКЗ	пам	1
ШГ	пам	1
ШГП	пам	1
ШКСВН	конд	в'0000406020000024'
ТР13	пам	1
П23	конд	в'0000000000000023'
	конд	в'4000000000000000'
РАЗМГ	пам	1
	пам	1
	пам	1
РЕЖРАЗ	пам	1
РСЧРАЗ	пам	1
ТРАЗМ	пам	1
ЗТРАЗМ	пам	1
ВКАНАЛ	пам	1
Е16Е17	конд	в'0000000000300000'
Е47П43	конд	в'3700000000000000'
Е15П11	конд	в'0000000000076000'
ЗНМ	пам	1
ЧОМБМЛ	пам	1
МГНЕИС	пам	1
Е44П42	конд	п'.00000'
Е44Е43	конд	п'/00000'
Е7Е21	конд	в'0000000004000100'
	конд	в'0000000077760000'
ГУС	конд	п'000018'
ШКЗАКС	пам	1
МОНИТ	конд	в'0000000077740000'
D00477	конд	в'6306000000000000'
START	зп	СМ
	пб	внупр
внешпр	зп	СМ
	пб	ОБВНПР
ЕСЧ	конд	в'0001000000000000'
	конд	п'001000'
	конд	в'0000000000010000'
	конд	п'000001'
Е18П1	конд	в'0000000000777777'
Е24П16	конд	в'0000000077700000'
Е21Е1	конд	в'0000000004000001'
Е26Е25	конд	п'003000'
Е16П32	конд	в'0000037777700000'
П3	конд	п'000003'
Е40П1	конд	в'0017777777777777'
П37	конд	в'0000000000000037'
П777	конд	в'0000000000000777'
Е34П25	конд	в'0000177700000000'
	конд	в'0000777700000000'
Е48П43	конд	в'7700000000000000'
Е33П25	конд	в'0000077700000000'
	пам	1
КНАПР	конд	п'000008'
D00525	конд	в'0000000000000020'
П30	конд	в'0000000000000030'
	конд	п'00000А'
П50	конд	п'00000И'
П60	конд	п'00000Р'
Е6П4	конд	п'00000Ш'
ЖИЗОС	пам	1
ШКМГОС	пам	1
КСД3	конд	п'Ш00000'
	конд	в'2400000000000000'
	конд	в'3200000000000000'
	конд	в'4000000000000000'
Е48Е47	конд	в'6000000000000000'
Е46Е45	конд	п'Р00000'
ШИФРПЛ	пам	1
П140	конд	в'0000000000000140'
П177	конд	в'0000000000000177'
П377	конд	в'0000000000000377'
П12	конд	п'00000+'
Э	зп	СМ
	пб	Э1
	зп	СМ
	пио	Я(М16)
	зп	СМ
	пб	'70000' ПЕЭ72
	зп	СМ
	пб	ВЕТКА
	уиа	Э26(М16)
	пб	Э3
	уиа	Э33(М16)
	пб	Э3
	уиа	Э35(М16)
	пб	Э3
	зп	СМ
	пб	ЭК57
	счи	М16
	пб	Э60
	счрж	'37'
	пб	ТУМБР
	зп	СМ
	пб	Э62
	зп	СМ
	пб	Э63
	счи	М16
	пб	АЦПУ
	зп	СМ
	пб	ГОША
	зп	СМ
	пб	Э66
	зп	СМ
	пб	ПРХЭ67
	зп	СМ
	пб	Э70
	счи	М16
	пб	Э71
	зп	СМ Э72
	пб	ЗОВИ
	зп	СМ
	пб	ЭКВВД
Э74	зп	СМ
	пб	ЭКП
Э75	уиа	'2000'
	пб	ЭКС75
Э76	счи	М13 на СВС ЗП СМ
	зп	СМ на СВС ПБ ЭКМУЛЬ
	зп	СМ
	пб	ЭККВМ
ШИФРАЦ	конд	п'00000D'
РПР	пам	1
ПОТЕРИ	пам	1
НОММБ	пам	1
НОММБ1	пам	1
НОММЛ	пам	1
НОММЛ1	пам	1
НОММЛ2	ноп
НОММЛ3	пам	1
ЛЕНТА	конд	п'0000/D'
ШКПЛАН	конд	п'00000D'
ИНФСЛЭ	пам	1
ИНФМБ	пам	1
РЯО	пам	1
РЯОМБ	пам	1
СЧЗАК	пам	1
СЧЗКМБ	пам	1
ФКУС	пам	1
ФКУСМБ	пам	1
ФКУСД	пам	1
ТЗНМЛ	пам	32
ТЗНМД	пам	64
ТЗОНМЛ	пам	13
ТБЗН	пам	19
УСМ	пам	1
УСММБ	пам	1
ОС1417	пам	1
УКАЧАЙ	пам	1
УКАЧП	пам	1
ТЗФСТР	конд	в'7770000000000000'
	пам	15
ШЗНМБО	пам	48
ТМБ	пам	1
ТМД	пам	1
ОЗУ	пам	1
ТОБ	пам	1
	конд	п'000100'
	конд	п'000300'
	конд	в'0000000000014000'
МД5	пам	3
D01142	пам	7
КСВЗ	конд	в'7770000000000000'
	конд	в'0007770000000000'
	конд	в'0000007770000000'
	конд	в'0000000007770000'
РАБШК	пам	1
ШККАН   пам     5
П7	конд	п'000007'
МПРП	пам	1
НРЕ	пам	1
П32	конд	в'0000000000000032'
	конд	в'0070000000001777' МБТРС
ССЫЛКА	конд	в'0000174000000000'
НСТПРП	пам	1
ВРЗАПР	конд	М7В'1'
ВРМАТ	пам	1
АЗУ     пам     3
ОЧКУС	пам	16
ОЧКСУМ	пам	16
МБКУС	пам	16
ОЧМБ	конд	в'7777740000000000'
ШОЧНАП	пам	4
ШОЧМГ	пам	32
ЗОЧ2	пам	2
ШКЗЗП	пам	2
СКЛАД	пам	1
ШКНАЧ	пам	1
D01332	пам	3
ЗОЧ1Б	пам	1
D01336	пам	2
ЯКУС	пам	1
ЯКУСМБ	пам	1
ЯМ16	пам	1
ШЗЗПСЧ	пам	1
ШСЗПСЧ	пам	1
ВРЕМЯ	пам	1
РЯО3	пам	1
К	конд	в'0010020040100200'
ОКДВИЖ	пам	1
РЯО5	пам	1
ОШМЛ	пам	1
ТВР1	пам	2
ШКЗАН	пам	1
D01356	пам	1
ОСПОД	пам	6
	конд	в'0000000201300007'
	пам	18
КЛЮЧ	конд	в'0007070700000000'
ВСЕ6	конд	в'6666666666666666'
Е43Е42	конд	п'600000'
ВРЕЗП	конд	п'F00000'
Е48П16	конд	в'7777777777700000'
Е48П9	конд	в'7777777777777400'
Е48Е37	конд	в'7777000000000000' чтобы не совпадало
ШКНТ	конд	в'7777777777777777'
РОЙ	пам	1
D01421	конд	в'4000000000000000'
Е35П31	конд	в'0000370000000000'
	пам	1
	пам	1
D01425	пам	1
	пам	1
D01427	пам	5
D01434	пам	1
НОММБ2	пам	3
РЯО1	пам	3
ЗОНАТР	пам	1
ЗОНАМЛ	пам	1
СОЛ	пам	4
МПРЛ	пам	1
ЯМ15	пам	1
БОБ	пам	1
МШГ	конд	в'7777777777777777'
МГРП	конд	в'0011024000301017'
	конд	в'0000000000000034'
ПОДПРГ	конд	в'0000000036374000'
ГАШРП1	конд	в'7777777701403000'
СПR     конд    в'0'
СПНОМ   КОНД    (32)В’0’
КСП	конд	А(СП)
СП      экв     32     число СП
	пам	1
ШКПЛАВ	конд	в'0000001407014734'
ШПРИК	пам	1
ШКПУСК  конд    в'0'
ШКОД	конд	п'000В80'
D01530	пам	1
СТМГ    пам     32
СТМД    пам     64
СБМГМД  пам     32
ОБРМБ   КОНД    (6)В’0’ в СВС (8)
СТУСТР  КОНД    (10)В’0’
СБОИМБ  КОНД    (16)В’0’
ОАС	пам	1
ENR	конд	в'0000370000001777'
АСБОЙБ	конд	A(СБОЙБ)
НМБТР	конд	в'0070000000001774'
	пам	3
	конд	в'0007740000000400'
	конд	в'0000037600000002'
ТАБЛО	пам	1
ИПЗМЛ	пам	1
	конд	п'600000'
	пам	1
D02006	пам	1
	конд	в'0006543700000000' А(ПРЛСЧБ)
	конд	в'0000000201302007'
	пам	3
D02014	пам	15
ПРИП	конд	в'0421042000000037'
	конд	в'1042104000001740'
	конд	в'2104210000076000'
	конд	в'4210420003700000'
	конд	в'0000001740370000'
ПРЕДЕЛ	пам	1
СИГН	пам	3
	конд	в'4000000000000000'
ШКОТ	пам	2
Е46П25	конд	в'1777777700000000'
Ч01Д	конд	в'4001463146314632'
МИНУТА	конд	в'0000000000005670'
ШКАЛА8	КОНД    М35В’1’В’102040’
Э28	пам	1
КРОМЕ	конд	в'7777777740077777'
	конд	в'7777776077775777'
ТР3	КОНД	В’0’
ТР4	КОНД	В’0’
ТР5	КОНД	В’0’
ТУМБ6	КОНД	В’0’
ТР7	КОНД	В’0’
ЗАХВМЛ	КОНД	В’0’        
МИН15	конд	в'3777777777777763'
МИН17	конд	в'3777777777777761'
	пам	2
МСК	конд	п'00    '
Е35П24	КОНД	М23В’7777’
	пам	1
ШЗРАЗМ	пам	1
D02074	пам	1
ШЗН	пам	1
D02076	пам	1
ШКИВ	пам	1
РШЗН	пам	2
РШКИВ	пам	1
КУС1Б	пам	6
КУС2	пам	6
ФИЗ	пам	3
        КОНД А(ИПЗЖТ)      ЗАДАЧА ЖДУ
ТУС КОНД М41В’1’   Е48-УКАЧКА
 КОНД М41В’2’      Е47-ПЕЧАТЬ
 КОНК М17В’03’     Е46-ДИНАМО
 КОНК А(0)
 КОНК М17В’4’      Е45-МОНТЕР
 КОНК А(МОТТ)
 КОНК М17В’5’     Е44-ДИСКИ
 КОНК А(ДИСКИ)
 КОНК М17В’6’     Е43-ВИСП
 КОНК А(ИВ)
 КОНК М17В’7’     Е42-ДМЛМБ(МБ)
 КОНК А(ИПОБМ)
 КОНД М41В’10’    Е41-Э64
 КОНД М41В’11’    Е40-РОБОТ
 КОНК М17В’12’    Е39-ДМЛМБ(МЛ)
 КОНК А(ИПЗМЛ)
 КОНК М17В’13’    Е38-КАЧКА
 КОНК А(КАЧКА)
 КОНД М41В’14’    Е37-ТРУБКА
* ПОД Е36 РАБОТАЮТ: РЕД.ВВОДА-Е10, КЗ-Е6, БОП-Е11, УПРЯЧЬ-Е16
 КОНД М41В’15’     Е36-ПЛАН
 КОНД М41В’16’     Е35-ПРОЦЕС
 КОНД М41В’17’     Е34-ПУЧКАЧ
 КОНД М41В’20’     Е33-АВРАСП
 КОНД М41В’21’     Е32-ЭКВВОД
 КОНД М41В’22’     Е31-РЕСУРС
 КОНК М17В’23’     Е30-РЕЗОТ
 КОНК А(0)
 КОНД М41В’24’     Е29-ВВОД(В1К)
 КОНД М41В’25’     Е28-СПЭ66
 КОНК М17В’26’     Е27-РЕЗ.ЭК-КОДЫ
 КОНК А(ИПЗРЭ)
 КОНД М41В’27’     Е26-НОМБОБ
 КОНД М41В’30’     Е25-ПРИКАЗ
 КОНК М17В’31’     Е24-НЕРОТ
 КОНК А('40000')
 КОНД М41В’32’     Е23-ВЫВОД ТТ
 КОНД М41В’33’     Е22-ПЛ
 КОНД М41В’34’     Е21-Э60
 КОНД М41В’35’     Е20-РПИПЛ
 КОНК М17В’36’     Е19-ВЫДАЧА НА ЕС 7920
 КОНК А(0)
 КОНД М41В’37’     Е18-ЕСПИ80
 КОНД М41В’40’     Е17
 КОНД М41В’41’     Е16-УПРЯЧЬ
 КОНД М41В’42’     Е15
 КОНД М41В’43’     Е14
 КОНД М41В’44’     Е13
 КОНД М41В’45’     Е12
 КОНД М41В’46’     Е11-БОП
 КОНД М41В’47’     Е10-ЭТК71
 КОНД М41В’50’     Е9 -ОТЛАДЧИК
 КОНД М41В’51’     Е8 -Э67
 КОНД М41В’52’     Е7 -КЧ
 КОНД М41В’53’     Е6 -КЗ
 КОНД М41В’54’     Е5
 КОНД М41В’55’     Е4 -СБОЙВУ
 КОНД М41В’56’     Е3
 КОНД М41В’57’     Е2
МШГП	конд	в'7777777777777777'
D02203	конд	в'3040000000001360'
РЭ1	пам	1
РЭ2	пам	1
РЭ3	пам	1
РЭ4	пам	1
РЭ5	пам	1
РЭ6	пам	1
РЭ7	пам	1
СМ	пам	1
РК	пам	1
РМР	пам	1
И15	пам	1
И16	пам	1
И17	пам	1
И20	пам	1
НЗАД	пам	1
ТУСП	конд	в'4040000000000000'
	конд	в'4100000000000000'
	конд	в'4140000000000000'
	конд	в'4200000000000000'
	конд	в'4240000000000000'
	конд	в'4300000000000000'
	конд	в'4340000000000000'
	конд	в'4400000000000000'
	конд	в'4440000000000000'
	конд	в'4500000000000000'
	конд	в'4540000000000000'
	конд	в'4600000000000000'
	конд	в'4640000000000000'
	конд	в'4700000000000000'
	конд	в'4740000000000000'
	конд	в'5000000000000000'
	конд	в'5040000000000000'
	конд	в'5100000000000000'
	конд	в'5140000000000000'
	конд	в'5200000000000000'
	конд	в'5240000000000000'
	конд	в'5300000000000000'
	конд	в'5340000000000000'
	конд	в'5400000000000000'
	конд	в'5440000000000000'
	конд	в'5500000000000000'
	конд	в'5540000000000000'
	конд	в'5600000000000000'
	конд	в'5640000000000000'
	конд	в'5700000000000000'
	конд	в'5740000000000000'
	конд	в'6000000000056000'
	конд	в'6040000000056121'
	конд	в'6100000000056242'
	конд	в'6140000000056363'
	конд	в'6200000000056504'
	конд	в'6240000000056625'
	конд	в'6300000000056746'
	конд	в'6340000000057067'
	конд	в'6400000000057210'
	конд	в'6440000000057331'
	конд	в'6500000000057452'
	конд	в'6540000000057573'
	конк	в'66000000'
	конк	A(ИПЗ54)
	конк	в'66400000'
	конк	A(ИПЗ55)
	конк	в'67000000'
	конк	A(ИПЗ56)
	конк	в'67400000'
	конк	A(ИПЗ57)
	конд	в'7000000000057644'
МПЗ	конд	п'000002'
	конд	п'000006'
	конд	п'00000Э'
	конд	A(E3)
	конд	в'7777777777777600'
МТЗ	конд	в'7777777777777600'
	конд	в'7777777777777600'
	конд	в'7777777777777600'
ЯЧРЖПЛ	конд	в'0003600340002417'
	конд	п'000048'
	пам	1
	конд	в'7777777777777777'
ГРУП	пам	1
D02320	пам	8
ЛЕСТ	пам	1
D02331	пам	1
D02332	пам	1
D02333	пам	1
КВНСДВ	конд	в'2340000000000000'
КВАНТ	пам	1
ДГРУП	пам	1
СМШГП	конд	в'7777777777777777'
ШККЗ	пам	1
Т	пам	1
РТЛ	конд	в'0000000034000041'
Е37Е36	конд	в'0001400000000000'
	пам	1
ТРР	конд	в'0000000000010000'
	пам	1
ТРР1	пам	14
ТСЛ	пам	48
ТАС	конд	в'0000000000040600'
	пам	127
ШЗЗ	пам	2
Е48П25	конд	в'7777777700000000'
Е24П1	конд	в'0000000077777777'
ШКОБМ	пам	1
	конд	в'7777777700177777'
ЭКБУД	пам	1
ОПТИМ	пам	2
БУДГДР	пам	1
D02657	конд	в'0000000000210000'
	конд	в'0000000000400020'
	пам	1
СМШГ	конд	в'7777777777777777'
	пам	1
Н19	конд	в'7777777776777777'
        пам     1
ГРАФАЛ  пам     1
	пам	64
ГРАСИ   пам     2        
БУДГРА  пам     2        
	конд	в'0000000000000377'
	конд	в'0000000000000377'
	конд	в'0000000000000377'
	конд	в'0000000000000377'
	пам	1
МИН	конд	п'000100'
	конд	в'7777777777777777'
Е18Е17	конд	п'000300'
	конд	в'7777777777777777'
Ш1	пам	1
ШАРСИС	пам	1
ШАРКЗ	пам	1
ШАРБОП	пам	1
Ш2	пам	1
Ш3	пам	1
	конд	в'0000000040000000'
	пам	1
D03014	конд	в'0010000000000040'
ШЗАПОС	пам	1
ШОПТИМ	пам	1
ШЗАВЕТ	пам	1
ШКПРЕ	пам	1
РЗ КОНД В’0’
РЗ1 КОНД (6)В’0’
Е41П1	КОНД	М41В’-1’В’-1’
ОЧКУСД	пам	17
ДЛЯНБ КОНД В’0’
Е47П1 КОНД М47В’1’В’-1’
ШР КОНД Х’419922000000’
Е17П1 КОНД В’377777’
П277 КОНД В’277’
Е42П1 КОНД В’-1’М42В’77’
МД29М	пам	2
D03062	пам	2
	конд	в'2400000000000000'
	конд	в'4000000000000000'
	конд	в'5400000000000000'
	конд	в'4000000000000000'
Е31П17  конд    в'0000017777600000'
ОССТБД	конд	в'7777760000177777'
КОК	конд	в'7777777777600000'
БЯК	пам	1
ШКЗЛ	конд	в'6000000105600000'
УЧЕТРВ	пам	1
УЧКОН	пам	1
ШКАКОН	конд	в'0000000000377760'
КУС445	конд	п'01Е200'
КУСБК	конд	п'01Ж200'
	конд	п'01З200'
КУСВЫВ	конд	п'01И200'
МАЛКАТ	конд	в'0000000000400030'
РОСППМ	конд	в'0000000077270707'
	пам	1
	конд	в'7777777777777777'
	конд	в'7727070700000000'
	конд	в'0101542702001000'
	конд	в'0101542302001000'
	конд	в'0101540102001000'
	конд	в'0101541202001000'
	конд	в'0101542002001000'
D03116	пам	2
D03120	пам	1
ДУК	пам	4
	конд	в'7777777760077777'
ФКУСА	пам	1
ФКУСАБ	пам	1
ФКУСАД	пам	1
ОЧЛИС	пам	16
ОЧЛИСД	пам	17
ЛИС2	пам	6
	конд	в'4000000000004037'
	конд	п'000003'
ЯЛИС	пам	1
ЯЛИСМБ	пам	1
МБЛИС	пам	16
ЛИС1Б	пам	3
П14037	конд	в'0000007740370000'
ЗОНВЫ	пам	2
D03232	пам	1
D03233	пам	3
ИВ	пам	1
	конд	п'600000'
	пам	1
D03241	пам	2
D03243	конд	в'0000000201302007'
	пам	17
ИВ23    пам     1        
D03266	конд	в'0000000000017606'
ИВ25	конд	в'0000000201302007'
	пам	1
П60П44	конд	в'6044'
ЛИСТЫ	конд	в'2031376340000000'
	конд	п'00000П'
ШКНПП	пам	3
	конд	в'4000000000000000'
ИВ34	пам	3
	конд	п'00000Б'
УПОК	конд	в'0000000200302007'
ВИГ11	пам	3
Е24П48	конд	в'7777777740000000'
Е1П23	конд	в'0000000037777777'
Е47П33	конд	в'3777740000000000'
	конд	в'7777776033407777'
Е48П7	конд	в'7777777777777700'
	пам	2
ШЗУПР	пам	1
ЭТУПР	пам	1
БУДУПР	пам	1
SSЕСТЬ	пам	1
Л175	конд	в'7640000000000000'
П27	конд	в'0000000000000027'
ШЗБУДС	пам	1
ШЗБУДП	пам	1
ШКДТ	пам	11
ШКДТП	пам	11
ШКЗЗК	пам	2
NБЛ	конд	в'0000000000007777'
ПРСВЛ	конд	в'7540000000000000'
ШМАРС	пам	1
РОДОН	пам	1
КДД     КОНД    В’-1’М16В’3’
КДВ	конд	в'7777777777000000'
П17777	конд	в'0000000000017777'
П37777	конд	в'0000000000037777'
РТР	пам	1
О29П17	конд	в'7777774000177777'
О46П31	конд	в'6000007777777777'
ШКАП	пам	1
МЛЕС  пам     1
ШКМБ	пам	1
ШКМБП	пам	1
ШКОМБ	пам	1
ШКОБП   пам     1
ШКМД	пам	1
ШКМДП	пам	1
ШКОМД	пам	1
ШКОДП	пам	1
ШКМЛ	пам	1
ШКМЛП	пам	1
ШКОМЛ	пам	2
КОТК	конд	в'6000000001000000'
ШКОГ	конд	п'0 F000'
ОТВКАЧ	конд	п'400000'
ШКОШ	пам	1
D03414	пам	1
СКБЭ    пам     1
	конд	в'0000000000377776'
НБТ	конд	в'0000000000370037'
КВЭ600	конд	в'0010037600000000'
	конд	в'0010037774000000'
РАБ600	пам	2
ТАБТИП  пам     13        
ШКНП	пам	1
УПРЯТ	пам	1
ШКВОС	пам	6
ШКЧТЕН	конд	в'7777777777777777'
КУСНН	конд	в'0004040301400000'
D03453	пам	2
ШРНОМБ	пам	2
A03457	мод	ТУС-1+'31'
	по	'2645'
	нед	
	или	E26
	уиа	БМВ(М16)
	пб	ЗАПВЕТ
ОТКАЗН	уиа	'2003'
	или	ШКСВН
	зп	ШКСВН
	счи	М7
	сда	64-2
	или	КОТК
	уиа	A04477(М15)
	пб	ТБУФ
внупр	счрж	'77'
	зп	РК
	счи	М17
	зп	И17
	счмр	64
	зп	РМР
	счи	М16
	зп	И16
	счи	М15
	зп	И15
	счи	М20
	зп	И20
	рег	'237'
	зп	РЭ4
	и	ПОДПРГ
	зп	РЭ2
	сч	ГАШРП1
	уи	
	рег	'37'
	сч	РЭ2
	по	БМВ
	нед	
	уи	М16
	пб	ШЗЗОБМ(М16)
ТВ201	счи	М27
	зп	РЭ1
	и	E10
	сда	64+1
	зп	РЭ2
	нтж	E9
	нтж	РЭ1
	уи	М27
	или	РЭ2
	пино	A03511(М16)
	сч	РЭ1
	нтж	РЭ2
	уи	М27
A03511	и	E9
	по	A03514
	счи	М33
	слц	Е15П1
	уи	М33
A03514	счи	М33
	пб	(М15)
чисчжл	сч	РЭ4
	сда	64+4
ТВ204А	и	П37
	зп	РЭ1
	нтж	П37
	уи	М17
	сч	ГУС
	уи	М15
	сда	64+15
	и	П377
	по	A03524
	уи	М15
	мод	ТУС-1(М15)
	уиа	(М15)
A03524	счи	М17
	нтж	П37
	сда	64-6
	или	РК
	зп	РК
	сч	22(М15)
	и	E48(М17)
	пе	АВДРУГ
	сч	32(М15)
	и	E48(М17)
	уиа	4(М16)
	по	СТ175
	сч	ГУС
	и	E48
	пе	КЛИН
	сч	ШКОБМ
	мод	НЗАД
	или	E48-1
	зп	ШКОБМ
	пб	ВИСП3
КЛИН	мод	НЗАД
	сч	E48-1
	нтж	ВСЕЕД
	и	ШОПТИМ
	зп	ШОПТИМ
	сч	НЗАД
	и	Е47П1
	или	E42
	мода	
	пв	ЗАПВЕТ(М16)
	пе	БПУ
	сч	E13
ЗАКЛИ	или	РЭ1
	сда	64-23
	или	ГУС
	зп	ГУС
ВИСП3	уиа	БПУ(М15)
	пб	A04504
ТВ205	уиа	17(М17)
	пио	ЗАПРК(М16)
	уиа	16(М17)
	пб	ЗАПРК
КОНКОМ	счи	М27
	и	E13
	пе	СТ175
	уиа	20(М17)
ЗАПРК	мод	И16
	уиа	(М16)
	мод	И15
	уиа	(М15)
ТВ206А	счи	М17
	уиа	'2003'
	сда	64-41
	зп	РЭ2
	счи	М16
	зп	И16
	мод	ГУС
	уиа	(М16)
	сч	36(М16)
	и	Е41П1
	или	РЭ2
	зп	36(М16)
	сч	41(М16)
	и	Е47П1
	зп	41(М16)
	сч	ШКОК
	мод	НЗАД
	и	E48-1
	по	A03567
	пио	ЭК74(М17)
A03567	мод	ГУС
	сч	33
	и	E22
	по	Ф4
ЭК74	мод	И16
	уиа	(М16)
	мод	И17
	уиа	(М17)
АВРАСП	сч	Е33
	пб	ВЫЗОВ
АВОСТА	сч	36(М15)
	и	Е41П1
	зп	36(М15)
	счи	М17
	сда	64-41
	или	36(М15)
	зп	36(М15)
	уиа	A03567(М17)
	счи	М17
A03601	зп	3(М15)
	сч	5(М15)
	и	Е16П32
	или	П2007
	зп	5(М15)
	пб	(М16)
ЗПСЧ	уиа	ЗАПРК(М15)
	пб	ТВ201
A03605	счи	М17
	зп	И17
	уиа	(М17)
	сч	ШКОК
	мод	НЗАД
	и	E48-1
	пе	Э13
	уиа	Е10П3(М17)
Э13	счи	М32
	слц	Е15П1
	уи	М32
	уи	М33
	пб	ТВ206А
ТВ202	уиа	(М16)
	пб	ТВ201
ТВ213	сда	64+10
	пб	ТВ204А
ТВ215	уиа	23(М17)
	пб	ЗАПРК
u3617	сч	РМЛ
	слц	E42
	по	'65764'
	зп	РМЛ
	уиа	-1(М16)
A03622	сч	D03116+1(М16)
	нтж	РМЛ
	и	Е47П43
	пе	A03631
	сч	МГРП
	и	E45(М16)
	по	A03631
	сч	E21(М16)
	увв	'31'
	сч	E2(М16)
	зп	D03116+1(М16)
	или	D03120
	зп	D03120
A03631	цикл	A03622(М16)
	сч	ШКПЛАН
	по	A03660
	и	E19
	пе	A03660
	сч	3
	нтж	Е42П1
	и	Е48П25
	по	A03660
	сч	ШКПЛАН
	или	E19
	зп	ШКПЛАН
	сч	E40
A03640	уиа	'2003'
	или	ШКИВ
	зп	ШКИВ
	сч	ВИГ11
	пе	БМВ
	уиа	БПУ(М16)
ВИСП15	сч	E43
	пв	ВШГ(М15)
	зп	ВИГ11
	сч	D03266
	зп	D03241
	сч	ИВ25
	зп	D03243
	пб	(М16)
ПРОУПР	и	ШКЗЗК
	пе	ПОГРУП
	сч	ШЗУПР
	нед	
	уи	М15
	мод	НЗАД(М15)
	сч	5
	и	E3
	пе	ПОГРУП
	сч	E48-1(М15)
	уиа	БВЗ1(М16)
	пв	ИЗШГП(М15)
	сч	ШКИВ
	или	E16
	зп	ШКИВ
	сч	ВИГ11
	пе	БВЗ1
	пб	ВИСП15
A03660	уиа	-1(М16)
	пб	U73725
	конд	в'0010142767117762'
	конк	A(D01434)
	конк	в'00100000'
	конк	A(D01427)
	конк	в'02200000'
A03664	уиа	(М17)
	ржа	'3'
	сч	РСЧРАЗ
	по	A76600
	сч	ТРАЗМ
	слц	E1
	зп	ТРАЗМ
	нтж	ЗТРАЗМ
	пе	A76600
	сч	РСЧРАЗ
	и	E48
	по	A03676
	нтж	РСЧРАЗ
	зп	РСЧРАЗ
	сч	П3
	увв	'141'
A03674	сч	
	зп	ЗТРАЗМ
	зп	ТРАЗМ
	пб	A76600
A03676	сч	E2
	увв	'141'
	сч	РЕЖРАЗ
	или	E37
	зп	РЕЖРАЗ
	пб	A03674
u3701	уи	М16
	сч	Т
	слц	E1
	зп	Т
	сч	33(М16)
	слц	E24
	зп	33(М16)
	по	A03707
	мод	НЗАД
	сч	E48-1
	и	ШЗАПОС
	по	A03726
A03707	сч	ВРЕМЯ
	слц	E1
	зп	ВРЕМЯ
	сч	ГУС
	и	E48
	по	A04177
	сч	ШГ
	пе	БПУ
	пб	A04177
u3714	сч	РМЛ
	и	Е40П1
	зп	РМЛ
	сч	3
	нтж	Е42П1
	и	Е48П25
	по	БМВ
	сч	ШЗПОМД
	или	E24
	зп	ШЗПОМД
	нтж	E24
	пе	A03725
	уиа	'74064'(М15)
	счи	М15
	зп	'73331'
	сч	E44
	мода	
	пв	ВШГ(М15)
A03725	сч	E26
	пб	A03640
A03726	уиа	38(М17)
	пб	ЗАПРК
A03727	зп	РЭ1
	увв	'4034'
	или	РЭ1
	и	МПРП
	по	БМВ
	зп	РЭ1
	и	E8
	пе	A03734
	сч	РЭ1
A03734	нед	
	уи	М17
	сч	E48-1(М17)
	зп	НСТПРП
	нтж	ВСЕЕД
	увв	'30'
	сч	E37
	нтж	ВСЕЕД
	уи	
	рег	'37'
	слиа	-25(М17)
	пб	prptab(М17)
ОБВНПР	счрж	'77'
	зп	РК
	счи	М20
	зп	И20
	счмр	64
	зп	РМР
	счи	М17
	зп	И17
	счи	М16
	зп	И16
	счи	М15
	зп	И15
БМВ	рег	'237'
	и	СПНОМ+29 
	пе	A03756
	рег	'237'
	или	ШКПРЕ
	и	ГАШРП1
	и	МГРП
	зп	РЭ1
	и	D00477
	пе	A03756
	сч	РЭ1
	по	A04367
A03756	нед	
	уи	М16
	сч	E48-1(М16)
	нтж	ЕДК10Р
	уи	
	рег	'37'
	пб	ШЗЗОБМ(М16)
ШЗПОМД	пам	1
ШЗПОМБ	пам	1
ШЗЗОБМ	пам	1
	мод	ТУС+1 СИ А0
	пб	Е7Е21
	мод	ТУС+1 СИ А1
	пб	Е7Е21
	уиа	1(М16) своб МБ1
	пб	'64174'
	уиа	2(М16) своб МБ2
	пб	'64174'
	мод	ТУС-1+'24' СИ ВУ0
	пб	'626'   смещение 
	мод	ТУС-1+'24' СИ ВУ1
	пб	'626'   смещение
	мод	ТУС-1+'24' СИ ФС0
	пб	'656'   смещение
	мод	ТУС-1+'24' СИ ФС1
	пб	'656'   смещение
	сч	D01427 таймер
	пб	A07043
	мод	ТУС+1 ноль А0
	пб	ШГ
	мод	ТУС+1 ноль А1
	пб	ШГ
	увв	'4030' ПРП
	пб	A03727
	уиа	3(М16) гот напр. 3
	пб	A64770
	уиа	4(М16) гот напр. 4
	пб	A66470
	уиа	5(М16) гот напр. 5
	пб	A64770
	уиа	6(М16) гот напр. 6
	пб	A64770
	сч	ЗАНЯТА запрос
	пб	A07067
	сч	D03414 ТТ старт
	пб	A03457
	сч	ШКПРЕ  имитация
	пб	'17332'
	уиа	3(М16) своб 3
	пб	A74014
	уиа	4(М16) своб 4
	пб	A74014
	уиа	5(М16) своб 5
	пб	'64746'
	уиа	6(М16) своб 6
	пб	'64746'
	сч	МГРП   своб 7
	пб	st7007
grp24	стоп    ,      ГРП 24 
	пб	grp24
 СЧ ГУС    23Р.ДЕЛЕНИЕ НА НУЛЬ
 ПБ ПРДЕЛ
 СЧ ГУС           ПЕРЕПОЛНЕНИЕ АУ 22Р. ГРП
  ПБ ПЕРЕП
	сч	РЭ4    ГРП 21
	пб	ВЫЗКЧ
	уиа	чисчжл(М15)
	пб	A67523
	увв	'4100'
	пб	QQ1
	увв	'4100'
	пб	QQ1
 УИА 22(М17)  ПО ЗП
 ПБ ЗПСЧ
 УИА 21(М17)  ПО СЧ
 ПБ ЗПСЧ
	уиа	ГРП15(М15)
	пб	ТВ201
 УИА ТВ213(М15)    *С ОБР.В ЗАКР.ЛИСТ ЗА КОМ.14Р.М15=ТВ213
 ПБ ТВ202         ОБРАЩЕНИЕ В ЗАКРЫТЫЙ ЛИСТ ЗА КОМАНДОЙ
 УИА 18(М17)       *С ЗАПРЕЩ.КОМАНДА 13Р.ГРП
  ПБ ЗАПРК
 УИА ТВ215(М15)    *С ОСТАНОВ ПО КРА 12Р.ГРП М15=ТВ215
 ПБ ТВ202         ОСТАНОВ ПО КРА
grp11	стоп	
	пб	grp11
grp10	сч	'72320'
	пб	A66510
prptab	мод	ТУС-1+'24'  ПРП 24
	пб	'626'   смещение
	мод	ТУС-1+'24'  ПРП 23
	пб	'626'   смещение
	мод	ТУС-1+'24'  ПРП 22
	пб	'650'   смещение
	мод	ТУС-1+'24'  ПРП 21
	пб	'650'   смещение
	мод	ТУС-1+'37'  ПРП 20
	пб	41
	мод	ТУС-1+'37'  ПРП 19
	пб	41
	мод	ТУС-1+'37'  ПРП 18
	пб	41
	мод	ТУС-1+'37'  ПРП 17
	пб	41
	мод	ТУС-1+'33'  ПРП 16
	пб	ММБН
	мод	ТУС-1+'33'  ПРП 15
	пб	ММБН
	мод	РОДОН   ПРП 14
	пб
	пб	ГАСИ13  ПРП 13
        мода
	уиа	(М16)   ПРП 12
	пб	'17314'
	уиа	1(М16)  ПРП 11
	пб	'17314'
	уиа	(М15)   ПРП 10
	пб	'17357'
	уиа	1(М15)  ПРП 9
	пб	'17357'
	мода	,        ПРП 8
	пб	БМВ
	мода	,        ПРП 7
	пб	БМВ
	мода	,        ПРП 6
	пб	БМВ
	мода	,        ПРП 5
	пб	БМВ
	мода	,        ПРП 4
	пб	БМВ
	пам	1       ПРП 3
	уиа	3(М16)  ПРП 2
	пб	ПРЗАХВ
	уиа	4(М16)  ПРП 1
	пб	ПРЗАХВ
u4064	и	E4
	пе	БМВ
	сч	ТУС-1+'55'
	уи	М17
	пб	E30(М17)
ВРЕСОБ	сч	СМ
	и	П3777
	уиа	1(М17)
A04071	уиа	'2003'
	мод	НЗАД
	уиа	(М16)
	и	П3777
	пе	A04076
	сч	ШЗБУДС(М17)
	или	E48-1(М16)
	нтж	E48-1(М16)
	зп	ШЗБУДС(М17)
	пб	(М15)
A04076	слц	П3777
	зп	РЭ2
	сч	ШЗБУДС(М17)
	или	E48-1(М16)
	зп	ШЗБУДС(М17)
	счи	М17
	уиа	-10(М17)
	пе	A04110
A04102	сч	РЭ2
	мода	(М16)
	сда	64-38(М17)
	нтж	ШКДТП-1(М17)
	и	E48-1(М16)
	нтж	ШКДТП-1(М17)
	зп	ШКДТП-1(М17)
	цикл	A04102(М17)
	пб	(М15)
ТАЙМЕР	уиа	(М17)
	пб	A04071
A04110	сч	РЭ2
	мода	(М16)
	сда	64-38(М17)
	нтж	ШКЗЗК-1(М17)
	и	E48-1(М16)
	нтж	ШКЗЗК-1(М17)
	зп	ШКЗЗК-1(М17)
	цикл	A04110(М17)
	пб	(М15)
u4115	слц	E1
	зп	СЧПР2
	нтж	П5
	пе	БМВ
	зп	СЧПР2
	уиа	-1(М15)
A04120	сч	D03062+1(М15)
	по	A04124
	сда	64+1
	зп	D03062+1(М15)
	пе	A04124
	сч	'76016'
	увв	'175'(М15)
A04124	цикл	A04120(М15)
	сч	ШЗБУДС
	по	A04144
	уиа	-10(М15)
A04126	нтж	ШКДТП-1(М15)
	зп	ШКДТП-1(М15)
	счмр	64
	и	ШКДТП-1(М15)
	по	A04144
	цикл	A04126(М15)
	зп	РЭ1
	нтж	ШЗБУДС
	зп	ШЗБУДС
A04133	сч	РЭ1
	по	A04144
	нед	
	уи	М16
	сч	РЭ1
	нтж	E48-1(М16)
	зп	РЭ1
	сч	ПРЕДЕЛ
	и	E31
	по	A04142
	сч	E48-1(М16)
	нтж	E24
	по	'42606'
A04142	сч	E48-1(М16)
	пв	ВШГ(М15)
	пб	A04133
A04144	сч	ШЗБУДП
	по	u3617
	уиа	-10(М15)
A04146	нтж	ШКЗЗК-1(М15)
	зп	ШКЗЗК-1(М15)
	счмр	64
	и	ШКЗЗК-1(М15)
	по	u3617
	цикл	A04146(М15)
	зп	РЭ1
	нтж	ШЗБУДП
	зп	ШЗБУДП
	пб	A04160
A04153	сч	МШГП
	или	E48-1(М16)
	зп	МШГП
	пб	A04160
A04155	сч	62(М17)
	и	E25
	по	A04153
	счи	М16
	или	E25
	пв	ЗАПВЕТ(М16)
A04160	сч	РЭ1
	по	u3617
	нед	
	уи	М16
	сч	РЭ1
	нтж	E48-1(М16)
	зп	РЭ1
	сч	НЗАД(М16)
	уи	М17
	сч	ЭКБУД
	и	E48-1(М16)
	по	A04155
	нтж	ЭКБУД
	зп	ЭКБУД
	сч	E48-1(М16)
	пв	ВШГП(М15)
	пб	A04160
ПРДЕЛ	и	E48
	по	СТ175
	уиа	14(М17)
	пб	ЗАПРК
ГАСИ13	сч	E13
	пв	ГАШПРП(М15)
A04174	сч	E19
	пб	A03640
ПЕРЕП	и	E48
	по	АВАРИЯ
	уиа	15(М17)
	пб	ЗАПРК
A04177	сч	D01434
	по	БМВ
	сч	
	зп	D01434
БПУ	уиа	'2003'
	сч	'73002'
	пе	БМВ
	мод	ГУС
	уиа	(М17)
	сч	4(М17)
	и	Е48П16
	зп	РЭ2
	счи	М27
	зп	РЭ1
	сч	СМ
	счм	РК
	счм	РМР
	счим	М33
	счим	М32
	или	РЭ2
	счм	(М17)
	и	Е48П16
	или	РЭ1
	счм	И20
	счм	И17
	счм	И16
	счм	И15
	уиа	12(М16)
БПУ1	слиа	-1(М16)
	счим	М1(М16)
	пино	БПУ1(М16)
	зп	(М17)
БВЗ	сч	ГУС
	сда	64+41
	уи	М17
	сч	ГУС
	зп	ТУС-1(М17)
	сч	D02203
	зп	ГУС
	сда	64+41
	зп	НЗАД
	сч	П13
	уи	М21
	уи	
	сч	ТАБЛО
	увв	'147'
	уиа	'2003'
	уиа	-8(М17)
	сч	SSЕСТЬ
	пе	БВЗ1
	сч	МШГП
	нтж	ВСЕЕД
	и	ШГП
	и	ШЗАВЕТ
	по	БВЗ1
	сч	ШКПРЕ
	или	E30
	зп	ШКПРЕ
БВЗ1	сч	ШГ
	и	МШГ
	и	СМШГ
	пе	БВЗС
	сч	МШГП
	или	ШЗАПОС
	и	ШГП
	и	СМШГП
	зп	ТВР1
	и	ШЗУПР
	пе	ПРОУПР
	сч	ТВР1
	и	E17
	пе	БВЗ2
	сч	ТВР1
	и	ШЗАПОС
	пе	БВЗ2
ПОГРУП	сч	ЛЕСТ-1(М17)
	и	ТВР1
	пе	ЕВГРУП
	сч	ГРУП
	и	ШКРЗ
	пе	НЕТЗД
	цикл	ПОГРУП(М17)
НЕТЗД	сч	ТУС-1
	зп	ГУС
	уи	М17
	сч	
	зп	НЗАД
	пб	БВЗ20
ЕВГРУП	зп	ТВР1
	и	МИН
	пе	БВЗ2
	сч	ЛЕСТ-1(М17)
	зп	ДГРУП
	уиа	-3(М16)
ПОЛЕСТ	сч	D02333(М16)
	и	ТВР1
	пе	БВЗ2
	цикл	ПОЛЕСТ(М16)
БВЗС	нед	
	зп	НЗАД
	уи	М15
	сч	ТУС-1(М15)
	зп	ГУС
	пб	БВЗА
БВЗ2	нед	
	или	E48
	зп	НЗАД
	уи	М15
	сч	НЗАД(М15)
	зп	ГУС
	мода	
	пв	ПРОВЛ(М14)
БВЗА	сч	ГУС
	уи	М17
	сда	64+15
	и	П377
	по	БИЗ
	уи	М14
	мод	ТУС-1(М14)
	уиа	(М17)
БИЗ	сч	НЗАД
	и	E48
	по	БВЗ20
	сч	МИН
	или	ШЗАПОС
	и	E48-1(М15)
	пе	БВЗ20
	сч	Е36(М17)
	зп	КВАНТ
	слц	33(М17)
	по	БВЗ21
	сч	Е36(М17)
	и	П177
	сд	КВНСДВ
	слц	33(М17)
	нтж	Е24П48
	нтж	Е36(М17)
	и	Е24П48
	нтж	Е36(М17)
	зп	Е36(М17)
	пино	НЕПОСЛ(М16)
	уиа	-2(М16)
	сч	D02333
	нтж	E48-1(М15)
	и	ДГРУП
	пе	ВВЕРХ
БВЗ20	сч	
	зп	КВАНТ
БВЗ21	уиа	БВЗ32(М15)
	пб	БИЗОН1
ВВЕРХ	сч	D02333(М16)
	и	ДГРУП
	зп	ШКМГОС
	нтж	D02333(М16)
	зп	D02333(М16)
	сч	D02332(М16)
	или	ШКМГОС
	зп	D02332(М16)
	цикл	ВВЕРХ(М16)
	уиа	-1(М16)
НЕПОСЛ	сч	E48-1(М15)
	нтж	D02333(М16)
	зп	D02333(М16)
	сч	E48-1(М15)
	или	КВНСДВ(М16)
	зп	КВНСДВ(М16)
	пб	ПОЛЕСТ
ЗАНПРП	слиа	64(М17)
A04325	уиа	'2003'
	сч	ГУС
	и	КРОМЕ
	зп	ГУС
	счи	М17
	сда	64-15
	или	ГУС
	зп	ГУС
	мод	ТУС-1(М17)
	уиа	(М17)
БИЗОН1	уиа	-6(М16)
A04333	зп	1
	цикл	A04333(М16)
	сч	32(М17)
	сда	64-4
	рег	'30'
	сч	32(М17)
	сда	64+4
	рег	'31'
	сда	64+8
	рег	'32'
	сда	64+8
	рег	'33'
	уиа	-7(М16)
	слиа	32(М17)
A04342	сч	(М17)
	рег	'27'(М16)
	цикл	A04342(М16)
	пб	(М15)
БВЗ32   уиа     -11(М16)
        мод     ГУС
        уиа     24(М17)
        сч      D01421
        нтж     E48
        слц     9(М17)
        зп      9(М17)
        сч      E48
        зп      D01421
        сч      (М17)
        уиа     '2000'
        уи      М35
        уиа     '2003'
        сч      (М17)
        уиа     '2000'
        уи      М34
        уиа     '2003'
        сч      (М17)
БВЗ4    уим     М14(М16)
        цикл    БВЗ4(М16)     
        зпм     И15
        зпм     И16
        зпм     И17
        зпм     И20
        уи      М27
        сда     64+15
        по      ОБЩМГ
        уим     М21
        уим     М32
        уим     М33
        зпм     РМР
        зпм     РК
        зп      СМ
        рег     '107'
        сч      23(М17)
        и       E48
        по      А04367
        рег     '101'
A04367	сч	D76735
	пе	A67272
	сч	НЗАД
	пб	A07011
A04371	мод	И16
	уиа	(М16)
	мод	И15
	уиа	(М15)
	сч	И20
	уи	М20
	сч	РМР
	нтж	
	сч	СМ
	рж	РК
	выпр	(М3)
УСТПРП	уиа	'2003'
	зп	РЭ1
	нтж	ВСЕЕД
	увв	'30'
	сч	РЭ1
	или	МПРП
	зп	МПРП
	увв	'34'
	сч	E37
	и	МГРП
	пе	(М15)
	сч	E37
	уиа	'2003'
	зп	РЭ1
	нтж	ВСЕЕД
	уи	
	рег	'37'
	сч	РЭ1
	или	МГРП
A04411	зп	МГРП
	рег	'36'
	уи	
	пб	(М15)
ГАШПРП	уиа	'2003'
	и	МПРП
	нтж	МПРП
	зп	МПРП
	увв	'34'
	пе	(М15)
	сч	E37
ТВ67А	уиа	'2003'
	нтж	ВСЕЕД
	и	МГРП
	пб	A04411
БЖТ	сч	E21
	или	ТАБЛО
	увв	'147'
	уиа	'2003'
	сч	'72054'
	или	'72055'
	по	A04431
	сч	ПОДНОС
	или	'72052'
	пе	A04431
	сч	'72054'
	зп	ПОДНОС
	сч	'72055'
	зп	'72052'
	сч	E38
	пв	ВШГ(М15)
A04431	уиа	'4003'
	уиа	-15(М1)
A04432	сч	ШГ
	и	МШГ
	пе	A04435
	сч	ШГП
	и	МШГП
	по	A04437
A04435	уиа	A04437(М16)
	уиа	'2003'
	уии	М33(М16)
	пб	A05570
A04437	уиа	'77634'(М15)
	уиа	'3'
A04440	цикл	A04440(М15)
	цикл	A04432(М1)
	пб	БЖТ
ТВ40	уиа	'2003'
	зп	РЭ2
	счрж	'177'
	зп	РК
	сч	РЭ2
	пб	ВЫЗОВ
ТИВ	сч	36(М16)
	зп	И16
	сда	64+15
	и	П77
	нтж	D00525
	уиа	(М16)
	по	A04455
	уии	М27
	счи	М32
	уи	М33
	сч	ГУС
	и	E48
	пе	A04455
	уиа	1(М16)
	сч	П7
	уи	М27
A04455	сч	ШЗН(М16)
	мод	НЗАД
	или	E48-1
	зп	ШЗН(М16)
	уиа	ВИСП3(М16)
	сч	ВИГ11
	пе	ВИСП3
	пб	ВИСП15
A04461	сч	6(М15)
	зп	ТР3+3(М15)
	цикл	A04461(М15)
	сч	E25
	пб	A03640
u4464	уиа	'2003'
	уии	М17(М16)
A04465	уиа	'2003'
	нед	
	уи	М15
	сч	ШКСВН
	или	E48-1(М15)
	зп	ШКСВН
	сч	ТУС-1(М15)
	сда	64+8
	и	П177
	уи	М16
	сч	ШКСВМ
	или	E48(М16)
	зп	ШКСВМ
	сч	E48-1(М15)
	нтж	Е36
	пе	(М17)
	уии	М15(М17)
	сч	E8
	пб	ГАШЗАН
A04477	сч	ВИГ11
	пе	ВИСП16
	сч	ШКИВ
	или	ШЗН
	или	D02076
	по	ВИСП16
	мода	
	пв	ВИСП15(М16)
ВИСП16	уиа	БВЗ(М15)
A04504	сч	НЗАД
	уи	М17
	и	E48
	пе	A04507
	сч	E48-1(М17)
	пб	ИЗШГ
A04507	сч	E48-1(М17)
	пб	ИЗШГП
A04510  уиа     А04477(М17)
        пб      A04465  
A04511  уиа     '2003'  
        нед     
        уи      М15     
        сч      Е48-1(М15)
        или     ШКСВН   
        зп      ШКСВН   
        сч      Е48-1(М15)
        или     ШКНП    
        зп      ШКНП    
        пб      А04477  
ТБУФ	уиа	'2003'
	зп	СМ
	уиа	2(М16)
	по	A04532
	нтж	E1
	пе	A04547
	сч	ШКСВМ
	уиа	(М16)
	пе	A04524
	уиа	D03116-1(М16)
	сч	ШКНП
	по	A04544
A04524	нед	Е15П1
	уи	М17
	сч	ШКСВМ(М16)
	нтж	E48(М17)
	зп	ШКСВМ(М16)
	пио	A04531(М16)
	сч	ТУС(М17)
	сда	64+8
	и	П177
	пб	(М15)
A04531	счи	М17
	пб	(М15)
A04532	уии	М16(М15)
	сч	ПОДНОС
	или	'72052'
	пе	A04536
	сч	ШГ
	или	E38
	зп	ШГ
A04536	сч	ПОДНОС
	мод	НЗАД
	или	E48-1
	зп	ПОДНОС
A04540	счи	М15
	зп	И15
	уии	М33(М16)
	сч	К2013
	уи	М27
	счрж	'77'
	зп	РК
	пб	ВИСП3
A04544	мод	НЗАД
	сч	E48-1
	или	ТР13
	зп	ТР13
	уиа	ТБУФ(М16)
	пб	A04540
A04547	сда	64+12
	по	ПЛВОЗУ
	сч	СМ
	и	E19
	пе	A04563
	сч	СМ
	сда	64+10
	уиа	3(М16)
	и	П77
	по	СТ175
	уи	М16
	сч	E48(М16)
	или	ШКСВМ
	зп	ШКСВМ
A04556	сч	ШГ
	или	ТР13
	зп	ШГ
	сч	
	зп	ТР13
	уиа	-5(М16)
A04561	зп	2
	цикл	A04561(М16)
	пб	(М15)
A04563	сч	СМ
	сда	64+12
	и	П37
	по	СТ175
	уи	М16
	уии	М17(М10)
	мода	
	пв	УПРИ(М10)
	уии	М10(М17)
	сч	СМ
	сда	64+42
	пе	A04577
	сч	Е48П17
	уиа	'2002'
	и	ТОП(М16)
	по	A04574
A04573	стоп	28086
	пб	A04573
A04574	зп	ТОП(М16)
	уиа	'2003'
	сч	E48(М16)
	нтж	ТЗФСТР
	зп	ТЗФСТР
	пб	A04556
A04577	сч	СМ
	и	Е48П43
	сда	64+1
	уиа	'2002'
	или	ТОП(М16)
	зп	ТОП(М16)
	уиа	'2003'
	пб	A04556
ЗАНОСМ  уиа     '2003'
        сч      '41'(М7)
        слц     ВРМАТ
        зп      ВРМАТ
        сч      E48
        зп      '41'(М7)
        пб      (М16)
ГАШЗАН	уиа	'2003'
	зп	СМ
	или	ЗАНЯТА
	нтж	СМ
	зп	ЗАНЯТА
	сч	СМ
	и	E5
	по	A04616
	сч	ШКОМБ
	по	A04616
	или	ШКМБ
	зп	ШКМБ
	сч	
	зп	ШКОМБ
A04616	сч	ШГ
	или	ШКЗАН
	зп	ШГ
	сч	ШГП
	или	D01356
	зп	ШГП
	сч	
	зп	ШКЗАН
	зп	D01356
	пб	(М15)
ЗАХЗАН   уиа     '2003'
        зп      СМ
        и       ЗАНЯТА
        по      A04632
        сч      ГУС
        сда     64+47
        уи      М16
        мод     НЗАД
        сч      E48-1
        или     ШКЗАН(М16)
        зп      ШКЗАН(М16)
        уиа     ЗАХЗАН(М16)
        пб      А04540
A04632  сч      ЗАНЯТА
        или     СМ
        зп      ЗАНЯТА
        пб      (М15)
ПЕРЕВ   уиа     '2003'
        зп      СМ
        уиа     -5(М16)
        ржа     '3'
A04636  сда     64+8
        зп      РК
        сч      СМ
        умн     Ч01Д
        зп      СМ
        счмр    64
        умн     R
        сда     64-40
        или     РК
        цикл    A04636(М16)
A04643  уиа     '3'
        пб      (М15)
ИЗ10В8   уиа     '2003'
        сда     64-32
        зп      СМ
        ржа     '3'
        уиа     -3(М16)
        сч       
A04647  умн     R
        счмр    64
        зп      РК
        сч      СМ
        сда     64-4
        зп      СМ
        счмр     
        слц     РК
        цикл    A04647(М16)
        пб      A04643
ВЕТКА	счи	М16
	зп	И16
	по	A05056
	счрж	'37'
	или	П13
	зп	РК
	счи	М16
	нтж	П6
	по	A04663
	нтж	E1
	по	A04663
	сч	E16
	мода	
	пв	ПЕЭКС(М16)
A04663	слиа	-8(М16)
	сч	ГУС
	и	E48
	по	ЭКВЫХ
	пино	A04676(М16)
	сч	ВРЕМЯ
	пб	A07001
ЭК57	счрж	'7777'
	зп	РК
	счи	М16
	сда	64+3
	нтж	П60
	по	A04674
	сч	РК
	уиа	A04770+4(М16)
	пб	A04770
A04674	счи	М16
	зп	И16
	сч	
	пб	КИПР
A04676	сч	E35
	пб	ТВ40
A04677	счрж	'77'
	или	E4
	зп	РК
	сч	И16
	нтж	E8
	нтж	E5
	по	ВХ220
	сч	E11
	мода	
	пв	ПЕЭКС(М16)
	сч	И16
	нтж	П177
	нтж	E2
	пе	A06742
	сч	СМ
	сда	64+5
	и	П177
	уиа	36(М16)
	по	ЗАПЭКС
	пб	ЭКВЛ
Э60	зп	И16
	счрж	'37'
	или	E5
	зп	РК
	сч	E11
	пв	ПЕЭКС(М16)
	сч	E21
	пб	ТВ40
ЗАПВЕТ	уиа	'2003'
	зп	РЭ2
	уи	М17
	мод	НЗАД(М17)
	уиа	(М17)
	сда	64+24
	или	62(М17)
	зп	62(М17)
	сч	РЭ2
	сда	64+24
	или	E46(М17)
	зп	E46(М17)
	сч	E47(М17)
	и	Е15П1
	по	A04743
	сч	62(М17)
	сда	64+24
	и	62(М17)
	по	A04743
	сч	40(М17)
	и	E34
	по	A04743
A04730	мод	РЭ2
	уиа	(М17)
	сч	ОСПОД
	и	E48-1(М17)
	пе	A04747
	сч	E48-1(М17)
	и	ШЗАПОС
	пе	A04747
	сч	E48-1(М17)
	или	ШЗАВЕТ
	зп	ШЗАВЕТ
	сч	МШГП
	или	E48-1(М17)
	нтж	E48-1(М17)
	зп	МШГП
	сч	E6
	увв	'31'
	сч	ШКПРЕ
	или	E30
	зп	ШКПРЕ
	пб	(М16)
A04743	сч	ШКОК
	мод	РЭ2
	и	E48-1
	пе	A04747
	сч	E46(М17)
	сда	64+24
	и	E46(М17)
	пе	A04730
A04747	сч	
	пб	(М16)
A04750	счи	М16
	пио	A04766(М16)
	зп	И16
	сда	64+3
	пе	A04677
	сч	И16
	нтж	E1
	пе	A04764
	сч	СМ
Я	уиа	u5031(М16)
	пб	Э3
ЭКВВД	счрж	'177'
	или	П32
	слц	E1
	зп	РК
	счи	М16
	зп	И16
	нтж	Е15П1
	по	A67447
	сч	E14
	пв	ПЕЭКС(М16)
A04763	сч	E32
	пб	ВЫЗОВ
A04764	уиа	(М16)
	сч	СМ
	мод	И16
	пб	Э
A04766	уиа	A05006+1(М16)
	сч	СМ
Э3	зп	СМ
	счрж	'7777'
A04770	зп	РК
	счи	М17
	зп	И17
	счи	М15
	зп	И15
	ржа	'10'
	уиа	СМ(М17)
	пб	A07034
	конд	в'0037000300040203'
	конд	в'0037000000340100'
ЗЕND	зп	СМ
	мод	И17
	уиа	(М17)
	рж	РК
ЭКВЫХ	сч	СМ
	уиа	'3'
	уи	
	зп	
	уиа	'2003'
	пб	УИИ
A05003	уиа	54(М17)
	пб	Э13
A05004	уиа	53(М17)
	пб	Э13
A05005	уиа	55(М17)
	пб	Э13
A05006	уиа	52(М17)
	пб	Э13
	конд	в'7240477600340100'
A05010	зп	СМ
	ржа	'4'
	по	(М16)
	ржа	'20'
	пе	A05004
	сда	64+1
	зп	РЭ3
	сч	СМ
	вчп	СМ
	зп	РЭ2
	умн	SQ2
	сл	SQ1
	умн	РЭ2
	сл	SQ0
	слпа	64+32
	слп	РЭ3
	зп	РЭ2
	сч	РЭ3
	ржа	'22'
	по	A05024
	сч	РЭ2
	умн	ЭК6
	зп	РЭ2
A05024	сч	СМ
	дел	РЭ2
	сл	РЭ2
	слпа	64-1
	зп	РЭ2
	сч	СМ
	дел	РЭ2
	сл	РЭ2
	слпа	64-1
	пб	(М16)
u5031	знак	СМ
	умн	З1ЧРI
	ржа	'12'
	пе	A05045
A05033	ржа	'3'
	сл	ЭК9
	ржа	'22'
	зп	РЭ2
	счмр	64-40
	зп	РЭ3
	сч	РЭ2
	сда	64+8
	счмр	
	зп	РЭ2
	сч	РЭ3
	ржа	'12'
	пино	A05043(М16)
	вчоб	R05
	пб	A05044
A05043	пе	A05044
	вчоб	ЕХР0
A05044	знак	РЭ2
A05045	слпа	64+1
	зп	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-5(М16)
	сч	SIN6
A05050	умн	РЭ4
	сл	SIN0(М16)
	цикл	A05050(М16)
	умн	РЭ3
A05052	знак	СМ
	пб	ЗЕND
Э18	знак	СМ
	зп	СМ
	умн	З1ЧРI
	уиа	(М16)
	пб	A05033
A05056	сч	СМ
	пв	Э3(М16)
	знак	СМ
	зп	РЭ3
	уиа	E48(М16)
	слпа	64-1
	пе	A05064
	сч	ЕХР0
	дел	РЭ3
	зп	РЭ3
	уиа	ЭК38(М16)
A05064	сч	(М16)
	зп	РЭ2
	сч	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-2(М16)
A05067	сл	QАТАN1(М16)
	умн	РЭ4
	цикл	A05067(М16)
	сл	QАТАN0
	зп	РЭ5
	уиа	-3(М16)
	сч	РАТАN4
A05073	умн	РЭ4
	сл	РАТАN0(М16)
	цикл	A05073(М16)
	дел	РЭ5
	умн	РЭ3
	вч	РЭ2
	вчаб	
	пб	A05052
Э26	зп	РЭ5
	знак	СМ
	зп	РЭ3
	уиа	E48(М16)
	ржа	'10'
	пе	A05105
	вчоб	ЕХР0
	пе	A05006
	слпа	64-1
	пв	A05010(М16)
A05104	зп	РЭ3
	уиа	ЭК38(М16)
A05105	сч	(М16)
	зп	РЭ1
	сч	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-2(М16)
A05110	сл	QАSIN1(М16)
	умн	РЭ4
	цикл	A05110(М16)
	сл	QАSIN0
	зп	РЭ2
	уиа	-2(М16)
	сч	РАSIN3
A05114	умн	РЭ4
	сл	РАSIN0(М16)
	цикл	A05114(М16)
	дел	РЭ2
	умн	РЭ3
	слп	РЭ1
	вч	РЭ1
	вчаб	
	знак	РЭ5
	пб	ЗЕND
Э33	знак	SIN1
	по	A05003
	зп	СМ
	вчп	СМ
	вч	ЭК39
	зп	РЭ3
	сл	ЭК6
	дел	РЭ3
	зп	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-4(М16)
	сч	АLОG5
	ржа	'2'
A05130	умн	РЭ4
	сл	АLОG0(М16)
	цикл	A05130(М16)
	умн	РЭ3
	вч	LN2Ч2
	зп	РЭ5
	сч	СМ
	и	ЭК
	сда	64+7
	нтж	ЭК29
	умн	ЭК7
	сл	РЭ5
	пб	ЗЕND
Э35	умн	З1ЧLN2
	зп	СМ
	вч	Ч63
	по	A05005
	сл	Ч127
	пе	ЗСZЕR0
	сч	СМ
	ржа	'3'
	сл	ЭК9
	зп	РЭ3
	ржа	
	счмр	64-41
	зп	РЭ2
	сч	РЭ3
	сда	64+7
	счмр	
	нтж	E48
	зп	РЭ3
	уиа	-6(М16)
	сч	ЕХР7
A05151	умн	РЭ2
	сл	ЕХР0(М16)
	цикл	A05151(М16)
	зп	РЭ5
	умн	РЭ5
	слп	РЭ3
	пб	ЗЕND
ЗСZЕR0	сч	
	пб	ЗЕND
ПЕЭ52	счи	М16
	зп	И16
	по	КОСИН
	счрж	'77'
	или	П12
	зп	РК
	мод	ГУС
	сч	33
	и	E16
	по	КОСИН
	мода	
	пв	ПЕЭКС(М16)
КОСИН	счи	М16
	сда	64+2
	пе	ЗОВЫ
	уиа	Э18(М16)
	сч	СМ
	пб	Э3
D05167	конд	в'0000777777777777'
D05170	конд	в'0000777777777777'
НЕТНАП	конд	в'7707777777776177'
        пам     4
 ЭКВИВ (ГРВ,Е8),(ГРН,Е6),(ПОДЧ,Е40),(КВНЗАД,Е36),(ПРМЗОН,Е37)
 ЭКВИВ (МГВЫБ,0) - так в ГНУС; в СВС - ячейка
 ЭКВИВ (Д,96),(КЛЕСТ,4),(ОБЩТОМ,57),(ЕЗП,Е7)
 ЭКВИВ (НЗАРХ,Е6),(ШП,78),(ИНФ,77),(ЕКА,Е34)
 ЭКВИВ (МАСГЛ,69),(ШПЭГ,72),(СОБЫТ,62),(ТЕРЕЗА,61),(ЯЧК,40)
 ЭКВИВ (ЕЕСТИО,Е47),(ПЗ,64),(ЧПЗ,47),(МЧПЗ,ЧПЗ-1)
 ЭКВИВ (НПЗ,48-ЧПЗ-1),(ШЗНМБ,41),(ТРВР,14),(ТРВ,8)
 ВХОД ПЗ,МЧПЗ,ЧПЗ,НПЗ,ШЗНМБ,ТРВР,ТРВ
* разные внешние
БОЭК1 ВНЕШ Ф4,АВАРИЯ
БОЭК1 ВНЕШ АВДРУГ,ВЫЗОВ,ПРОВЛ,ПЛВОЗУ,ПЕЭКС,КИПР,ЭКВЛ
ВИСП ВНЕШ ВШГ,ИЗШГ,ВШГП,ИЗШГП
ВЗУ ВНЕШ Э1,ЗОВЫ,УИИ,A07034,ЗАПЭКС,A06742,A07001,A05570
ВЗУ ВНЕШ A07011,ВЫЗКЧ,ST7007,A07067,A07043,СБОЙБ,ЭККВМ
ВЗУ ВНЕШ ЭКС75,ЭКП,ЗОВИ,ПРХЭ67,ГОША,АЦПУ,ТУМБР
МОТТ ВНЕШ ШКАС,ШVD130,ДШКОПТ,ШЗНКТ,ШЗПРИМ,Е77221,МОТТ,QQ1
МОТТ ВНЕШ A76600,D76735
ДИСКИ ВНЕШ ДИСКИ,U73725,A74014,ПРЗАХВ,ВХ220,ИПЗРЭ
ДМЛМБ ВНЕШ A64770,ОБЩМГ
КАЧКА ВНЕШ ШКРЗ,Е48П17,КАЧКА,ПОДНОС
КИТ ВНЕШ ИПЗ56,ИПЗ57
ХЛАМ ВНЕШ Э62,Э63,Э66,Э70,Э71,ИПЗ54,ИПЗ55
ХЛАМ ВНЕШ A66470,A67523,A66510,A67272,A67447,УПРИ
СОСТАВ ВНЕШ ТОП
ФИЗОБМ  НОП
* входные
 ВХОД НЗАРХ,ШП,ИНФ,ВИСП15,П17777,ОССТБД,КВЭ600,КЛИН
 ВХОД ОАС,ВРЕЗП,ТВ206А,КЛЮЧ,A04461,ВРЗАПР,ВРЕМЯ,Д,ТВ205
 ВХОД БМВ,ЭКВЫХ,D03453,СИГН,ТВ40,A04750,D03014,Е47П33
 ВХОД D01142,ССЫЛКА,П7,РЯО1,РЕЖРАЗ,РАЗМГ,ТУС,Е44П41
 ВХОД ГАШРП1,ШКМДП,D02320,D01530,A03664,ИВ25,СТ175
 ВХОД АСБОЙБ,Е37Е36,D03233,БЯК,Е42П1,ТЗНМД,РСЧРАЗ
 ВХОД П27,D02006,A03605,НМБТР,D02014,МИН17,ТВ67А
 ВХОД ШЗРАЗМ,D02657,БПУ,ЗАПВЕТ,D00342,D00350,МИН15
 ВХОД П12,A03601,A04325,КРОМЕ,РТЛ,D03232,П14,МАСГЛ,ШПЭГ
 ВХОД D01332,УПОК,D02074,ШЗЗ,D05167,D05170,СТМГ,СОБЫТ
 ВХОД НЕТНАП,Е47П1,ЗАПРК,П32,ЧОМБМЛ,A04763,A04371,ТЕРЕЗА
 ВХОД ТСЛ,Е6П4,ЭК38,ЭК30,УЧКОН,ШКЗЗ,Е48П25,ВКАНАЛ,ТАС
 ВХОД СМ,РК,ГУС,Е48П43,СЧЗКМБ,НЗАД,ПРЕДЕЛ,Е48Е47,ШРНОМБ
 ВХОД П17,И16,ШЗЗПСЧ,ШЗПОМБ,П13,ТМБ,ШГ,ИПОБМ,БИЗОН1
 ВХОД ГОД,СЧПР1,Р,R,A04177,РАБШК,СПНОМ,ВИСП16,Е41П1
 ВХОД Е24П16,ИНФМБ,П377,ИНФСЛЭ,П177,Е15П1,Е46Е45,Е24П1
 ВХОД УСМ,УСММБ,П777,П3777,П1777,РЯО,Е33П25,ОЧКУС,МШГП
 ВХОД ВСЕЕД,Е15П11,Е15П2,Е18Е17,D01425,РЭ2,РЭ3,ИЗ10В8
 ВХОД Е18П1,Е21Е1,Е21Е18,Е26Е25,Е46П48,Е47П43,ЕСЧ,A04510
 ВХОД ЗОНАМЛ,ЗОНАТР,ЗОЧ1Б,И15,И17,И20,МГРП,U3701,УСТПРП
 ВХОД КЛЮЧРЗ,КУС2,ЛИСТА,МБКУС,МГНЕИС,МПРЛ,МШГ,НАПРМГ
 ВХОД ОЧКСУМ,ОЧКУСД,ОЧМБ,П140,П2007,П23,П3,П30,ОСПОД
 ВХОД П37,П5,П6,П60,П77,П7777,ПРИП,РМЛ,Е16П32,ВСЕ6,Е40П1
 ВХОД РМР,РЭ1,РЯО5,СМШГП,СЧЗАК,ТРАЗМ,ТУСП,УКАЧАЙ,КНАПР
 ВХОД УКАЧП,ФКУС,ФКУСА,ФКУСАБ,ФКУСАД,ФКУСД,ФКУСМБ,Ш1,ШАРБОП
 ВХОД ШАРКЗ,ШАРСИС,ШГП,ШЗЗОБМ,ШЗПОМД,ШКИВ,ШКМБ,ШКМД,ШКМЛ
 ВХОД ШКОМБ,ШКОМД,ШКОМЛ,ШКОТ,ШКОШ,ШМАРС,ШОПТИМ,ЯЛИСМБ
 ВХОД A04540,ГАШЗАН,БВЗ,ЗАХЗАН,D03116,РОДОН,ШКОБМ,РАБ600
 ВХОД Е48П16,ШКПРЕ,ЭК9,ШКОДП,НОММЛ1,ШКЗАКЗ,ШКЗАКС,ЗАНПРП
 ВХОД РМД,Е43Е42,Е44Е43,МД29М,Е44П42,Е34П25,Е48П37,Е39П25
 ВХОД ПОДЧ,КВНЗАД,ПРМЗОН,МГВЫБ,ОТВКАЧ,КДД,ЗАНОСМ,О29П17
 ВХОД ЯЧРЖПЛ,НРЕ,ТМД,ИПЗЖТ,ШКСВН,ВРМАТ,МД5,ОЗУ,КДВ
 ВХОД ТОБ,РЯОМБ,НОММБ2,НОММЛ3,ШЗНМБО,СТЗОН,ЧПОД,ГРВ,ГРН
 ВХОД ШОЧМГ,ШОЧНАП,КМИН,ТЗОНМЛ,ГРУП,NБЛ,УЧЕТРВ,РМЛ1,РМД1
 ВХОД ШКОК,ШКСВМ,РЯПСЗ,ЗУК,ЗАНЯТА,ШИФРАЦ,НОММБ,НОММБ1,ТЗНМЛ
 ВХОД ЖИЗОС,ТЗФСТР,НОММЛ,ПОТЕРИ,МПРП,ШКПЛАН,ЗОЧ2,ШКЗЗП,СКЛАД
 ВХОД ШКНАЧ,ЯКУС,ЯКУСМБ,РЯО3,ЯМ16,ОКДВИЖ,ОШМЛ,ТВР1,ШКЗАН
 ВХОД СОЛ,ЯМ15,БОБ,ИПЗМЛ,Т,ШЗН,РШЗН,РШКИВ,КУС1Б,ШИФРПЛ,РОСППМ
 ВХОД ФИЗ,РЭ4,РЭ5,РЭ6,РЭ7,ЛЕСТ,ШККЗ,ТРР,ТРР1,ТАЙМЕР,НБТ
 ВХОД ЭКБУД,ОПТИМ,БУДГДР,СМШГ,Ш2,Ш3,ШЗАПОС,Е31П17,КОК,ЗАКЛИ
 ВХОД ШЗАВЕТ,УПРЯТ,ШКВОС,ОЧЛИС,ОЧЛИСД,ЛИС2,ЯЛИС,МБЛИС,ЛИС1Б
 ВХОД ЗОНВЫ,ИВ,ДУК,ШЗУПР,ЭТУПР,БУДУПР,SSЕСТЬ,ШЗБУДС,ШЗБУДП
 ВХОД ШКДТ,ШКДТП,ШКЗЗК,ШКОГ,ВИГ11,ШКАП,МПЗ,МТЗ,РТР,МИН,ШКЗЛ
 ВХОД ПАК,ЕДК10Р,РЯР,СЧПР2,УХО,СКБЭ,П14037,ШКМГОС,О46П31,ТИВ
 ВХОД U4115,ТВ201,A03640,ТБУФ,ТАБЛО,ЗНМ,АЗУ,КСД1,РЗ,РЗ1
 ВХОД Е36П25,ПЕРЕВ,ГАШПРП,Е10П3,Е12Е11,ТАБТИП,АВРАСП,Н19
 ВХОД БУДГРА,ГРАФАЛ,ГРАСИ,ЯЧК,ЕКА,ВРЕСОБ,ВИСП3,ОБЩТОМ,МЛЕС
 ВХОД КВАНТ,ЭК74,Е18Е11,ШКАЛА8,ШКОД,ШКПЛАВ,ШКНП,ШКНПП,ШКЧТЕН
 ВХОД КУСНН,ИВ34,ЛИСТЫ,ИВ23,П50,ЕЗП,П60П44,АВОСТА,Е18П16
	ФИНИШ
КВЧ$$$
ТРН$$$
ЧТКОМП420070
1-1
БТМАЛФ
ЗОНМОД430000  0007
КНЦ$$$
*end file
``````
ЕКОНЕЦ
