ДИСП70	СТАРТ	'10'
	М
*
	ГБЛВ ∧К71
∧К71 УСТВ 1
*
	пам	56 !СЛУЖЕБНЫЕ СЛОВА МБ/МЛ/МД
* По каждому направлению 10 слов(8).
* ключ - cм. ДИСП70.КЛЮЧ, дата записи/чтения.
*
КСД1	конд	в'6200000000000000'
ячобмл	конд	в'5400000000000000'
	конд	в'4600000000000000'
	ОПРЕ
ВСЕЕД	конд	в'7777777777777777'
П3777	конд	в'3777'
ЕДК10Р	конд	в'7777777777775777'
П77777	конд	в'0000000000077777'
Е44П41	конд	м39в'36'
Е15П2	конд	в'0000000000077776'
ММБН	конд	в'0000000700001774'
П77	конд	в'77'
ГРП15	сч	ГУС
	и	E48
	уиа	1(М16)
	пе	КОНКОМ
СТ175	сч	РЭ4
	пб	СТ175
Е10П3	конд	в'1774'
СТЗОН	пам	1
Е39П25	конд	в'0007777700000000'
ЭК6	конд	в'4053240474631772'
ЭК7	конд	в'4013056205773722'
ЭК9	конд	в'6400000000000000'
ЭК30	конд	в'3710020040100200'
	конд	в'3750121665473765'
	конд	в'3754447754271641'
	конд	в'4010564316505161'
	конд	в'4013414226101541'
	конд	в'4016700574602710'
ЭК38	конд	в'4054441766521041'
ЭК39	конд	в'4013240474631772'
ЭК	конд	в'7740000000000000'
ЭК29	конд	в'4320000000000000'
К2003	конд	в'2003'
П13	конд	в'13'
Е46П48	конд	в'7000000000000000'
ГОД	пам	1
Е18П16	конд	в'0000000000700000'
ЗИМ	конд	в'7700000000770000'
Е12Е11	конд	м9в'6'
Е48П37	конд	в'7777000000000000'
Е36П25	конд	в'0000777700000000'
Е24П13	конд	в'0000000077770000'
П7777	конд	в'0000000000007777'
П1777	конд	в'0000000000001777'
АПСЧБ	конд	в'0006443600000000'
ШКОК	конд	в'7777777777777777'
НАПРМГ	конд	в'0070000000001600'
Е21Е18	конд	в'0000000004400000'
	конд	в'3751111237723571'
	конд	в'3754631462347002'
	конд	в'4012525252526041'
	конд	в'4057777777777770'
Ч63	конд	в'4317600000000000'
Ч127	конд	в'4357700000000000'
ЭК46	конд	в'2713457536132666'
Ч1Д	конд	в'4050000000000000'
SQ2	конд	в'3722726016750030'
SQ1	конд	в'4016174360527114'
SQ0	конд	в'3752021367076726'
З1ЧРI	конд	в'3752137140667117'
R05	конд	в'4010000000000000'
SIN6	конд	в'2416516615135220'
SIN5	конд	в'2720726406013034'
SIN4	конд	в'3212407337647661'
SIN3	конд	в'3466322646644717'
SIN2	конд	в'3652146570633344'
SIN1	конд	в'4025524206147334'
SIN0	конд	в'4054441766521041'
РАТАN4	конд	в'3710712237733234'
РАТАN3	конд	в'4157070620065256'
РАТАN2	конд	в'4315676761443655'
РАТАN1	конд	в'4356666234335452'
РАТАN0	конд	в'4351263371314703'
QАТАN3	конд	в'4251370534014651'
QАТАN2	конд	в'4353035273613334'
QАТАN1	конд	в'4410771042346022'
QАТАN0	конд	в'4351263371314705'
РАSIN3	конд	в'4262067767311156'
РАSIN2	конд	в'4417116703564207'
РАSIN1	конд	в'4527510513075667'
РАSIN0	конд	в'4452405406731770'
QАSIN3	конд	в'4323163553476645'
QАSIN2	конд	в'4451673607622544'
QАSIN1	конд	в'4526610137701013'
QАSIN0	конд	в'4452405406731770'
LN2Ч2	конд	в'3753056205773721'
АLОG5	конд	в'3714502240420440'
alog4	конд	в'3716136565743216'
	конд	в'3751111240046421'
	конд	в'3754631462345725'
	конд	в'4012525252526026'
АLОG0	конд	в'4110000000000000'
З1ЧLN2	конд	в'4053425216624534'
ЕХР7	конд	в'3051400777605675'
exp6	конд	в'3211740671257531'
	конд	в'3352734560343024'
	конд	в'3511662430023033'
	конд	в'3616153023515710'
	конд	в'3717277573756445'
	конд	в'4013056205774000'
ЕХР0	конд	в'4050000000000000'
ПАК	пам	1
*ШКСВМ-МЕСТО НЕРЕЗ Е48 - 0 АБЗ. ОЛ., Е47 - 1, АБЗ. ОЛ., Е46 - 2
*АБЗ. ОЛ. ...
ШКСВМ	конд	в'0000001760000000'
Е18Е11	конд	п'000240'
ЯЧВ1	конд	п'100100'
R	конд	в'4000000000000012'	ДЛЯ ПЕРЕВ. 8-10
КМБТТ	конд	в'0040000001401777'
РМЛ	конд	в'7600000000000000'
РМД	конд	в'0000000077777777'
	пам	1
РМЛ1	конд	в'7777777777777777'
РМД1	конд	в'0000037777777777'
	конд	в'0000037777777777'
ИПОБМ	пам	1
	конд	п'600000'
	пам	1
	пам	1
	конд	в'0006443600000000'
	конд	в'0000000201302007'
	пам	3
шк14	пам	14
	конд	в'4000000000000000'
УХО	пам	1
ШКЗЗ	пам	1
КМИН	конд	п'00000 '
П14	конд	в'14'
П6	конд	в'6'
РЯР	пам	1
П5	конд	в'5'
	пам	2
	конд	в'4000000000000000'
СЧПР1	пам	1
СЧПР2	пам	2
КЛЮЧРЗ	конд	п'КЛЮЧРЗ'
Р	пам	1
ЧПОД	пам	1
ЛИСТА	конд	в'0000000000370000'
ИПЗЖТ	пам	1
	конд	п'600000'
	пам	1
	конд	A(БЖТ)		М33
	пам	1
	конд	в'0000000200700007'
	пам	5
	конд	в'0000000000010216'
	конд	в'0000000000030602'
	конд	в'0000000000010204'
	конд	в'0000000000010210'
	пам	1
	конд	в'0000000000052345'
	конд	в'0000000000034242'
	конд	в'0000000000052764'
П2007	конд	в'2007'
	пам	2
П17	конд	в'17'
К2013	конд	в'2013'
РЯПСЗ	конд	п'00000D'
ЗУК	пам	1		ЗАДАЧИ ЗАКРЫТЫЕ УКАЧКОЙ
ЗАНЯТА	пам	1
ШКЗАКЗ	пам	1
ШГ	пам	1
ШГП	пам	1
ШКСВН	конд	в'0000406020000024'
ТР13	пам	1
П23	конд	в'0000000000000023'	ПО
е48нрт	конд	в'4000000000000000'
РАЗМГ	пам	1
	пам	1
	пам	1
РЕЖРАЗ	пам	1
РСЧРАЗ	пам	1
ТРАЗМ	пам	1
ЗТРАЗМ	пам	1
ВКАНАЛ	пам	1
Е16Е17	конд	в'0000000000300000'	ДЛЯ МЛ
Е47П43	конд	в'3700000000000000'
Е15П11	конд	в'0000000000076000'
НОМАРС	пам	2
МГНЕИС	пам	1		ДЛЯ НЕИСПРАВНЫХ МГ 48-40РР.
Е44П42	конд	п'.00000'
Е44Е43	конд	п'/00000'
Е7Е21	конд	в'0000000004000100'
	конд	в'0000000077760000'
ГУС	конд	п'000018'
ШКЗАКС	пам	1
МОНИТ	конд	в'0000000077740000'
каска	конд	в'6306000000000000'
START	зп	СМ	*С ЭТО 500 ЯЧ-КА ВНУТРЕННЕЕ ПРЕРЫВ.
	пб	внупр
внешпр	зп	СМ	*С ЭТО 501 ЯЧ-КА ВНЕШНЕЕ ПРЕРЫВ.
	пб	ОБВНПР
ЕСЧ	конд	в'0001000000000000'
	конд	п'001000'
	конд	в'0000000000010000'
	конд	в'1'
Е18П1	конд	в'0000000000777777'
Е24П16	конд	в'0000000077700000'
Е21Е1	конд	в'0000000004000001'
Е26Е25	конд	п'003000'		НЕЛЬЗЯ ПЕРЕНОСИТЬ
Е16П32	конд	в'0000037777700000'	
П3	конд	п'000003'	НЕЛЬЗЯ ПЕРЕНОСИТЬ ОТ СЧЕТ
Е40П1	конд	в'0017777777777777'
П37	конд	в'0000000000000037'
П777	конд	в'0000000000000777'
Е34П25	конд	в'0000177700000000'
	конд	в'0000777700000000'	НЕ РАЗДЕЛЯТЬ
Е48П43	конд	в'7700000000000000'
Е33П25	конд	в'0000077700000000'
	пам	1			ВМЕСТЕ С КНАПР
КНАПР	конд	в'10'
П20	конд	в'20'
П30	конд	в'30'
П40	конд	в'40'
П50	конд	в'50'
П60	конд	в'60'
Е6П4 КОНД В’70’
ЖИЗОС КОНД В’0’		?РАБОТЫ ДЛЯ ПО МБ
ШКМГОС КОНД В’0’          ШКАЛА МГ ОС
КСД3 КОНД М41В’34’
 КОНД М41В’50’
 КОНД М41В’64’
 КОНД М41В’100’
Е48Е47 КОНД М46В’3’
Е46Е45 КОНД М44В’3’
ШИФРПЛ КОНД В’0’
П140 КОНД В’140’
П177 КОНД В’177’
П377 КОНД В’377’
П12	конд	в'12'
Э	зп	СМ	*С Э50
	пб	Э1  !В ВЗУ
*
	зп	СМ
	пио	Я(М16) *С СИНУС Э51 М16 <> 0
*
э52к71	зп	СМ
*
	АПУ     (&К71).ДА
	пб 	пеэ52
	АПБ	.НЕТ
*
.ДА АНОП
	пб	Э52777 ХОЛ. СТАРТ ДКС: НЕТ РАБ. ПО УМОЛЧ.
.НЕТ АНОП
*
	зп	СМ !КАК ПОПАДАЕМ СЮДА?
	пб	ВЕТКА
	уиа	Э26(М16)	*С АРКСИНУС Э54
	пб	Э3
	уиа	Э33(М16)	*С ЛОГАРИФМ Э55
	пб	Э3
	уиа	Э35(М16)	*С ЭКСПОНЕНТА Э56
	пб	Э3
	зп	СМ		*? С ЦЕЛАЯ ЧАСТЬ Э57
	пб	ЭК57
	счи	М16	Э60
	пб	Э60
	счрж	'37'		*С ТУМБЛЕРНЫЕ РЕГИСТРЫ Э61
	пб	ТУМБР
	зп	СМ
	пб	Э62
	зп	СМ		*С Э63
	пб	Э63
	счи	М16
	пб	АЦПУ
	зп	СМ
	пб	ГОША
	зп	СМ
	пб	Э66
	зп	СМ
	пб	ПРХЭ67
	зп	СМ
	пб	Э70
	счи	М16
	пб	Э71
	зп	СМ Э72
	пб	ЗОВИ
Э73	зп	СМ
	пб	ЭКВВД
Э74	зп	СМ	*С Э74 "КОНЕЦ ЗАДАЧИ"
	пб	ЭКП
Э75	уиа	'2000'  *С Э75 "ЗАПИСЬ КОМАНДЫ"
	пб	ЭКС75
Э76	счи	М13 на СВС ЗП СМ
	зп	СМ на СВС ПБ ЭКМУЛЬ
Э77	зп	СМ
	пб	ЭККВМ
ШИФРАЦ	конд	п'00000D'
РПР	пам	1
ПОТЕРИ	пам	1
НОММБ	пам	1 	МБИНФ
НОММБ1	пам	1	МБПРОГ
НОММЛ	пам	1	СТА-КА
НОММЛ1	пам	1	ВВОД
НОММЛ2	ноп
НОММЛ3	пам	1	ВЫВОД
ЛЕНТА	конд	п'0000/D'
ШКПЛАН	конд	п'00000D'
ИНФСЛЭ	пам	1
ИНФМБ	пам	1	ОТ ИНФСЛЭ НЕ ОТДЕЛЯТЬ
РЯО	пам	1
РЯОМБ	пам	1	ОТ РЯО НЕ ОТДЕЛЯТЬ
СЧЗАК	пам	1
СЧЗКМБ	пам	1
ФКУС	пам	1
ФКУСМБ	пам	1	ОТ ФКУС НЕ ОТДЕЛЯТЬ
ФКУСД	пам	1
ТЗНМЛ	пам	32
ТЗНМД	пам	64
ТЗОНМЛ	пам	13
ТБЗН	пам	19
УСМ	пам	1
УСММБ	пам	1	ОТ УСМ НЕ ОТДЕЛЯТЬ
ОС1417	пам	1
УКАЧАЙ	пам	1
УКАЧП	пам	1
ТЗФСТР	конд	в'7770000000000000' ТАБЛИЦА ЗАНЯТОСТИ ОП-1
	пам	15	ОЗУ 2-4
ШЗНМБО	пам	48
ТМБ	пам	1
ТМД	пам	1
ОЗУ	пам	1
ТОБ	пам	1
СЧК	конд	п'000100'
М16В3	конд	п'000300'
	конд	в'0000000000014000'
МД5	пам	1
ТАБОШ	пам	1
РЯВВ1	пам	1
ряо2	пам	6
БОБСВЗ	пам	1
КСВЗ	конд	в'7770000000000000' КОНСТАНТЫ СВЯЗИ НЕ РАЗД.
	конд	в'0007770000000000'
	конд	в'0000007770000000'
	конд	в'0000000007770000'
РАБШК	пам	1
ШККАН   пам     5
П7	конд	п'000007'
МПРП	пам	1
НРЕ	пам	1
П32	конд	в'0000000000000032'
	конд	в'0070000000001777' МБТРС
ССЫЛКА	конд	в'0000174000000000'
НСТПРП	пам	1
ВРЗАПР	конд	М7В'1' НА ПОЛЬЗОВАТЕЛЯ
ВРМАТ	пам	1
АЗУ     пам     2	АЗУ: 1-12РР.:УСТАНОВ. МЛ.
*			13-24РР. ЗАХОДЫ
*			25-48РР.: СТРОКИ АЦПУ
*			АЗУ+1:1-9РР. ПК ПИ
*			10-24РР.: ОПК ПЛ /\ 20
*			25-36РР.: ПК УВВК
*			37-48: ПК ФСМ. 1 ПК ФСМ = 120 СИМВ.
ВРЕМЯР  пам     1
ОЧКУС	пам	16
ОЧКСУМ	пам	16
МБКУС	пам	16
ОЧМБ	конд	в'7777740000000000'
ШОЧНАП	пам	4	ЯЧ. ШОЧНАП-ШКНАЧ НЕ РАЗДЕЛЯТЬ
ШОЧМГ	пам	32
ЗОЧ2	пам	2
ШКЗЗП	пам	2
СКЛАД	пам	1
ШКНАЧ	пам	1
ВЫМГ	пам	3	НЕ РАЗД. С ШОЧМГ
ЗОЧ1Б	пам	1	МЕСТО ЗАК В ОЧ.К МБ ДО ВЫДАЧИ В УВУ
*			ОБРАБ ПРЕРЫВАНИЯ ОТ ДАННОГО НАПР.
*			ПОСЛЕ ПРЕРЫВ. ПО ОКОНЧ. ОБМ. С НАПР.
неисп	пам	2	!МГЗ?
ЯКУС	пам	1
ЯКУСМБ	пам	1	ОТ ЯКУС НЕ ОТДЕЛЯТЬ
ЯМ16	пам	1
ШЗЗПСЧ	пам	1
ШСЗПСЧ	пам	1
ВРЕМЯ	пам	1
РЯО3	пам	1
К	конд	в'0010020040100200'
ОКДВИЖ	пам	1
РЯО5	пам	1
ОШМЛ	пам	1
ТВР1	пам	2	ИСП. В БЛОКЕ БВ31
ШКЗАН	пам	1
шкзан1	пам	1
ОСПОД	пам	6	ОСТАН. ПОДЧ. ЗАДАЧИ
	конд	в'0000000201300007'
	пам	18
КЛЮЧ	конд	в'0007070700000000' зп. в общее полее
ВСЕ6	конд	в'6666666666666666'
Е43Е42	конд	п'600000'
ВРЕЗП	конд	п'F00000'
Е48П16	конд	в'7777777777700000'
Е48П9	конд	в'7777777777777400'
Е48Е37	конд	в'7777000000000000' чтобы не совпадало
ШКНТ	конд	в'7777777777777777'
РОЙ	пам	1	48-45РР. CONSUL
бве48	конд	в'4000000000000000' !ИСП В БВЗ32
Е35П31	конд	в'0000370000000000'
Р3	пам	1
Р4	пам	1
Р1	пам	1
б	пам	7
НОММБ2	пам	2	N НАПР., N МБ, N ТРАКТА ДЛЯ "УХО"
ШКАРУ   пам     1
РЯО1	пам	3
ЗОНАТР	пам	1
ЗОНАМЛ	пам	1
СОЛ	пам	4
МПРЛ	пам	1
ЯМ15	пам	1
БОБ	пам	1
МШГ	конд	в'7777777777777777'
МГРП	конд	в'0011024000301017'
	конд	в'0000000000000034'
ПОДПРГ	конд	в'0000000036374000' ЕДИНИЦЫ 12-17РР., 20-23РР.
ГАШРП1	конд	в'7777777701403000'
СПR     конд    в'0'
естьс  КОНД    В’0’
символ  КОНД    В’0’
симво1  КОНД    (24)В’0’
тслк71  КОНД    (2)В’0’
факел  КОНД    В’0’
шкпре1  КОНД    В’0’
тблк71  КОНД    (2)В’0’
СПНОМ   экв     '57740' !ТАК И ДОЛЖНО БЫТЬ?
        входн   СПНОМ
КСП	конд	А(СП)
СП      экв     32     число СП
СТРЕЛ	пам	1
ШКПЛАВ	конд	в'0000001407014734'
*32*28**27*21*20*19*13*12*9*8*7
ШПРИК	пам	1
ШКПУСК  конд    в'0'
ШКОД	конд	п'000В80'
ЯЧКЧ	пам	1
СТМГ    пам     32
СТМД    пам     64
СБМГМД  пам     32
ОБРМБ   КОНД    (6)В’0’ в СВС (8)
СТУСТР  КОНД    (10)В’0’
СБОИМБ  КОНД    (16)В’0’
ОАС	пам	1
ENR	конд	в'0000370000001777'
АСБОЙБ	конд	A(СБОЙБ)
НМБТР	конд	в'0070000000001774'
СУММА	пам	3
	конд	в'0007740000000400'
	конд	в'0000037600000002'
ТАБЛО	пам	1
ИПЗМЛ	пам	1
	конд	п'600000'
	пам	1
ипзмл3	пам	1
	конк	А(ПРЛСЧБ)
	конк	в'0'
	конд	в'0000000201302007'
	пам	2
дляди1	пам	1
ипзмл9	пам	15
ПРИП	конд	в'0421042000000037'
припа	конд	в'1042104000001740'
	конд	в'2104210000076000'
	конд	в'4210420003700000'
	конд	в'0000001740370000'
ПРЕДЕЛ	пам	1
Ш1М	пам	3
	конд	в'4000000000000000'
ШКОТ	пам	2
Е46П25	конд	в'1777777700000000'
Ч01Д	конд	в'4001463146314632' ЧИСЛО "0.1"
МИНУТА	конд	в'0000000000005670'
ШКАЛА8	КОНД    М35В’1’В’102040’
Э28	пам	1
КРОМЕ	конд	в'7777777740077777'
о28511	конд	в'7777776077775777'
ТР3	КОНД	В’0’
ТР4	КОНД	В’0’
ТР5	КОНД	В’0’
ТУМБ6	КОНД	В’0’
ТР7	КОНД	В’0’
ЗАХВМЛ	КОНД	В’0’
МИН15	конд	в'3777777777777763'
МИН17	конд	в'3777777777777761'
СМЕЩ	пам	1
ЯЧКЧМБ	пам	1
МСК	конд	п'00    '
Е35П24	КОНД	М23В’7777’
ШРЕС	пам	1	ШРЕС И ШЗРАЗМ НЕ РАЗДЕЛЯТЬ
ШЗРАЗМ	пам	1
шзраз1	пам	1
ШЗН	пам	1
шзн1	пам	1
ШКИВ	пам	1
РШЗН	пам	2
РШКИВ	пам	1
КУС1Б	пам	3
КСУМ1Б	пам	3
КУС2	пам	6
ФИЗ	пам	3
        КОНД А(ИПЗЖТ)      ЗАДАЧА ЖДУ
ТУС КОНД М41В’1’   Е48-УКАЧКА
 КОНД М41В’2’      Е47-ПЕЧАТЬ
 КОНК М17В’03’     Е46-ДИНАМО
 КОНК А(0)
 КОНК М17В’4’      Е45-МОНТЕР
 КОНК А(МОТТ)
 КОНК М17В’5’     Е44-ДИСКИ
 КОНК А(ДИСКИ)
 КОНК М17В’6’     Е43-ВИСП
 КОНК А(ИВ)
 КОНК М17В’7’     Е42-ДМЛМБ(МБ)
 КОНК А(ИПОБМ)
 КОНД М41В’10’    Е41-Э64
 КОНД М41В’11’    Е40-РОБОТ
 КОНК М17В’12’    Е39-ДМЛМБ(МЛ)
 КОНК А(ИПЗМЛ)
 КОНК М17В’13’    Е38-КАЧКА
 КОНК А(КАЧКА)
 КОНД М41В’14’    Е37-ТРУБКА
* ПОД Е36 РАБОТАЮТ: РЕД.ВВОДА-Е10, КЗ-Е6, БОП-Е11, УПРЯЧЬ-Е16
 КОНД М41В’15’     Е36-ПЛАН
 КОНД М41В’16’     Е35-ПРОЦЕС
 КОНД М41В’17’     Е34-ПУЧКАЧ
 КОНД М41В’20’     Е33-АВРАСП
 КОНД М41В’21’     Е32-ЭКВВОД
 КОНД М41В’22’     Е31-РЕСУРС
 КОНК М17В’23’     Е30-РЕЗОТ
 КОНК А(0)
 КОНД М41В’24’     Е29-ВВОД(В1К)
 КОНД М41В’25’     Е28-СПЭ66
 КОНК М17В’26’     Е27-РЕЗ.ЭК-КОДЫ
 КОНК А(ИПЗРЭ)
 КОНД М41В’27’     Е26-НОМБОБ
 КОНД М41В’30’     Е25-ПРИКАЗ
 КОНК М17В’31’     Е24-НЕРОТ !ДИСП70-93 ВЫДАЧА В АС
 КОНК А('40000')
 КОНД М41В’32’     Е23-ВЫВОД ТТ
 КОНД М41В’33’     Е22-ПЛ
 КОНД М41В’34’     Е21-Э60
 КОНД М41В’35’     Е20-РПИПЛ
 КОНК М17В’36’     Е19-ВЫДАЧА НА ЕС 7920
 КОНК А(0)
 КОНД М41В’37’     Е18-ЕСПИ80
 КОНД М41В’40’     Е17
 КОНД М41В’41’     Е16-УПРЯЧЬ
 КОНД М41В’42’     Е15
 КОНД М41В’43’     Е14
 КОНД М41В’44’     Е13
 КОНД М41В’45’     Е12
 КОНД М41В’46’     Е11-БОП
 КОНД М41В’47’     Е10-ЭТК71
 КОНД М41В’50’     Е9 -ОТЛАДЧИК
 КОНД М41В’51’     Е8 -Э67
 КОНД М41В’52’     Е7 -КЧ
 КОНД М41В’53’     Е6 -КЗ
 КОНД М41В’54’     Е5
 КОНД М41В’55’     Е4 -СБОЙВУ
 КОНД М41В’56’     Е3
 КОНД М41В’57’     Е2
МШГП	конд	в'7777777777777777'
мбвз	конд	в'3040000000001360'
РЭ1 ПАМ 1
РЭ2 ПАМ 1
РЭ3 ПАМ 1
РЭ4 ПАМ 1
РЭ5 ПАМ 1
РЭ6 ПАМ 1
РЭ7 ПАМ 1
СМ ПАМ 1
РК ПАМ 1
РМР ПАМ 1
И15 ПАМ 1
И16 ПАМ 1
И17 ПАМ 1
И20 ПАМ 1
НЗАД ПАМ 1  номер задачи: супервизора,
* ДИСПАКА, пользователя
*48-17рр. - 
*16-1рр. - номер задачи.
ТУСП НОП 0
 КОНД М41В'101'
 КОНД М41В'102'
 КОНД М41В'103'
 КОНД М41В'104'
 КОНД М41В'105'
 КОНД М41В'106'
 КОНД М41В'107'
 КОНД М41В'110'
 КОНД М41В'111'
 КОНД М41В'112'
 КОНД М41В'113'
 КОНД М41В'114'
 КОНД М41В'115'
 КОНД М41В'116'
 КОНД М41В'117'
 КОНД М41В'120'
 КОНД М41В'121'
 КОНД М41В'122'
 КОНД М41В'123'
 КОНД М41В'124'
 КОНД М41В'125'
 КОНД М41В'126'
 КОНД М41В'127'
 КОНД М41В'130'
 КОНД М41В'131'
 КОНД М41В'132'
 КОНД М41В'133'
 КОНД М41В'134'
 КОНД М41В'135'
 КОНД М41В'136'
 КОНД М41В'137'
 КОНК М17В'140' 	К20 - Е17
 КОНК А(ИПЗМ)
 КОНК М17В'141'		К17 - Е16
 КОНК А(ИПЗМ+ДЛИН)
 КОНК М17В'142'		К16 - Е15
 КОНК А(ИПЗМ+2*ДЛИН)
 КОНК М17В'143'		К15 - Е14
 КОНК А(ИПЗМ+3*ДЛИН)
 КОНК М17В'144'		К14 - Е13
 КОНК А(ИПЗМ+4*ДЛИН)
 КОНК М17В'145'		К13 - Е12
 КОНК А(ИПЗМ+5*ДЛИН)
 КОНК М17В'146'		К12 - Е11
 КОНК А(ИПЗМ+6*ДЛИН)
 КОНК М17В'147'		К11 - Е10
 КОНК А(ИПЗМ+7*ДЛИН)
 КОНК М17В'150'		К10 - Е9
 КОНК А(ИПЗМ+8*ДЛИН)
 КОНК М17В'151'		К7 - Е8
 КОНК А(ИПЗМ+9*ДЛИН)
 КОНК М17В'152'		К6 - Е7
 КОНК А(ИПЗМ+10*ДЛИН)
 КОНК М17В'153'		К5 - Е6
 КОНК А(ИПЗМ+11*ДЛИН)
 КОНК М17В'154'		К4 - Е5
 КОНК A(ИПЗ54)
 КОНК М17В'155'		К3 - Е4
 КОНК A(ИПЗ55)
 КОНК М17В'156' 	К2 - Е3
 КОНК A(ИПЗ56)
 КОНК М17В'157' 	К1 - Е2
 КОНК A(ИПЗ57)
 КОНК М17В'160'		ФИК. ЗАД. - Е1
 КОНК А(ИПЗМ+'1644') на '50' меньше чем ипзм+12*длин
        эквив   (ИПЗМ,'56000')
МПЗ	конд	п'000002'
	конд	п'000006'
	конд	п'00000Э'
	конд	A(E3)
	конд	в'7777777777777600'
МТЗ	конд	в'7777777777777600'
	конд	в'7777777777777600'
	конд	в'7777777777777600'
ЯЧРЖПЛ	конд	в'0003600340002417'
	конд	п'000048'
	пам	1
	конд	в'7777777777777777'
ГРУП	пам	9
ЛЕСТ	пам	1
неисп2	пам	1
шввер1	пам	1
швверх	пам	1
КВНСДВ	конд	в'2340000000000000'
КВАНТ	пам	1
ДГРУП	пам	1
СМШГП	конд	в'7777777777777777'
ШККЗ	пам	1
Т	пам	1
РТЛ	конд	в'0000000034000041'
Е37Е36	конд	в'0001400000000000'
ИСЛОБМ	пам	1
ТРР	конд	в'0000000000010000'
	пам	1
ТРР1	пам	14
ТСЛ	пам	48
ТАС	конд	в'0000000000040600'
*В СВС ПУСТ. ЯЧ. А ЗДЕСЬ ПОСТ. ЗНАЧ. ?
	пам	127 !НЕ РАЗРЫВАТЬ
ШЗЗ	пам	1
КУСЛСВ  пам     1
Е48П25 КОНД М24В’-1’
Е24П1 КОНД Х’FFFFFF’
ШКОБМ КОНД В’0’
ДЛЯЗП КОНД В’7777777700177777’
ЭКБУД КОНД В’0’ ДЛЯ ЭК7700
ОПТИМ КОНД (2)В’0’
БУДГДР КОНД В’0’
Е17Е13 КОНД М12В’1’М16В’1’
ТРЭ60Д КОНД М17В’1’В’20’
NНАПР КОНД В’0’
СМШГ КОНД В’-1’   ШКАЛА
ЕСАЦ1 КОНД В’0’
Н19 КОНД В’-1’М18В’1’
БУДСМЕ  пам     1
ГРАФАЛ  пам     65
ГРАСИ   пам     2
БУДГРА  пам     2
ошмг	конд	в'0000000000000377'
	конд	в'0000000000000377'
	конд	в'0000000000000377'
	конд	в'0000000000000377'
БУДЖ	пам	1
МИН	конд	п'000100'
ШСБРОС	конд	в'7777777777777777'
Е18Е17	конд	п'000300'
МСЗАК КОНД В’-1’    МАСКА РАЗРЕШ.РАБОТЫ С ТЕРМИНАЛ
Ш1	пам	1
ШАРСИС	пам	1
ШАРКЗ	пам	1
ШАРБОП	пам	1
Ш2	пам	1
Ш3	пам	1
	конд	в'0000000040000000'
	пам	1
СОБА40	конд	в'0010000000000040'
ШЗАПОС	пам	1
ШОПТИМ	пам	1
ШЗАВЕТ	пам	1
ШКПРЕ	пам	1
РЗ КОНД В’0’
РЗ1 КОНД (6)В’0’
Е41П1	КОНД	М41В’-1’В’-1’
ОЧКУСД	пам	17
ДЛЯНБ КОНД В’0’
Е47П1 КОНД М47В’1’В’-1’
ШР КОНД Х’419922000000’
Е17П1 КОНД В’377777’
П277 КОНД В’277’
Е42П1 КОНД В’-1’М42В’77’
МД29М	пам	2
шкдт1	пам	2
КСН	конд	в'2400000000000000'
	конд	в'4000000000000000'
КСО	конд	в'5400000000000000'
	конд	в'4000000000000000'
Е31П17  конд    в'0000017777600000'
ОССТБД	конд	в'7777760000177777'
КОК	конд	в'7777777777600000'
БЯК	пам	1
ШКЗЛ	конд	в'6000000105600000'
УЧЕТРВ	пам	1
УЧКОН	пам	1
ШКАКОН	конд	в'0000000000377760'
КУС545 КОНД М24В’445’М17В’1’ КАТАЛОГ ЗОН
КУСБК	конд	п'01Ж200'
	конд	п'01З200'
КУСВЫВ	конд	п'01И200'
МАЛКАТ	конд	в'0000000000400030'
РОСППМ	конд	в'0000000077270707'
	пам	1
	конд	в'7777777777777777'
	конд	в'7727070700000000'
	конд	в'0101542702001000'
	конд	в'0101542302001000'
	конд	в'0101540102001000'
	конд	в'0101541202001000'
	конд	в'0101542002001000'
БМБ	пам	1
длянур	пам	1
неэ71б	пам	1
ДУК	пам	3
ЛТБД	пам	1
О22П16	конд	в'7777777760077777'
ФКУСА	пам	1
ФКУСАБ	пам	1
ФКУСАД	пам	1
ОЧЛИС	пам	16
ОЧЛИСД	пам	17
ЛИС2	пам	6
	конд	в'4000000000004037'
	конд	п'000003'
ЯЛИС	пам	1
ЯЛИСМБ	пам	1
МБЛИС	пам	16
ЛИС1Б	пам	3
П14037	конд	в'0000007740370000'
ЗОНВЫ	пам	1
ГРАН    пам     1
ГРАНЬБ	пам	1
блобмб	пам	1
	пам	1
обмотв	пам	1
ИВ	пам	1
	конд	п'600000'
	пам	1
неисп1	пам	2
ИВ25А	конд	в'0000000201302007'
	пам	17
ИВ23    пам     1
ИВ24	конд	в'0000000000017606'
ИВ25	конд	в'0000000201302007'
	пам	1
П60П44	конд	в'6044'
ЛИСТЫ	конд	в'2031376340000000'
МАКЗ	конд	п'00000П'
ШКНПП	пам	3
	конд	в'4000000000000000'
ИВ34	пам	3
П41 КОНД В’41’
УПОК КОНД В’200302007’
ВИГ11 ПАМ 1
ВХ1220 ПАМ 1
БНСО ПАМ 1
Е48П24	конд	в'7777777740000000'
Е1П23	конд	в'0000000037777777'
Е47П33	конд	в'3777740000000000'
оли	конд	в'7777776033407777'
Е48П7	конд	в'7777777777777700'
ШККТ	пам	1
ШОЧКТ   пам     1
ШЗУПР	пам	1
ЭТУПР	пам	1
БУДУПР	пам	1
SSЕСТЬ	пам	1
Л175	конд	в'7640000000000000'
П27	конд	в'0000000000000027'
ШЗБУДС	пам	1 системный буд.
ШЗБУДП	пам	1 пользоват. буд.
ШКДТ	пам	11 таймер сист. кол-во тик х 2@12
ШКДТП	пам	11
ШКЗЗК	пам	1
шкззк1  пам     1
NБЛ	конд	в'0000000000007777'
ПРСВЛ	конд	в'7540000000000000'
ШМАРС	пам	1
РОДОН	пам	1
КДД     КОНД    В’-1’М16В’3’
КДВ	конд	в'7777777777000000'
П17777	конд	в'0000000000017777'
П37777	конд	в'0000000000037777'
РТР	пам	1
О29П17	конд	в'7777774000177777'
О46П31	конд	в'6000007777777777'
ШКАП	пам	1
МЛЕС  пам     1
ШКМБ	пам	1
ШКМБП	пам	1
ШКОМБ	пам	1
ШКОБП   пам     1
ШКМД	пам	1
ШКМДП	пам	1
ШКОМД	пам	1
ШКОДП	пам	1
ШКМЛ	пам	1
ШКМЛП	пам	1
ШКОМЛ	пам	1
ШКОЛП	пам	1
КОТК	конд	в'6000000001000000'
ШКОГ	конд	п'0 F000'
ОТВКАЧ	конд	п'400000'
ШКОШ	пам	1
ШК31	пам	1
СКБЭ    пам     1
нбт1	конд	в'0000000000377776'
НБТ	конд	в'0000000000370037'	НАПР. МБ, ТРАКТ
КВЭ600	конд	в'0010037600000000'
	конд	в'0010037774000000'
РАБ600	пам	2
ТАБТИП  пам     13
ШКНП	пам	1
УПРЯТ	пам	1
ШКВОС	пам	1
РАБЕ16  пам     1
окдвиб	пам     4
ШКЧТЕН	конд	в'7777777777777777'
КУСНН	конд	в'0004040301400000'
ШАРКЗМ	пам	1
сохпри	пам	1
ШРНОМБ	пам	1
ЛПРОЦ	пам	1
дпа1	мод	ТУС-1+'31'
	по	ШЗЗ
	нед	
	или	E26
	уиа	БМВ(М16)
	пб	ЗАПВЕТ
ОТКАЗН	уиа	'2003'
	или	ШКСВН
	зп	ШКСВН
	счи	М7
	сда	64-2
	или	КОТК
	уиа	БИНОТ2(М15)
	пб	ТБУФ
*
***** БЛОК ОБРАБОТКИ ВНУТРЕННИХ ПРЕРЫВАНИЙ *****
*
* !ДИСП70-93 СТР.990/1001
внупр	счрж	'77'	*С БЛОК ВНУТРЕННИХ ПРЕРЫВАНИЙ
	зп	РК
	счи	М17
	зп	И17
	счмр	64
	зп	РМР
	счи	М16
	зп	И16
	счи	М15
	зп	И15
	счи	М20
	зп	И20
	рег	'237'	СЧИТЫВАНИЕ ГРП
	зп	РЭ4
	и	ПОДПРГ	ВЫДЕЛ. РАЗРЯДОВ ГРП: 23-20, 15-13
	зп	РЭ2
	сч	ГАШРП1
	уи	
	рег	'37'	ГАШЕНИЕ ГРП
	сч	РЭ2
	по	БМВ	*С ЛОЖНОЕ ПРЕРЫВАНИЕ
	нед	
	уи	М16	*С ЗАНОС НА М16 НОМЕР ПР-НЫ ПРЕРЫВАНИЯ
	пб	ШЗЗОБМ(М16)
ТВ201	счи	М27	*С ПОДПРАВКА М33 - АДЕРСА ВОЗВРАТА
	зп	РЭ1
	и	E10	10Р =1, КОГДА ПРИН. СЛЕД. КОМ. НА РК,
* А ПРЕРЫВАНИЕ ПРОИЗОШЛО В МОМЕНТ ВЫПОЛНЕНИЯ ПРЕДЫДУЩЕЙ НА РР
	сда	64+1
	зп	РЭ2
	нтж	E9
	нтж	РЭ1
	уи	М27
	или	РЭ2
	пино	тв203(М16) *С М16 <> 0
	сч	РЭ1
	нтж	РЭ2
	уи	М27
тв203	и	E9
	по	подад *С НЕТ Е9 В М27, М33 НЕ ИЗМ. НА -1
	счи	М33
	слц	Е15П1
	уи	М33
подад	счи	М33	*С СМ = М33
	пб	(М15)
чисчжл	сч	РЭ4	*С ПРОВЕРКА НА ЧУЖОЙ ЛИСТ
	сда	64+4
ТВ204А	и	П37
	зп	РЭ1
	нтж	П37
	уи	М17
	сч	ГУС
	уи	М15
	сда	64+15
	и	П377
	по	мет	*С ИПЗ ЭТОЙ ЗАДАЧИ
	уи	М15
	мод	ТУС-1(М15)
	уиа	(М15)
мет	счи	М17
	нтж	П37
	сда	64-6
	или	РК
	зп	РК
	сч	22(М15)
	и	E48(М17)
	пе	АВДРУГ	*С ЛИСТА В ОЗУ НЕТ
	сч	32(М15)
	и	E48(М17)
	уиа	4(М16)
	по	СТ175	*С ОШИБКА ГРП ИЛИ ЗАЩИТЫ, ПРИПИСКИ
	сч	ГУС
	и	E48
	пе	КЛИН
	сч	ШКОБМ
	мод	НЗАД
	или	E48-1
	зп	ШКОБМ
	пб	ВИСП3
КЛИН	мод	НЗАД
	сч	E48-1
	нтж	ВСЕЕД
	и	ШОПТИМ
	зп	ШОПТИМ
	сч	НЗАД
	и	Е47П1
	или	E42	ЛИСТ В ОБМЕНЕ
	мода	
	пв	ЗАПВЕТ(М16)
	пе	БПУ
	сч	E13
ЗАКЛИ	или	РЭ1	ЗАКР. ЗАД. НЕТ ЛИСТА
	сда	64-23
	или	ГУС
	зп	ГУС НОМЕР ЛИСТА, ИЗ-ЗА КОТ. ЗАКРЫТА ЗАДАЧА
ВИСП3	уиа	БПУ(М15) УПРЯТЫВАНИЕ ЗАДАЧИ
	пб	тв16
ТВ205	уиа	17(М17)	ОБРАЩЕНИЕ В ЧУЖОЙ ЛИСТ ЗА КОМАНДОЙ
	пио	ЗАПРК(М16) *С ОБРАЩЕНИЕ В ЧУЖ. ЛИСТ ЗА КОМАНДОЙ
	уиа	16(М17)	*С ЧИСЛО В ЧУЖОМ ЛИСТЕ
	пб	ЗАПРК
КОНКОМ	счи	М27
	и	E13	КК В ОС ПО ВИНЕ ЭВМ
	пе	СТ175
	уиа	20(М17) КК
ЗАПРК	мод	И16
	уиа	(М16)
	мод	И15
	уиа	(М15)
ТВ206А	счи	М17
	уиа	'2003'
	сда	64-41
	зп	РЭ2	НОМЕР ПРИЧИНЫ В ИПЗ МАТЕМАТИКА
	счи	М16
	зп	И16
	мод	ГУС
	уиа	(М16)
	сч	36(М16)
	и	Е41П1
	или	РЭ2
	зп	36(М16)
	сч	41(М16)
	и	Е47П1
	зп	41(М16)
	сч	ШКОК
	мод	НЗАД
	и	E48-1
	по	МЕЖ1
	пио	ЭК74(М17)
МЕЖ1	мод	ГУС
	сч	33
	и	E22
	по	Ф4
ЭК74	мод	И16
	уиа	(М16)
	мод	И17
	уиа	(М17)
АВРАСП	сч	Е33	*С ВЫЗОВ НА АВРАСП
	пб	ВЫЗОВ
АВОСТА	сч	36(М15)
	и	Е41П1
	зп	36(М15)
	счи	М17
	сда	64-41
	или	36(М15)
	зп	36(М15)
	уиа	МЕЖ1(М17)
	счи	М17
АВ	зп	3(М15)
	сч	5(М15)
	и	Е16П32
	или	П2007
	зп	5(М15)
	пб	(М16)
ЗПСЧ	уиа	ЗАПРК(М15)
	пб	ТВ201
тв210	счи	М17
	зп	И17
	уиа	(М17)
	сч	ШКОК
	мод	НЗАД
	и	E48-1
	пе	Э13
	уиа	Е10П3(М17)
Э13	счи	М32
	слц	Е15П1
	уи	М32
	уи	М33
	пб	ТВ206А
ТВ202	уиа	(М16)
	пб	ТВ201
ТВ213	сда	64+10	НОМЕР ЛИСТА МАТЕМ. ЗАДАЧИ НА ПРОВЕРКУ
	пб	ТВ204А	СВОЕГО ЛИСТА
ТВ215	уиа	23(М17)	*С ОСТАНОВ ПО КРА
	пб	ЗАПРК	*ОСТАНОВ ПО КРА М34
ТУ101	сч	РМЛ	КВАНТ ВР-НО СВОБОДНО
	слц	E42
	по	БУДИЛ
	зп	РМЛ
	уиа	-1(М16)
неэ71	сч	БМБ+1(М16)
	нтж	РМЛ
	и	Е47П43
	пе	неэ71а
	сч	МГРП
	и	E45(М16)
	по	неэ71а
	сч	E21(М16)
	увв	'31'
	сч	E2(М16)
	зп	БМБ+1(М16)
	или	неэ71б
	зп	неэ71б
неэ71а	цикл	неэ71(М16)
	сч	ШКПЛАН
	по	ВЫЗРЕЗ
	и	E19
	пе	ВЫЗРЕЗ
	сч	3
	нтж	Е42П1
	и	Е48П25
	по	ВЫЗРЕЗ
	сч	ШКПЛАН
	или	E19
	зп	ШКПЛАН	ЗАПРЕТ ВЫЗОВА ПЛАНИРОВЩИКА
	сч	E40
ТВ41	уиа	'2003'
	или	ШКИВ
	зп	ШКИВ
	сч	ВИГ11
	пе	БМВ
	уиа	БПУ(М16)
ВИСП15	сч	E43
	пв	ВШГ(М15)
	зп	ВИГ11
	сч	ИВ24
	зп	ИВ+3
	сч	ИВ25
	зп	ИВ+5
	пб	(М16)
ПРОУПР	и	ШКЗЗК
	пе	ПОГРУП
	сч	ШЗУПР
	нед	
	уи	М15
	мод	ТУСП-1(М15)
	сч	5
	и	E3
	пе	ПОГРУП
	сч	E48-1(М15)
	уиа	БВЗ1(М16)
	пв	ИЗШГП(М15)
	сч	ШКИВ
	или	E16
	зп	ШКИВ
	сч	ВИГ11
	пе	БВЗ1
	пб	ВИСП15
ВЫЗРЕЗ	уиа	-1(М16)
	пб	прб
граф    сч     б+1
        пв      ВШГП(М15)
	зп	б+6
	сч	0
	зп	б+1
*
*****	БЛОК ВЫДАЧИ ИНФ. НА ТЕЛЕТАЙП	*****
*
* !ДИСП70-93 СТР. 1238/1247
ту10	уиа	(М17)	ДЛЯ УХОДА НА СЧВРЕМ.
	ржа	'3'
	сч	РСЧРАЗ
	по	ottvt	НЕТ РАБОТЫ ДЛЯ РАЗМЕТКИ
	сч	ТРАЗМ
	слц	E1
	зп	ТРАЗМ
	нтж	ЗТРАЗМ
	пе	ottvt	СЧЕТЧИК НЕ ИСТЕК
	сч	РСЧРАЗ
	и	E48
	по	счраз2	*С НЕ ФОРМЛЕНИЕ БЛАНКА
	нтж	РСЧРАЗ
	зп	РСЧРАЗ
	сч	П3
	увв	'141'	УСТ. РЕЖ. РАЗМЕТКИ В КВУ
счраз1	сч	
	зп	ЗТРАЗМ
	зп	ТРАЗМ
	пб	ottvt
счраз2	сч	E2
	увв	'141'
	сч	РЕЖРАЗ
	или	E37
	зп	РЕЖРАЗ
	пб	счраз1
врзад	уи	М16
	сч	Т
	слц	E1
	зп	Т	ВРЕМЯ ЖИЗНИ ОС
	сч	33(М16)
	слц	E24
	зп	33(М16)
	по	будил1	
	мод	НЗАД
	сч	E48-1
	и	ШЗАПОС
  	по	тв217 *С ВРЕМЯ ИСТЕКЛО
будил1	сч	ВРЕМЯ
	слц	E1
	зп	ВРЕМЯ
*НОВАЯ РЕД "ГОРИ"?
	сч	ГУС
	и	E48
	по	нпрмб	?СЧЕТЧИК ДЛЯ МБ
	сч	ШГ
	пе	БПУ
	пб	нпрмб
будилс	сч	РМЛ 	!СТАРАЯ МЕТКА "БУДИЛ"
	и	Е40П1
	зп	РМЛ
	сч	3
	нтж	Е42П1
	и	Е48П25
	по	БМВ
	сч	ШЗПОМД
	или	E24
	зп	ШЗПОМД
	нтж	E24
	пе	спи1
	уиа	Д10(М15)
	счи	М15
	зп	ИПЗМД+3
	сч	E44
	мода	
	пв	ВШГ(М15)
спи1	сч	E26	*С ВЫЗОВ НОМБОБ
	пб	ТВ41	ВЫЗОВ НЕРЕЗИДЕНТА ОПРОСА МГ
тв217	уиа	38(М17)	*С ИСТЕКЛО ВРЕМЯ
	пб	ЗАПРК	НА ЗАКР. ЗАДАЧИ И ВЫЗОВ НЕРЕЗ. АВРАСТ
тв218	зп	РЭ1
	увв	'4034'	*С МПРП <> 0
	или	РЭ1
	и	МПРП
	по	БМВ	*С ЛОЖНОЕ ПРЕРЫВАНИЕ
	зп	РЭ1
	и	E8
	пе	тв219	
	сч	РЭ1
тв219	нед	
	уи	М17
	сч	E48-1(М17)
	зп	НСТПРП	НОМЕР ЕДИНИЧКИ РАЗР. ПРЕРЫВАНИЯ
	нтж	ВСЕЕД
	увв	'30'	ГАШЕНИЕ ПРЕРЫВАНИЯ В ПРП
	сч	E37
	нтж	ВСЕЕД
	уи	
	рег	'37'	ГШЕНИЕ ГРП
	слиа	-25(М17)
	пб	ОБВНП3(М17)	НА ПЕРЕКЛЮЧАТЕЛЬ ПРП
ОБВНПР	счрж	'77'	*С ОБРАБОТКА ВНЕШНИЙ ПРЕРЫВАНИЙ
	зп	РК
	счи	М20
	зп	И20
	счмр	64
	зп	РМР
	счи	М17
	зп	И17
	счи	М16
	зп	И16
	счи	М15
	зп	И15
БМВ	рег	'237'
	и	шкпре1
	пе	куку
	рег	'237'
	или	ШКПРЕ
	и	ГАШРП1		ВЫДЕЛ. ВНЕШНИХ ПРЕРЫВАНИЙ
	и	МГРП
	зп	РЭ1
	и	каска
	пе	куку	*С ПРИШЛО ПРИОРИТ. ПРЕРЫВАНИЕ
	сч	РЭ1
	по	БМВ1	*С ВСЕ ПРЕРЫВАНИЯ ОБСЛУЖЕНЫ
куку	нед	
	уи	М16
	сч	E48-1(М16)
	нтж	ЕДК10Р
	уи	
	рег	'37'	*ГАШЕНИЕ СООТВЕТ. РАЗРЯДА ГРП
	пб	ШЗЗОБМ(М16)
ШЗПОМД	пам	1
ШЗПОМБ	пам	1
ШЗЗОБМ	пам	1
обвнп1	мод	ТУС+1 СИ А0
	пб	СИАЦПУ-ПЕЧАТЬ
	мод	ТУС+1 СИ А1
	пб	СИАЦПУ-ПЕЧАТЬ
	уиа	1(М16) своб МБ1
	пб	СВОБМБ
	уиа	2(М16) своб МБ2
	пб	СВОБМБ
	мод	ТУС-1+'24' С 44 Р. ГРП СИ ВУ0
	пб	СИСТР-ВВОД1
	мод	ТУС-1+'24' *С 43Р. ГРП СИ ВУ1
	пб	СИСТР-ВВОД1
	мод	ТУС-1+'24' *С 42Р. ГРП СИ ФС0
	пб	СИФСМ-ВВОД1
	мод	ТУС-1+'24' *С 41Р. ГРП ПСИ ФС1
	пб	СИФСМ-ВВОД1
пусгра	сч	б+1 таймер *С 40 Р. ГРП.
*
	АПУ     (&К71).ДА0А
	пб	графу !ВЗУ - ГРАФОПОСТРОИТЕЛЬ
*
	АПБ	.ОБЩ0А
*
.ДА0А АНОП
	пб	загл7б !К-71. ЗАГЛУШКА ГРАФОПОСТРОИТЕЛЯ
*
.ОБЩ0А АНОП
	мод	ТУС+1 *С 39Р. ГРП ноль А0
	пб	НОЛЬ-ПЕЧАТЬ
	мод	ТУС+1 *С 38Р. ГРП ноль А1
	пб	НОЛЬ-ПЕЧАТЬ
	увв	'4030' ПРП	*С 37Р. ГРП
	пб	тв218
	уиа	3(М16) *С 38Р. ГРП гот напр. 3
	пб	прл
	уиа	4(М16) *С 37Р. ГРП гот напр. 4
	пб	н1352
	уиа	5(М16) *С 38Р. ГРП гот напр. 5
	пб	прл
	уиа	6(М16) *С 37Р. ГРП гот напр. 6
	пб	прл
	сч	ЗАНЯТА запрос
	пб	ЗАПРОС	*С 32Р. ГРП
	сч	ШК31 ТТ старт
	пб	дпа1
	сч	ШКПРЕ  имитация
	пб	ИМИТАЦ *С 30Р. ГРП
	уиа	3(М16) *С 29Р. ГРП своб 3
	пб	прмд
	уиа	4(М16) *С 28Р. ГРП своб 4
	пб	прмд
	уиа	5(М16) *С 27Р. ГРП своб 5
	пб	ПРОБМ
	уиа	6(М16) *С 26Р. ГРП своб 6
	пб	ПРОБМ
	сч	МГРП   *С 25Р. ГРП своб 7
*
       АПУ     (&К71).ДА0
	пб	труба !ГРАФОПОСТРОИТЕЛЬ
       АПБ	.ОБЩ0
*
.ДА0 АНОП
	пб	загл7а !К-71
.ОБЩ0 АНОП
грп24	стоп    ,      ГРП 24
	пб	обвнп1+24
 СЧ ГУС    23Р.ДЕЛЕНИЕ НА НУЛЬ
 ПБ ПРДЕЛ
 СЧ ГУС           ПЕРЕПОЛНЕНИЕ АУ 22Р. ГРП
  ПБ ПЕРЕП
	сч	РЭ4    ГРП 21
	пб	ВЫЗКЧ
	уиа	чисчжл(М15) *С ЗАКРЫТ ЛИСТ 20Р. ГРП М15 = чисчжл
	пб	хм	ЛИСТ ЗАКРЫТ ПО ВЫБОРКЕ ЧИЛСА 20Р.
	увв	'4100'
*	кк	27,'4100' !ИЗ ДИСП70-93 НУЖНО ЛИ?
	пб	vt19	ШТАТНАЯ РАБОТА
	увв	'4100'	
*	кк	27,'4100' !ИЗ ДИСП70-93 НУЖНО ЛИ?
	пб	vt19	ШТАТНАЯ РАБОТА
 УИА 22(М17)  ПО ЗП
 ПБ ЗПСЧ
 УИА 21(М17)  ПО СЧ
 ПБ ЗПСЧ
	уиа	ГРП15(М15) *С ОСТ. ПО ЗАПИСИ 17Р. ГРП М15 = ГРП15
	пб	ТВ201 ОСТАНОВ ПО ЗАПИСИ ЧИСЛА В ЯЧ-КУ 17 Р.
 УИА ТВ213(М15)    *С ОБР.В ЗАКР.ЛИСТ ЗА КОМ.14Р.М15=ТВ213
 ПБ ТВ202         ОБРАЩЕНИЕ В ЗАКРЫТЫЙ ЛИСТ ЗА КОМАНДОЙ
 УИА 18(М17)       *С ЗАПРЕЩ.КОМАНДА 13Р.ГРП
  ПБ ЗАПРК
 УИА ТВ215(М15)    *С ОСТАНОВ ПО КРА 12Р.ГРП М15=ТВ215
 ПБ ТВ202         ОСТАНОВ ПО КРА
грп11	стоп	
	пб	обвнп1+37
грп10	сч	ДОП
	пб	врмл ПЕРЫВ. ПО 10Р. ГРП
ОБВНП3	мод	ТУС-1+'24'  ПРП 24
	пб	СИСТР-ВВОД1   СИ УВВК ИПМ смещение
	мод	ТУС-1+'24'  ПРП 23
	пб	СИСТР-ВВОД1  СИ УВВК-1 ИПМ смещение
	мод	ТУС-1+'24'  ПРП 22
	пб	СИКНЦ-ВВОД1 СИ НАЧ. П/К УВВК ИПМ;КОНЦА П/К ЗАВОДС
	мод	ТУС-1+'24'  ПРП 21
	пб	СИКНЦ-ВВОД1  СИ КОНЦА ИЛИ НАЧ. П/К УВВК-1
	мод	ТУС-1+'37' СИ КОНТР. ПИ-0 ПРП 20
	пб	41
	мод	ТУС-1+'37' СИ КОНТР. ПИ-1  ПРП 19
	пб	41
	мод	ТУС-1+'37' СИ ПРОБИВКИ ПИ-0 ПРП 18
	пб	41
	мод	ТУС-1+'37' СИ ПРОБИВКИ ПИ-1 ПРП 17
	пб	41
	мод	ТУС-1+'33' СИ КОНТР. ПЛ-0 ПРП 16
	пб	ММБН
	мод	ТУС-1+'33'  СИ КОНТР. ПЛ-1 ПРП 15
	пб	ММБН
	мод	РОДОН   ПРП 14
	пб
	пб	ГАСИ13  ПРП 13
        мода
	уиа	(М16)   ПРП 12
	пб	прсn	ПРИЕМ С 0-ГО КОНСУЛА
	уиа	1(М16)  ПРП 11
	пб	прсn    ПРИЕМ С 1-ГО КОНСУЛА 11Р. ПРП
	уиа	(М15)   *С СИ ОТ 0-ГО КОНСУЛА ПРП 10
	пб	вдсn	ВЫДАЧА СИМВОЛА
	уиа	1(М15)  *С СИ ОТ 1-ГО КОНСУЛА ПРП 9
	пб	вдсn	ВЫДАЧА СИМВОЛА
прп8	мода	,        ПРП 8
	пб	БМВ
прп7	мода	,        ПРП 7
	пб	БМВ
прп6	мода	,        ПРП 6
	пб	БМВ
прп5	мода	,        ПРП 5
	пб	БМВ
прп4	мода	,        ПРП 4
	пб	БМВ
	пам	1       ПРП 3
	уиа	3(М16)  ПРП 2
	пб	ПРЗАХВ
	уиа	4(М16)  ПРП 1
	пб	ПРЗАХВ
нагп	и	E4
	пе	БМВ
	сч	ТУС-1+'55'
	уи	М17
	пб	E30(М17)
*
ВРЕСОБ	сч	СМ
	и	П3777
	уиа	1(М17)
БУД	уиа	'2003'
	мод	НЗАД номер программного канала
	уиа	(М16)
	и	П3777
	пе	ТАЙМ
	сч	ШЗБУДС(М17)
	или	E48-1(М16)
	нтж	E48-1(М16)
	зп	ШЗБУДС(М17) СНЯТИЕ "1" ЗАКАЗЧИКА
	пб	(М15)
ТАЙМ	слц	П3777
	зп	РЭ2
	сч	ШЗБУДС(М17)
	или	E48-1(М16)
	зп	ШЗБУДС(М17)
	счи	М17
	уиа	-10(М17)
	пе	ТАЙР
ТАЙМ1	сч	РЭ2
	мода	(М16)
	сда	64-38(М17)
	нтж	ШКДТП-1(М17)
	и	E48-1(М16)
	нтж	ШКДТП-1(М17)
	зп	ШКДТП-1(М17)
	цикл	ТАЙМ1(М17)
	пб	(М15)
ТАЙМЕР	уиа	(М17)
	пб	БУД
ТАЙР	сч	РЭ2
	мода	(М16)
	сда	64-38(М17)
	нтж	ШКЗЗК-1(М17)
	и	E48-1(М16)
	нтж	ШКЗЗК-1(М17)
	зп	ШКЗЗК-1(М17)
	цикл	ТАЙР(М17)
	пб	(М15)
вводп1	слц	E1
	зп	СЧПР2
	нтж	П5
	пе	БМВ
	зп	СЧПР2
	уиа	-1(М15)
вводп2	сч	шкдт1+1(М15)
	по	вводп3
	сда	64+1
	зп	шкдт1+1(М15)
	пе	вводп3
	сч	П236
	увв	'175'(М15)
вводп3	цикл	вводп2(М15)
	сч	ШЗБУДС
	по	ТАЙ1
	уиа	-10(М15)
ТАЙМ2	нтж	ШКДТП-1(М15)
	зп	ШКДТП-1(М15)
	счмр	64
	и	ШКДТП-1(М15)
	по	ТАЙ1
	цикл	ТАЙМ2(М15)
	зп	РЭ1
	нтж	ШЗБУДС
	зп	ШЗБУДС
НСОБ	сч	РЭ1
	по	ТАЙ1
	нед	
	уи	М16
	сч	РЭ1
	нтж	E48-1(М16)
	зп	РЭ1
	сч	ПРЕДЕЛ
	и	E31
	по	ОБСО1
	сч	E48-1(М16)
	нтж	E24
	по	есацпу !В ДИСП70-93 ОТС. НЕ АДРЕС. !ТАС+?
ОБСО1	сч	E48-1(М16)
	пв	ВШГ(М15)
	пб	НСОБ
ТАЙ1	сч	ШЗБУДП
	по	ТУ101
	уиа	-10(М15)
ТАЙ2	нтж	ШКЗЗК-1(М15)
	зп	ШКЗЗК-1(М15)
	счмр	64
	и	ШКЗЗК-1(М15)
	по	ТУ101
	цикл	ТАЙ2(М15)
	зп	РЭ1
	нтж	ШЗБУДП
	зп	ШЗБУДП	ЗАКАЗ ВЫПОЛНЕН
	пб	НЕТСО
НЕСОБ	сч	МШГП
	или	E48-1(М16)
	зп	МШГП
	пб	НЕТСО
метр	сч	62(М17)
	и	E25
	по	НЕСОБ
	счи	М16
	или	E25
	пв	ЗАПВЕТ(М16)
НЕТСО	сч	РЭ1
	по	ТУ101
	нед	
	уи	М16
	сч	РЭ1
	нтж	E48-1(М16)
	зп	РЭ1
	сч	НЗАД(М16)
	уи	М17
	сч	ЭКБУД
	и	E48-1(М16)
	по	метр 	ПРИКАЗ НЕ ВЫЗЫВАТЬ
	нтж	ЭКБУД
	зп	ЭКБУД	ГАШ. ПРИЗН. ВЫЗОВА ПРИКАЗА
	сч	E48-1(М16)
	пв	ВШГП(М15)
	пб	НЕТСО
ПРДЕЛ	и	E48
	по	СТ175
	уиа	14(М17)
	пб	ЗАПРК	ВЫЗОВ "ПРИКАЗ"
ГАСИ13	сч	E13
	пв	ГАШПРП(М15)	ГАШ. МАСКИ
диалс	сч	E19	*С ВЫЗОВ ДИАЛОГА Е19
	пб	ТВ41	ВЫЗОВ ДИАЛОГА
ПЕРЕП	и	E48
	по	АВАРИЯ
	уиа	15(М17)
	пб	ЗАПРК
нпрмб	сч	б+6
	по	БМВ
	сч	
	зп	б+6
БПУ	уиа	'2003'	!ОНА ЖЕ "ТВ18"
	сч	СМ2
	пе	БМВ
	мод	ГУС
	уиа	(М17)
	сч	4(М17)
	и	Е48П16
	зп	РЭ2
	счи	М27
	зп	РЭ1
	сч	СМ	СУММАТОР
	счм	РК	СМ В ИПЗ РК НА СМ
	счм	РМР	РК В ИПЗ+1, РМР НА СМ
	счим	М33	РМР В ИПЗ+2, И33 НА СМ
	счим	М32	М33 В ИПЗ+3, М32 НА СМ
	или	РЭ2
	счм	(М17)
	и	Е48П16
	или	РЭ1
	счм	И20	М27 В ИПЗ+5, М20 НА СМ
	счм	И17	М20 В ИПЗ+5, М17 НА СМ
	счм	И16	М17 В ИПЗ+5, М16 НА СМ
	счм	И15	М16 В ИПЗ+5, М16 НА СМ
	уиа	12(М16)	ПЕРЕНОС МОДИФ. ЗАДАЧИ В ИПЗ.
БПУ1	слиа	-1(М16)	М15 В ИПЗ+11, М14 НА СМ
	счим	М1(М16)
	пино	БПУ1(М16)
	зп	(М17)	М1 В ИПЗ+25
БВЗ	сч	ГУС	БЛОК ПЕРЕКЛЮЧЕНИЯ С ЗАДАЧИ НА ЗАДАЧУ
	сда	64+41
	уи	М17
	сч	ГУС
	зп	ТУС-1(М17)
	сч	мбвз
	зп	ГУС
	сда	64+41
	зп	НЗАД
	сч	П13
	уи	М21
	уи	
	сч	ТАБЛО
	увв	'147'
	уиа	'2003'
	уиа	-8(М17)
	сч	SSЕСТЬ
	пе	БВЗ1
	сч	МШГП
	нтж	ВСЕЕД
	и	ШГП
	и	ШЗАВЕТ
	по	БВЗ1
	сч	ШКПРЕ
	или	E30
	зп	ШКПРЕ
БВЗ1	сч	ШГ
	и	МШГ
	и	СМШГ
	пе	БВЗС
	сч	МШГП
	или	ШЗАПОС
	и	ШГП
	и	СМШГП
	зп	ТВР1
	и	ШЗУПР
	пе	ПРОУПР
	сч	ТВР1
	и	E17
	пе	БВЗ2
	сч	ТВР1
	и	ШЗАПОС
	пе	БВЗ2
ПОГРУП	сч	ЛЕСТ-1(М17)
	и	ТВР1
	пе	ЕВГРУП
	сч	ГРУП
	и	ШКРЗ
	пе	НЕТЗД
	цикл	ПОГРУП(М17)
НЕТЗД	сч	ТУС-1
	зп	ГУС
	уи	М17
	сч	
	зп	НЗАД
	пб	БВЗ20
ЕВГРУП	зп	ТВР1
	и	МИН
	пе	БВЗ2
	сч	ЛЕСТ-1(М17)
	зп	ДГРУП
	уиа	-3(М16)
ПОЛЕСТ	сч	швверх(М16)
	и	ТВР1
	пе	БВЗ2
	цикл	ПОЛЕСТ(М16)
БВЗС	нед	
	зп	НЗАД
	уи	М15
	сч	ТУС-1(М15)
	зп	ГУС
	пб	БВЗА
БВЗ2	нед	
	или	E48
	зп	НЗАД
	уи	М15
	сч	НЗАД(М15)
	зп	ГУС
	мода	
	пв	ПРОВЛ(М14)
БВЗА	сч	ГУС
	уи	М17
	сда	64+15
	и	П377
	по	БИЗ
	уи	М14
	мод	ТУС-1(М14)
	уиа	(М17)
БИЗ	сч	НЗАД
	и	E48
	по	БВЗ20
	сч	МИН
	или	ШЗАПОС
	и	E48-1(М15)
	пе	БВЗ20
	сч	Е36(М17)
	зп	КВАНТ
	слц	33(М17)
	по	БВЗ21
	сч	Е36(М17)
	и	П177
	сд	КВНСДВ
	слц	33(М17)
	нтж	Е48П24
	нтж	Е36(М17)
	и	Е48П24
	нтж	Е36(М17)
	зп	Е36(М17)
	пино	НЕПОСЛ(М16)
	уиа	-2(М16)
	сч	швверх
	нтж	E48-1(М15)
	и	ДГРУП
	пе	ВВЕРХ
БВЗ20	сч	
	зп	КВАНТ
БВЗ21	уиа	БВЗ32(М15)
	пб	БИЗОН1
ВВЕРХ	сч	швверх(М16)
	и	ДГРУП
	зп	ШКМГОС
	нтж	швверх(М16)
	зп	швверх(М16)
	сч	шввер1(М16)
	или	ШКМГОС
	зп	шввер1(М16)
	цикл	ВВЕРХ(М16)
	уиа	-1(М16)
НЕПОСЛ	сч	E48-1(М15)
	нтж	швверх(М16)
	зп	швверх(М16)
	сч	E48-1(М15)
	или	КВНСДВ(М16)
	зп	КВНСДВ(М16)
	пб	ПОЛЕСТ
ЗАНПРП	слиа	64(М17)
ЗАНПР	уиа	'2003'
	сч	ГУС
	и	КРОМЕ
	зп	ГУС
	счи	М17
	сда	64-15
	или	ГУС
	зп	ГУС 	ЗАПИСЬ ТУС ЗАДАЧИ В ГУС
	мод	ТУС-1(М17)
	уиа	(М17)     АДРЕС ИПЗ
БИЗОН1	уиа	-6(М16)
бизон	зп	1
	цикл	бизон(М16) *С АДРЕС ИПЗ НА М17 НЕ МЕНЯТЬ
	сч	32(М17)
	сда	64-4
	рег	'30'	УСТАНОВКА ЗАЩИТЫ 0-7 МАТЕМ. ЛИСТОВ
	сч	32(М17)
	сда	64+4
	рег	'31'	УСТАНОВКА ЗАЩИТЫ 8-15 МАТЕМ. ЛИСТОВ
	сда	64+8
	рег	'32'	УСТАНОВКА ЗАЩИТЫ 16-23 МАТЕМ. ЛИСТОВ
	сда	64+8
	рег	'33'	УСТАНОВКА ЗАЩИТЫ 24-31 МАТЕМ. ЛИСТОВ
	уиа	-7(М16)
	слиа	32(М17)
бвз3	сч	(М17)
	рег	'27'(М16)
	цикл	бвз3(М16)
	пб	(М15)
БВЗ32   уиа     -11(М16)
        мод     ГУС
        уиа     24(М17)
        сч      бве48
        нтж     E48
        слц     9(М17)
        зп      9(М17)
        сч      E48
        зп      бве48
        сч      (М17)
        уиа     '2000'
        уи      М35
        уиа     '2003'
        сч      (М17)
        уиа     '2000'
        уи      М34	ЗАНОС НА М34
        уиа     '2003'
        сч      (М17)
БВЗ4 УИМ М14(М16)      ВОССТАНОВЛЕНИЕИР1÷14
 ЦИКЛ БВЗ4(М16)
 ЗПМ И15           И15=М15 СМ=М16
 ЗПМ И16           И16=М16 СМ=М17
 ЗПМ И17           И17=М17 СМ=М20
 ЗПМ И20           И20=М20 СМ=М27
 УИ ’27’
 СДА 64+15
        по      ОБЩМГ
 УИМ ’21’          СМ=М32
 УИМ ’32’          ВОССТ.М32 СМ=М33
 УИM ’33’      ВОССТ М33
 ЗПМ РМР           РМР=РМРМ СМ=РКМ
 ЗПМ РК            РК=РКМ СМ=СММ
 ЗП СМ            ВОССТ-ИЕ СУММАТОРА
        рег     '107'
        сч      23(М17)
        и       E48
        по      БМВ1
        рег     '101'
БМВ1	сч	ЭКО
	пе	ЕСЭ
*
	АПУ	(&К71).ДА0Б
	АПБ	.ОБЩ0Б
*
.ДА0Б АНОП
КИК	сч	НЗАД
	пб	кик7а !В ВЗУ
*
.ОБЩ0Б	АНОП
КИК1	ноп
 МОД И16
 УИА (М16)
 МОД И15
 УИА (М15)
 СЧ И20
 УИ ’20’
 СЧ РМР           В ЭТОМ  БЛОКЕ  НЕЛЬЗЯ ИСПОЛЬЗОВАТЬ
 НТЖ 0             КОМАНДЫ  МОД  И МОДА.
 СЧ СМ
 РЖ РК
 ВЫПР (М3)
*М17 - АДРЕС ИПЗ, М16 - РАБОЧИЙ, М15 - ВОЗВРАТ
УСТПРП	уиа	'2003'	РАЗРЕШ. ПРЕРЫВАНИЯ ОТ УСТР-В ПРП
	зп	РЭ1
	нтж	ВСЕЕД
	увв	'30'
	сч	РЭ1
	или	МПРП
	зп	МПРП
	увв	'34'
	сч	E37	РАЗРЕШ. РАБОТЫ С ПРП В ГРП
	и	МГРП
	пе	(М15)	*С ОТКРЫВАТЬ 37Р. В МГРП НЕ НАДО
	сч	E37
ТВ67	уиа	'2003'	БЛОК ГАШЕНИЯ ГРП
	зп	РЭ1	ЗАНОС В МАСКУ ГРП
	нтж	ВСЕЕД
	уи	
	рег	'37'	ГАШЕНИЕ ГРП
	сч	РЭ1
	или	МГРП
ТВ67Б	зп	МГРП
	рег	'36'	ЗАНОС В МАСКУ ГРП
	уи	
	пб	(М15)
ГАШПРП	уиа	'2003'	БЛОК ГАШЕНИЯ МПРП И ЗАНОС В МАСКИ
	и	МПРП
	нтж	МПРП
	зп	МПРП
	увв	'34'
	пе	(М15)	*С ГАСИТЬ 37Р. МГРП НЕЛЬЗЯ
	сч	E37
ТВ67А	уиа	'2003'	БЛОК ГАШЕНИЯ МАСКИ ГРП
	нтж	ВСЕЕД
	и	МГРП
	пб	ТВ67Б
*блок ждущего теста
БЖТ	сч	E21
	или	ТАБЛО
	увв	'147'	ЖДУ НА ТАБЛО
	уиа	'2003'
	сч	КЛИЕНТ
	или	КЛИЕНП
	по	бжт1	КАЧКУ НЕ ВЫЗЫВАТЬ
	сч	ПОДНОС
	или	ПОДП
	пе	бжт1	КАЧКУ НЕ ВЫЗЫВАТЬ
	сч	КЛИЕНТ
	зп	ПОДНОС
	сч	КЛИЕНП
	зп	ПОДП
	сч	E38
	пв	ВШГ(М15)
бжт1	уиа	'4003'
	уиа	-15(М1)
кцжт	сч	ШГ
	и	МШГ
	пе	кцжт2
	сч	ШГП
	и	МШГП
	по	кцжта
кцжт2	уиа	кцжта(М16)
	уиа	'2003'
	уии	М33(М16) А ВОЗВРАТА
	пб	АНВО6А
кцжта	ноп
*
	АПУ	(&К71).ДА0В
	уиа	-89(М15) !ДИСП70-93
	АПБ	.ОБЩ0В
.ДА0В АНОП
	уиа	-100(М15) !ВЕРОЯТНО ОТРИЦ. ЧИСЛО, НО ЗНАЧ. ДРУГОЕ
*	уиа	номлин(М15) !К-71?
.ОБЩ0В АНОП
	уиа	'3'
кцжт1	цикл	кцжт1(М15)
	цикл	кцжт(М1)
	пб	БЖТ
*
***** ВЫЗОВ НЕРЕЗИДЕНТА *****
*
* !ДИСП70-93 СТР. 1904/1973
ТВ40	уиа	'2003'	*	ВЫЗОВ НЕРЕЗИДЕНТОВ
	зп	РЭ2
	счрж	'177'
	зп	РК
	сч	РЭ2
	пб	ВЫЗОВ
ТИВ	сч	36(М16)
	зп	И16
	сда	64+15
	и	П77
	нтж	КНАПР+1
	уиа	(М16)
	по	тв2а
	уии	М27
	счи	М32
	уи	М33
	сч	ГУС
	и	E48
	пе	тв2а	ПОЛЬЗОВАТЕЛЬ
	уиа	1(М16)
	сч	П7
	уи	М27
тв2а	сч	ШЗН(М16)
	мод	НЗАД
	или	E48-1
	зп	ШЗН(М16)
	уиа	ВИСП3(М16)
	сч	ВИГ11
	пе	ВИСП3	*С ВИСП ЗАНЯТ
	пб	ВИСП15
ЗАПР1	сч	6(М15)
	зп	ТР3+3(М15)
	цикл	ЗАПР1(М15)
	сч	E25
	пб	ТВ41
*ИСКЛЮЧЕНИЕ НЕРЕЗИДЕНТА, ВТОРОЙ РАЗ ОБРАЩАТЬСЯ К НЕМУ НЕЛЬЗЯ
бинот	уиа	'2003'
	уии	М17(М16)	АДРЕС ВОЗВРАТА ПОСЛЕ ОТВЕТА
бинот1	уиа	'2003'
	нед	
	уи	М15
	сч	ШКСВН
	или	E48-1(М15)
	зп	ШКСВН
	сч	ТУС-1(М15)
	сда	64+8
	и	П177
	уи	М16
	сч	ШКСВМ
	или	E48(М16)
	зп	ШКСВМ
	сч	E48-1(М15)
	нтж	Е36
	пе	(М17)
	уии	М15(М17)
	сч	E8
	пб	ГАШЗАН
БИНОТ2	сч	ВИГ11
	пе	ВИСП16	*С ВИСП ЗАНЯТ
	сч	ШКИВ
	или	ШЗН
	или	шзн1
	по	ВИСП16
	мода	
	пв	ВИСП15(М16)
ВИСП16	уиа	БВЗ(М15)
* НЕ ОТДЕЛЯТЬ ВИСП16 ОТ ТВ16
тв16	сч	НЗАД	*С ВЫБРОЗ ИЗ ШГ ПО НЗАД
	уи	М17   
	и	E48     признак типа задачи. 
	пе	тв16а
	сч	E48-1(М17)
	пб	ИЗШГ
тв16а	сч	E48-1(М17)	ВЫБРОС ИЗ ШГ
	пб	ИЗШГП
БЛИСКН  уиа     БИНОТ2(М17)	*С ИСКЛЮЧЮНИЕ НЕРЕЗИДЕНТА ИЗ ОП
        пб      бинот1
БЛИСКВ  уиа     '2003'  *С ИСКЛ. НЕРЕЗ. ИЗ РАБОТЫ ОСТАВ. В 0
        нед
        уи      М15
        сч      Е48-1(М15)
        или     ШКСВН
        зп      ШКСВН   	НЕРЕЗИДЕНТ СВОБОДЕН
        сч      Е48-1(М15)
        или     ШКНП
        зп      ШКНП
        пб      БИНОТ2
*
***** БУФЕР ..... БУФЕР *****
*
* !ДИСП70-93 СТР. 2253/2322
ТБУФ	уиа	'2003'	*С ДАЙ ИЛИ ВОЗЬМИ БУФЕР
	зп	СМ
	уиа	2(М16)
	по	тбуф1	*С ДАЙ ЛИСТ
*лист (2000(8)) или сектор (400(8)) ОЗУ
	нтж	E1
	пе	тбуф9	*С ВОЗЬМИ БУФЕР СМ <> 1 <> 0
	сч	ШКСВМ
	уиа	(М16)
	пе	тбуф1а	ЕСТЬ АБЗАЦ
	уиа	БМБ-1(М16)
	сч	ШКНП
	по	тбуф7	НЕТ АБЗАЦА
тбуф1а	нед	Е15П1	ЛИСТ
	уи	М17
	сч	ШКСВМ(М16)
	нтж	E48(М17)
	зп	ШКСВМ(М16)
	пио	тбуф6(М16)
	сч	ТУС(М17)
	сда	64+8
	и	П177
	пб	(М15)
тбуф6	счи	М17
	пб	(М15)
*
тбуф1	уии	М16(М15)
	сч	ПОДНОС
	или	ПОДП
	пе	огуля	КАЧКА ЗАНЯТА
	сч	ШГ
	или	E38
	зп	ШГ
огуля	сч	ПОДНОС
	мод	НЗАД
	или	E48-1
	зп	ПОДНОС
ТБУФ13	счи	М15
	зп	И15
ТБ13	уии	М33(М16)
	сч	К2013
	уи	М27
	счрж	'77'
	зп	РК
	пб	ВИСП3
*
тбуф7	мод	НЗАД
	сч	E48-1
	или	ТР13
	зп	ТР13
	уиа	ТБУФ(М16)
	пб	ТБУФ13
тбуф9	сда	64+12
	по	ПЛВОЗУ	?*С ВОЗЬМИ ЛИСТ
	сч	СМ	ВОЗЬМИ АБЗАЦ
	и	E19
	пе	тбуф10
	сч	СМ
	сда	64+10
	уиа	3(М16)
	и	П77
	по	СТ175
	уи	М16
	сч	E48(М16)
	или	ШКСВМ
	зп	ШКСВМ	ВЗЯЛИ АБЗАЦ
тбуф9а	сч	ШГ
	или	ТР13
	зп	ШГ
	сч	
	зп	ТР13
	уиа	-5(М16)
тбуф9б	зп	2
	цикл	тбуф9б(М16)
	пб	(М15)
тбуф10	сч	СМ	ВОЗЬМИ ЛИСТ
	сда	64+12
	и	П37
	по	СТ175
	уи	М16
	уии	М17(М10)
	мода	
	пв	УПРИ(М10)
	уии	М10(М17)
	сч	СМ
	сда	64+42
	пе	сохлис
	сч	Е48П17
	уиа	'2002'
	и	ТОП(М16)
	по	тбу10б
тбу10а	стоп	28086
	пб	тбу10а
тбу10б	зп	ТОП(М16)
	уиа	'2003'
	сч	E48(М16)
	нтж	ТЗФСТР
	зп	ТЗФСТР
	пб	тбуф9а
сохлис	сч	СМ
	и	Е48П43
	сда	64+1
	уиа	'2002'
	или	ТОП(М16)
	зп	ТОП(М16)
	уиа	'2003'
	пб	тбуф9а
ЗАНОСМ  уиа     '2003'
        сч      '41'(М7)
        слц     ВРМАТ
        зп      ВРМАТ
        сч      E48
        зп      '41'(М7)
        пб      (М16)
ГАШЗАН	уиа	'2003'
	зп	СМ
	или	ЗАНЯТА
	нтж	СМ
	зп	ЗАНЯТА
	сч	СМ
	и	E5
	по	прок
	сч	ШКОМБ
	по	прок
	или	ШКМБ
	зп	ШКМБ
	сч	
	зп	ШКОМБ
прок	сч	ШГ
	или	ШКЗАН
	зп	ШГ
	сч	ШГП
	или	шкзан1
	зп	ШГП
	сч	
	зп	ШКЗАН
	зп	шкзан1
	пб	(М15)
ЗАХЗАН   уиа     '2003'
        зп      СМ
        и       ЗАНЯТА
        по      занзан
        сч      ГУС
        сда     64+47
        уи      М16
        мод     НЗАД
        сч      E48-1
        или     ШКЗАН(М16)
        зп      ШКЗАН(М16)
        уиа     ЗАХЗАН(М16)
        пб      ТБУФ13
занзан  сч      ЗАНЯТА
        или     СМ
        зп      ЗАНЯТА
        пб      (М15)
ПЕРЕВ   уиа     '2003'
        зп      СМ
        уиа     -5(М16)
        ржа     '3'
перев1  сда     64+8
        зп      РК
        сч      СМ
        умн     Ч01Д
        зп      СМ
        счмр    64
        умн     R
        сда     64-40
        или     РК
        цикл    перев1(М16)
перев2  уиа     '3'
        пб      (М15)
ИЗ10В8   уиа     '2003'
        сда     64-32
        зп      СМ
        ржа     '3'
        уиа     -3(М16)
        сч
из10в  умн     R
        счмр    64
        зп      РК
        сч      СМ
        сда     64-4
        зп      СМ
        счмр
        слц     РК
        цикл    из10в(М16)
        пб      перев2
ВЕТКА	счи	М16
	зп	И16
	по	atan
	счрж	'37'
	или	П13
	зп	РК
	счи	М16
	нтж	П6
	по	нет
	нтж	E1
	по	нет
	сч	E16
	мода	
	пв	ПЕЭКС(М16)
нет	слиа	-8(М16)
	сч	ГУС
	и	E48
	по	ЭКВЫХ
	пино	э79(М16)
	сч	ВРЕМЯ
	пб	ЭКВЫХ1
ЭК57	счрж	'7777'
	зп	РК
	счи	М16
	сда	64+3
	нтж	П60
	по	э57а
	сч	РК
	уиа	э38+4(М16)
	пб	э38
э57а	счи	М16
	зп	И16
	сч	
	пб	КИПР
э79	сч	E35
	пб	ТВ40
пеэ50	счрж	'77'
	или	E4	ВЫЗОВ Э50
	зп	РК
	сч	И16
	нтж	E8
	нтж	E5
	по	ВХ220
	сч	E11
	мода	
	пв	ПЕЭКС(М16)
	сч	И16
	нтж	П177
	нтж	E2
	пе	ЭКЛИСТ
	сч	СМ
	сда	64+5
	и	П177
	уиа	36(М16)
	по	ЗАПЭКС
	пб	ЭКВЛ
Э60	зп	И16
	счрж	'37'
	или	E5
	зп	РК
	сч	E11
	пв	ПЕЭКС(М16)
	сч	E21	ВЫЗОВ Э60
	пб	ТВ40
ЗАПВЕТ	уиа	'2003'
	зп	РЭ2
	уи	М17
	мод	НЗАД(М17)
	уиа	(М17)
	сда	64+24
	или	62(М17)
	зп	62(М17)
	сч	РЭ2
	сда	64+24
	или	E46(М17)
	зп	E46(М17)
	сч	E47(М17)
	и	Е15П1
	по	нетпр
	сч	62(М17)
	сда	64+24
	и	62(М17)
	по	нетпр
	сч	40(М17)
	и	E34
	по	нетпр
естьх	мод	РЭ2
	уиа	(М17)
	сч	ОСПОД
	и	E48-1(М17)
	пе	ужес
	сч	E48-1(М17)
	и	ШЗАПОС
	пе	ужес
	сч	E48-1(М17)
	или	ШЗАВЕТ
	зп	ШЗАВЕТ
	сч	МШГП
	или	E48-1(М17)
	нтж	E48-1(М17)
	зп	МШГП
	сч	E6
	увв	'31'
	сч	ШКПРЕ
	или	E30
	зп	ШКПРЕ
	пб	(М16)
нетпр	сч	ШКОК
	мод	РЭ2
	и	E48-1
	пе	ужес
	сч	E46(М17)
	сда	64+24
	и	E46(М17)
	пе	естьх
ужес	сч	
	пб	(М16)
э1а	счи	М16
	пио	э3а(М16)	*С М16 = 0
	зп	И16
	сда	64+3
	пе	пеэ50
	сч	И16
	нтж	E1
	пе	э2
	сч	СМ	ЕСЛИ СИНУС
Я	уиа	зsin(М16)
	пб	Э3
ЭКВВД	счрж	'177'
	или	П32
	слц	E1
	зп	РК
	счи	М16
	зп	И16
	нтж	Е15П1
	по	фт32
	сч	E14
	пв	ПЕЭКС(М16)
ЭКВВ	сч	E32	*С ВЫЗОВ НЕРЕЗИДЕНТА ЭКВВОД
	пб	ВЫЗОВ	ВЫЗОВ НЕРЕЗИДЕНТА ЭКВВОДА
э2	уиа	(М16)
	сч	СМ
	мод	И16
	пб	Э
э3а	уиа	э14+1(М16)
	сч	СМ
Э3	зп	СМ	СОХРАНЕНИЕ СМ, РК
	счрж	'7777'
э38	зп	РК
	счи	М17
	зп	И17
	счи	М15
	зп	И15
	ржа	'10'
	уиа	СМ(М17)
	пб	СММ16
	конд	в'0037000300040203'
	конд	в'0037000000340100'
ЗЕND	зп	СМ
	мод	И17
	уиа	(М17)
	рж	РК
ЭКВЫХ	сч	СМ
	уиа	'3'
	уи	
	зп	
	уиа	'2003'
	пб	УИИ
э9	уиа	54(М17) ОШИБКА ЛОГАРИФМ Х<0
	пб	Э13
э10	уиа	53(М17)  ОШИБКА КОРЕНЬ Х<0
	пб	Э13
э11	уиа	55(М17) ЭКСПОНЕНТА Х≥63
	пб	Э13
э14	уиа	52(М17) АРКСИНУС > 1
	пб	Э13
	конд	в'7240477600340100'
*ВЫЧИСЛЕНИЕ SQRТ(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА=70МКСЕК.
*МАКС.ОТН.ПОГР.=1.5Е-12
*КОРЕНЬ ИЗВЛЕКАЕТСЯ ТОЧНО ИЗ ВСЕХ
*Х=N**2,ГДЕ 1 ≤ N ≤ 2**20
зsqr	зп	СМ
	ржа	'4'
	по	(М16)
	ржа	'20'
	пе	э10
	сда	64+1
	зп	РЭ3
	сч	СМ
	вчп	СМ
	зп	РЭ2
	умн	SQ2
	сл	SQ1
	умн	РЭ2
	сл	SQ0
	слпа	64+32
	слп	РЭ3
	зп	РЭ2
	сч	РЭ3
	ржа	'22'
	по	зsq1
	сч	РЭ2
	умн	ЭК6
	зп	РЭ2
зsq1	сч	СМ
	дел	РЭ2
	сл	РЭ2
	слпа	64-1
	зп	РЭ2
	сч	СМ
	дел	РЭ2
	сл	РЭ2
	слпа	64-1
	пб	(М16)
*ВЫЧИСЛЕНИЕ SIN(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА = 55МКСЕК.
*МАКС. ОТН. ПОГР.=4.Е-12
*ВСЕГДА АВS(SIN(Х)) ≤ 1
*ВСЕГДА SIN(Х)**2+СОS(Х)**2≤1.
зsin	знак	СМ
	умн	З1ЧРI
	ржа	'12'
	пе	зs3
зs1	ржа	'3'
	сл	ЭК9
	ржа	'22'
	зп	РЭ2
	счмр	64-40
	зп	РЭ3
	сч	РЭ2
	сда	64+8
	счмр	
	зп	РЭ2
	сч	РЭ3
	ржа	'12'
	пино	зs4(М16)
	вчоб	R05
	пб	зs2
зs4	пе	зs2
	вчоб	ЕХР0
зs2	знак	РЭ2
зs3	слпа	64+1
	зп	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-5(М16)
	сч	SIN6
зsinl	умн	РЭ4
	сл	SIN0(М16)
	цикл	зsinl(М16)
	умн	РЭ3
зsinl1	знак	СМ
	пб	ЗЕND
*ВЫЧИСЛЕНИЕ СОS(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА=55 МКСЕК.
*МАКС. ОТН. ПОГР. = 4.Е-12
*ВСЕГДА АВS(СОS(Х)) ≤ 1
Э18	знак	СМ
	зп	СМ
	умн	З1ЧРI
	уиа	(М16)
	пб	зs1
*ВЫЧИСЛЕНИЕ АТАN(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА = 90МКСЕК.
*МАКС. ОТН. ПОГР. = 7.Е-12
atan	сч	СМ
	пв	Э3(М16)
	знак	СМ
	зп	РЭ3
	уиа	E48(М16)
	слпа	64-1
	пе	зat1
	сч	ЕХР0
	дел	РЭ3
	зп	РЭ3
	уиа	ЭК38(М16)
зat1	сч	(М16)
	зп	РЭ2
	сч	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-2(М16)
зqat	сл	QАТАN1(М16)
	умн	РЭ4
	цикл	зqat(М16)
	сл	QАТАN0
	зп	РЭ5
	уиа	-3(М16)
	сч	РАТАN4
зpat	умн	РЭ4
	сл	РАТАN0(М16)
	цикл	зpat(М16)
	дел	РЭ5
	умн	РЭ3
	вч	РЭ2
	вчаб	
	пб	зsinl1
*ВЫЧИСЛЕНИЕ АSIN(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА = 80 МКСЕК.
*МАКС. ОТН. ПОГР. 7.Е-12
Э26	зп	РЭ5
	знак	СМ
	зп	РЭ3
	уиа	E48(М16)
	ржа	'10'
	пе	зas1
	вчоб	ЕХР0
	пе	э14
	слпа	64-1
	пв	зsqr(М16)
зasin	зп	РЭ3
	уиа	ЭК38(М16)
зas1	сч	(М16)
	зп	РЭ1
	сч	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-2(М16)
зqas	сл	QАSIN1(М16)
	умн	РЭ4
	цикл	зqas(М16)
	сл	QАSIN0
	зп	РЭ2
	уиа	-2(М16)
	сч	РАSIN3
зpas	умн	РЭ4
	сл	РАSIN0(М16)
	цикл	зpas(М16)
	дел	РЭ2
	умн	РЭ3
	слп	РЭ1
	вч	РЭ1
	вчаб	
	знак	РЭ5
	пб	ЗЕND
*ВЫЧИСЛЕНИЕ АLОG(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА =60 МКСЕК.
*МАКС. ОТН. ПОГР.=3.Е-12
*АLОG(1.) В ТОЧНОСТИ РАВЕН 0
Э33	знак	SIN1
	по	э9
	зп	СМ
	вчп	СМ
	вч	ЭК39
	зп	РЭ3
	сл	ЭК6
	дел	РЭ3
	зп	РЭ3
	умн	РЭ3
	зп	РЭ4
	уиа	-4(М16)
	сч	АLОG5
	ржа	'2'
зalogl	умн	РЭ4
	сл	АLОG0(М16)
	цикл	зalogl(М16)
	умн	РЭ3
	вч	LN2Ч2
	зп	РЭ5
	сч	СМ
	и	ЭК
	сда	64+7
	нтж	ЭК29
	умн	ЭК7
	сл	РЭ5
*ВЫЧИСЛЕНИЕ ЕХР(Х)
*СРЕДНЕЕ ВРЕМЯ СЧЕТА = 65 МКСЕК.
*МАКС. ОТН. ПОГР. =5.Е-12
	пб	ЗЕND
Э35	умн	З1ЧLN2
	зп	СМ
	вч	Ч63
	по	э11
	сл	Ч127
	пе	ЗСZЕR0
	сч	СМ
	ржа	'3'
	сл	ЭК9
	зп	РЭ3
	ржа	
	счмр	64-41
	зп	РЭ2
	сч	РЭ3
	сда	64+7
	счмр	
	нтж	E48
	зп	РЭ3
	уиа	-6(М16)
	сч	ЕХР7
зexpl	умн	РЭ2
	сл	ЕХР0(М16)
	цикл	зexpl(М16)
	зп	РЭ5
	умн	РЭ5
	слп	РЭ3
	пб	ЗЕND
ЗСZЕR0	сч	
	пб	ЗЕND
ПЕЭ52	счи	М16
	зп	И16
	по	КОСИН
	счрж	'77'
	или	П12
	зп	РК
	мод	ГУС
	сч	33
	и	E16
	по	КОСИН
	мода	
	пв	ПЕЭКС(М16)
КОСИН	счи	М16
	сда	64+2
	пе	ЗОВЫ
	уиа	Э18(М16)
	сч	СМ
	пб	Э3
НЛОГ КОНД М36В’-1’В’-1’
НФИЗ КОНД М36В’-1’В’-1’
НЕТНАП КОНД М39В’7’М7В’7’В’-1’
КАДР ПАМ 1
ХТЕК ПАМ 1
УТЕК ПАМ 1
ХМАХ ПАМ 1
 ЭКВИВ (ГРВ,Е8),(ГРН,Е6),(ПОДЧ,Е40),(КВНЗАД,Е36),(ПРМЗОН,Е37)
 ЭКВИВ (МГВЫБ,0) - так в ГНУС; в СВС - ячейка
 ЭКВИВ (Д,96),(КЛЕСТ,4),(ОБЩТОМ,57),(ЕЗП,Е7),(И,27)
 ЭКВИВ (НЗАРХ,Е6),(ШП,78),(ИНФ,77),(ЕКА,Е34),(МИ,32)
 ЭКВИВ (МДР,65),(МИНЗ,Е1),(Е15П1,П77777),(ОБЩМЛ,76)
 ЭКВИВ (МАСГЛ,69),(ШПЭГ,72),(СОБЫТ,62),(ТЕРЕЗА,61)
 ЭКВИВ (ЯЧК,40),(ЕПИ,Е41),(ЗАВР,Е5),(ЕОПР,Е27)
 ЭКВИВ (ЕЕСТИО,Е47),(ПЗ,64),(ЧПЗ,47),(МЧПЗ,ЧПЗ-1)
 ЭКВИВ (НПЗ,48-ЧПЗ-1),(ШЗНМБ,41),(ТРВР,14),(ТРВ,8)
 ЭКВИВ (ЕГРИ,Е29),(ЯЧГРИ,ШЗНМБ+13),(ЖДЕТ,71),(ЗОНЫ,66)
 ЭКВИВ (ЕТЗНУП,Е19),(ЕАР,Е18),(ПР13,П13),(ПР14,П14)
 ЭКВИВ (ШИФРМ,63),(ИНФСЛП,67),(ЯБКЗПА,5),(ШКСПЕЦ,Е17)
 ЭКВИВ (ЯЧВР,ШЗНМБ+13),(ЯЧЧАВ,ШЗНМБ+1),(ЯЧСЧМБ,ШЗНМБ+2)
 ЭКВИВ (ЯЧЛИС,70),(СДТ,27),(ЯЧОК,ШЗНМБ+13),(ЕОК,Е28)
 ЭКВИВ (ДЛИН,81),(НО,41),(УКА,Е48),(ВСК1,Е36П25)
 ЭКВИВ (АВОС,68),(ЕЗАР,Е17),(ПОЧТА,25),(ЕСПЕ,Е27)
 ЭКВИВ (ЕЗФ,Е23),(ЯЧЗФ,ШЗНМБ+13),(СДОП,26),(ЕСТОП,Е21)
 ЭКВИВ (ЯЧЭК,ШЗНМБ+13),(ЯЧСLС,ШЗНМБ+13),(ЕЭ52,Е21)
 ЭКВИВ (ЕВАМОS,Е20),(УКАЗД,40),(ЯЧОПР,ШЗНМБ+13)
 ЭКВИВ (ЕТЕЛ,Е33),(ЕН,Е15),(ТВ18,БПУ),(ЕКТ,Е47)
 ЭКВИВ (ЯЧНОМ,ШЗНМБ+15),(КГРУП,ЛЕСТ-ГРУП),(ЕПЕР,Е40)
 ЭКВИВ (ЯЧБКИО,1),(ЕБКИО,Е31),(ЕЗ,Е17),(ЕЧ,Е16),(СДВПР,5)
 ЭКВИВ (ЯЧКУПР,5),(ЕКУПР,Е16),(ЕЛЕН,Е44),(ДС,27)
 ЭКВИВ (ЯЧИУПР,22),(ЕИУПР,Е16),(СУММАВ,70),(ЕДОБ,Е2)
 ЭКВИВ (ЕУПРВП,Е24),(АХ,Е47),(СДВКУП,15),(СДВТУП,18)
 ЭКВИВ (ЯЧКОПИ,44),(ДТЗ,32),(СТ,СТ175),(ТВ206,ЗАПРК)
 ЭКВИВ (ЛИСТУП,П50),(ЕCLC,Е22),(ТВНПР1,обвнп1)
 ЭКВИВ (ТВНПР,ОБВНПР),(ТВНПР3,ОБВНП3)
 ЭКВИВ (ЕНИИАС,Е26),(ЯЧНИА,ШЗНМБ+13),(Е8П1,П377)
* разные внешние
*БОНБОТ ВНЕШ б
В1К ВНЕШ ВВОД1,СИСТР,СИФСМ,СИКНЦ
КИТ ВНЕШ СМ2
БОЭК1 ВНЕШ Ф4,АВАРИЯ,прсn,вдсn,ИМИТАЦ
БОЭК1 ВНЕШ АВДРУГ,ВЫЗОВ,ПРОВЛ,ПЛВОЗУ,ПЕЭКС,КИПР,ЭКВЛ
ВИСП ВНЕШ ВШГ,ИЗШГ,ВШГП,ИЗШГП
ВЗУ ВНЕШ Э1,ЗОВЫ,УИИ,СММ16,ЗАПЭКС,ЭКЛИСТ,ЭКВЫХ1,АНВО6А
ВЗУ ВНЕШ кик7а,ВЫЗКЧ,ЗАПРОС,СБОЙБ,ЭККВМ
ВЗУ ВНЕШ ЭКС75,ЭКП,ЗОВИ,ПРХЭ67,ГОША,АЦПУ,ТУМБР
МОТТ ВНЕШ ШКАС,ШVD130,ДШКОПТ,ШЗНКТ,ШЗПРИМ,МОТТ
МОТТ ВНЕШ ottvt,ЭКО,П236,шас01,vt19
ДИСКИ ВНЕШ ДИСКИ,прб,прмд,ПРЗАХВ,Д10,ИПЗМД
ДМЛМБ ВНЕШ прл,ОБЩМГ,БУДИЛ,СВОБМБ,ПРЛСЧБ,ПРОБМ
КАЧКА ВНЕШ ПОДП,КЛИЕНТ,КЛИЕНП
КАЧКА ВНЕШ ШКРЗ,Е48П17,КАЧКА,ПОДНОС
КИТ ВНЕШ ИПЗ56,ИПЗ57,ДОП
ПЕЧАТЬ ВНЕШ ПЕЧАТЬ,СИАЦПУ,НОЛЬ
РЕЗАРХ ВНЕШ ВХ220,ИПЗРЭ
ХЛАМ ВНЕШ Э62,Э63,Э66,Э70,Э71,ИПЗ54,ИПЗ55
ХЛАМ ВНЕШ н1352,хм,врмл,ЕСЭ,фт32,УПРИ
СОСТАВ ВНЕШ ТОП
ОСА ВНЕШ есацпу
ФИЗОБМ  НОП
* входные
 ВХОД ЯЧЗФ,ЕЗФ,ЯЧЭК,ЕВАМОS,УКАЗД,ЯЧОПР,СДОП,ЕСТОП,СПR,КСП
 ВХОД ЯЧВР,ЯЧЧАВ,ЯЧСЧМБ,ЯЧЛИС,ЯЧОК,ЕОК,МИНЗ,ДЛИН,НО,ЕЗАР
 ВХОД ПЗ,МЧПЗ,ЧПЗ,НПЗ,ШЗНМБ,ТРВР,ТРВ,ЯЧГРИ,ЕГРИ,ШИФРМ
 ВХОД ЯЧНОМ,КГРУП,К,РОЙ,ДЛЯНБ,БУДСМЕ,Е17П1,ДЛЯЗП,ЕПЕР
 ВХОД ЯЧБКИО,ЕБКИО,шкззк1,О22П16,ЕЗ,ЕЧ,СДВПР,ММБН,ЕН
 ВХОД ЯЧКУПР,АХ,ЛИСТУП,МИ,ЕОПР,СП,ЕУПРВП,ОБЩМЛ,СТРЕЛ
 ВХОД ЕКУПР,ЕЛЕН,ЯЧCLC,ЕCLC,ЯЧИУПР,ЕИУПР,СУММАВ,ЕКТ,КАДР
 ВХОД СДВКУП,СДВТУП,ЯЧКОПИ,ДТЗ,СТ,ТВ206,ИВ25А,ПЕЭ52,ШР
 ВХОД НЗАРХ,ШП,ИНФ,ВИСП15,П17777,ОССТБД,КВЭ600,КЛИН,ЖДЕТ
 ВХОД МДР,ДС,ШКНТ,ШСЗПСЧ,СБОИМБ,Э76,Э77,ОБРМБ,СТМД
 ВХОД ОАС,ВРЕЗП,ТВ206А,КЛЮЧ,ЗАПР1,ВРЗАПР,ВРЕМЯ,Д,ТВ205,И
 ВХОД БМВ,ЭКВЫХ,ШАРКЗМ,Ш1М,ТВ40,э1а,СОБА40,Е47П33,УКА
 ВХОД ряо2,ССЫЛКА,П7,РЯО1,РЕЖРАЗ,РАЗМГ,ТУС,Е44П41,АПСЧБ
 ВХОД ОС1417,БИНОТ2,БУДЖ,Е24П13,грп24,Е16Е17,ВСК1,ЕСПЕ
 ВХОД ГАШРП1,ШКМДП,ЯЧКЧ,ту10,ИВ25,СТ175,КУСЛСВ
 ВХОД АСБОЙБ,Е37Е36,блобмб,БЯК,Е42П1,ТЗНМД,РСЧРАЗ,МАЛКАТ
 ВХОД П27,ипзмл3,тв210,НМБТР,ипзмл9,МИН17,ТВ67А,ИНФСЛП
 ВХОД ШЗРАЗМ,Е17Е13,БПУ,ЗАПВЕТ,шк14,МИН15,ЗОНЫ,ЗАВР,ЕПИ
 ВХОД П12,АВ,ЗАНПР,КРОМЕ,РТЛ,ГРАНЬБ,П14,МАСГЛ,ШПЭГ,АВОС
 ВХОД ВЫМГ,УПОК,шзраз1,ШЗЗ,НЛОГ,НФИЗ,СТМГ,СОБЫТ,ОБВНП3
 ВХОД НЕТНАП,Е47П1,ЗАПРК,П32,ЭКВВ,КИК1,ТЕРЕЗА,ТВ16
 ВХОД ТСЛ,Е6П4,ЭК38,ЭК30,УЧКОН,ШКЗЗ,Е48П25,ВКАНАЛ,ТАС
 ВХОД ШРНОМБ,М16В3,ЕТЕЛ,ГРАН,К2013,ШК31,ШОЧКТ,П377
 ВХОД СМ,РК,ГУС,Е48П43,СЧЗКМБ,НЗАД,ПРЕДЕЛ,Е48Е47
 ВХОД П17,И16,ШЗЗПСЧ,ШЗПОМБ,П13,ТМБ,ШГ,ИПОБМ,БИЗОН1
 ВХОД ГОД,СЧПР1,Р,R,нпрмб,РАБШК,естьс,ВИСП16,Е41П1
 ВХОД Е24П16,ИНФМБ,ИНФСЛЭ,П177,Е15П1,Е46Е45,Е24П1
 ВХОД МШГП,ЯЧВ1,БЛИСКН,ТБЗН,ТВ67Б,МЕЖ1,ТВ67,ТАЙМ
 ВХОД УСМ,УСММБ,П777,П3777,П1777,РЯО,Е33П25,ОЧКУС
 ВХОД ВСЕЕД,Е15П11,Е15П2,Е18Е17,Р1,РЭ2,РЭ3,ИЗ10В8,П37777
 ВХОД Е18П1,Е21Е1,Е21Е18,Е26Е25,Е46П48,Е47П43,ЕСЧ
 ВХОД ЗОНАМЛ,ЗОНАТР,ЗОЧ1Б,И15,И17,И20,МГРП,врзад,УСТПРП
 ВХОД НОММЛ2,Ш1,ШАРБОП,ШКМЛ,ШРЕС,ПРСВЛ,РАБЕ16
 ВХОД КЛЮЧРЗ,КУС2,ЛИСТА,МБКУС,МГНЕИС,МПРЛ,МШГ,НАПРМГ
 ВХОД ОЧКСУМ,ОЧКУСД,ОЧМБ,П140,П2007,П23,П3,П30,ОСПОД
 ВХОД П37,П5,П6,П60,П77,П7777,ПРИП,РМЛ
 ВХОД Е16П32,ВСЕ6,Е40П1,Л175,ячобмл
 ВХОД РМР,РЭ1,РЯО5,СМШГП,СЧЗАК,ТРАЗМ,ТУСП,УКАЧАЙ,КНАПР
 ВХОД УКАЧП,ФКУС,ФКУСА,ФКУСАБ,ФКУСАД,ФКУСД,ФКУСМБ
 ВХОД ШАРКЗ,ШАРСИС,ШГП,ШЗЗОБМ,ШЗПОМД,ШКИВ,ШКМБ,ШКМД
 ВХОД ШКОМБ,ШКОМД,ШКОМЛ,ШКОТ,ШКОШ,ШМАРС,ШОПТИМ,ЯЛИСМБ
 ВХОД ТБУФ13,ГАШЗАН,БВЗ,ЗАХЗАН,БМБ,РОДОН,ШКОБМ,РАБ600
 ВХОД Е48П16,ШКПРЕ,ЭК9,ШКОДП,НОММЛ1
 ВХОД ШКЗАКЗ,ШКЗАКС,ЗАНПРП,ШКАРУ
 ВХОД РМД,Е43Е42,Е44Е43,МД29М,Е44П42
 ВХОД Е34П25,Е48П37,Е39П25,КСД3,Е7Е21
 ВХОД ПОДЧ,КВНЗАД,ПРМЗОН,МГВЫБ,ОТВКАЧ,КДД,ЗАНОСМ,О29П17
 ВХОД ЯЧРЖПЛ,НРЕ,ТМД,ИПЗЖТ,ШКСВН,ВРМАТ,МД5,ОЗУ,КДВ,П77777
 ВХОД ТОБ,РЯОМБ,НОММБ2,НОММЛ3,ШЗНМБО
 ВХОД СТЗОН,ЧПОД,ГРВ,ГРН,Е48П9,обвнп1
 ВХОД ШОЧМГ,ШОЧНАП,КМИН,ТЗОНМЛ,ГРУП,СБМГМД
 ВХОД NБЛ,УЧЕТРВ,РМЛ1,РМД1,ПР13,ТБУФ1,нбт1
 ВХОД ТЗНМЛ,БНСО,БМВ1,СКЛАД,ШККТ,о28511,длянур,ПОЧТА
 ВХОД ШКОК,ШКСВМ,РЯПСЗ,ЗУК,ЗАНЯТА,ШИФРАЦ,НОММБ,НОММБ1
 ВХОД ЖИЗОС,ТЗФСТР,НОММЛ,ПОТЕРИ,МПРП,ШКПЛАН,ЗОЧ2,ШКЗЗП
 ВХОД ШКНАЧ,ЯКУС,ЯКУСМБ,РЯО3,ЯМ16,ОКДВИЖ,ОШМЛ,БОБСВЗ
 ВХОД ТВР1,ШКЗАН,КУСБК,КУС1Б,ШИФРПЛ,РОСППМ,П277,ТВ204А
 ВХОД СОЛ,ЯМ15,БОБ,ИПЗМЛ,Т,ШЗН,РШЗН,РШКИВ,граф,ЗПСЧ
 ВХОД ФИЗ,РЭ4,РЭ5,РЭ6,РЭ7,ЛЕСТ,ШККЗ,ТРР,ТРР1,ТАЙМЕР,НБТ
 ВХОД ЭКБУД,ОПТИМ,БУДГДР,СМШГ,Ш2,Ш3,ШЗАПОС,дляди1,ТВ215
 ВХОД Е31П17,КОК,ЗАКЛИ,СЧК,МБЛИС,ЛИС1Б,МСК,э9,ТВ202
 ВХОД ШЗАВЕТ,УПРЯТ,ШКВОС,ОЧЛИС,ОЧЛИСД,ЛИС2,ЯЛИС,ВХ1220
 ВХОД ЗОНВЫ,ИВ,ДУК,ШЗУПР,ЭТУПР,БУДУПР,SSЕСТЬ,КМБТТ,ШККАН
 ВХОД ШЗБУДС,ШЗБУДП,ЭК46,ШКМГОС,О46П31,ТИВ,ШКМБП,нагп
 ВХОД ШКДТ,ШКДТП,ШКЗЗК,ШКОГ,ВИГ11,ШКАП,МПЗ,МТЗ,РТР,пусгра
 ВХОД ПАК,ЕДК10Р,РЯР,СЧПР2,УХО,СКБЭ,П14037,ЛЕНТА,обмотв
 ВХОД вводп1,ТВ201,ТВ41,ТБУФ,ТАБЛО,НОМАРС,АЗУ,КСД1,РЗ,РЗ1
 ВХОД Е36П25,ПЕРЕВ,ГАШПРП,Е10П3,Е12Е11,ТАБТИП,АВРАСП,Н19
 ВХОД БУДГРА,ГРАФАЛ,ГРАСИ,ЯЧК,ЕКА,ВРЕСОБ,ВИСП3,ОБЩТОМ
 ВХОД КВАНТ,ЭК74,Е18Е11,ШКАЛА8,ШКОД,ШКПЛАВ,окдвиб,КСУМ1Б
 ВХОД ШКНП,ШКНПП,ШКЧТЕН,Ч1Д,ОТКАЗН,МИН,ШКЗЛ,ЕNR,будилс
 ВХОД КУСНН,ИВ34,ЛИСТЫ,ИВ23,П50,ЕЗП,П60П44,АВОСТА,Е35П24
 ВХОД ЕТЗНУП,ЕАР,КУС545,КУСВЫВ,МАКЗ,Е35П31,сохпри,ЗТРАЗМ
 ВХОД К2003,ПР14,КСО,Е1П23,МЛЕС,КСВЗ,Е18П16,П40,ошмг,внешпр
 ВХОД ЯБКЗПА,МСЗАК,ШПРИК,ТУМБ6,ТР3,ТР4,ТР5,ШКСПЕЦ,Е48П24
 ВХОД БВЗ32,БВЗ4,ВЕТКА,спи1,ЕСАЦ1,СТУСТР,ФИЗОБМ,ШСБРОС
 ВХОД ТАБОШ,РЯВВ1,Р3,Р4,КСН,ЕЭ52,КВНСДВ,Е48П7,ЗАХВМЛ,НЕТСО
 ВХОД КЛЕСТ,ЕДОБ,МИНУТА,П20,ЛПРОЦ,КИК,оли,ЛТБД,припа
 ВХОД ШКПУСК,ТРЭ60Д,БЛИСКВ,ЯЧКЧМБ,НСТПРП,Ч01Д,ТВ18,ТБ13
 ВХОД символ,симво1,тслк71,факел,тблк71,СМЕЩ,ВРЕМЯР
 ВХОД ИСЛОБМ,Е46П25,ШКОЛП,СУММА,ЯЧНИА,ЕНИИАС,ШКОБП,б
 ВХОД ХТЕК,УТЕК,ХМАХ,Э73,е48нрт
*
	АПУ     (&К71).ДА1
***************ВНЕШ ДЛЯ ШТАТНОЙ РАБОТЫ *******************
ВЗУ ВНЕШ труба,графу
*********************************************************
	АПБ	.НЕТ1
.ДА1 АНОП
******************* ВНЕШ ДЛЯ РАБОТЫ К-71 ******************
КОНФУС ВНЕШ Э52777
ВЗУ ВНЕШ загл7а,загл7б
МОТТ ВНЕШ номлин
***********************************************************
.НЕТ1 АНОП
	ФИНИШ

