шифр 419999^
лен 67(2248)^
лен 43(2222-зп)^
росп 0^
вход 1000^
е
в 1000
к 00 070 1003
к 00 070 1004
к 00 30 70000
с 0010 3400 0067 0105
с 0010 3500 0067 0106
в 2000
а1
мдл   дисп70430000^наз   000010^зонгп 430621     4^
мдл   взу   430010^
мдл   терм  430020^
мдл   качка 430040^наз   072000^зонгп 430625     2^
мдл   кит   430050^
мдл   диски 430060^
мдл   мотт  430030^наз   076000^зонгп 430627     1^
мдл   гнус  430070^наз   020000^зонгп 430736     1^
мдл   состав430007^
мдл   авмд  430110^наз   020000^зонгп 430605     1^
мдл   прик6 430120^наз   021000^зонгп 430534     1^
мдл   боэк1 430130^наз   015000^зонгп 430475     2^
мдл   висп  430140^
мдл   дмлмб 430150^наз   064000^зонгп 430755     2^
мдл   хлам  430100^
мдл   есмл  430160^наз   062000^зонгп 430671     1^
мдл   э71тк 430170^наз   011400^зонгп 430572     1^
мдл   consul430174^наз   011000^зонгп 430567     1^
мдл   бонбот430164^наз   030000^зонгп 430422     1^
конец ^
_$
еконец
